{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/391321-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 391321, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mandarin Pork and Wild Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 288.85, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (11 ounces) mandarin oranges', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup thinly sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 boneless pork loin chops (3/4 inch thick and 5 ounces each), cut into strips', u'aisle': u'Meat', u'name': u'pork loin chops', u'metaInformation': [u'boneless', u'cut into strips', u'(3/ and 5 ounces each)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin-chops.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10062, u'unit': u''}, {u'originalString': u'1 package (6.2 ounces) fast-cooking long grain and wild rice mix', u'aisle': u'Pasta and Rice', u'name': u'quick-cooking white rice', u'metaInformation': [u'long grain', u'wild'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.2, u'consistency': u'solid', u'id': 20048, u'unit': u'ounces'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/mandarin-pork-and-wild-rice', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Sprinkle pork with pepper and salt. In a large skillet, brown pork in oil. Meanwhile, drain oranges, reserving juice; set oranges aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the water, rice mix with contents of seasoning packet, onions and reserved juice to the skillet. Bring to a boil. Reduce heat; cover and simmer for 10-12 minutes or until meat is no longer pink and liquid is absorbed. Stir in oranges; heat through.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 40, u'instructions': u'Directions                                                                                Sprinkle pork with pepper and salt. In a large skillet, brown pork in oil. Meanwhile, drain oranges, reserving juice; set oranges aside.                                                                                            Add the water, rice mix with contents of seasoning packet, onions and reserved juice to the skillet. Bring to a boil. Reduce heat; cover and simmer for 10-12 minutes or until meat is no longer pink and liquid is absorbed. Stir in oranges; heat through.                                        Yield: 4 servings.                                                                                                                         Originally published as Mandarin Pork and Wild Rice in  Simple & DeliciousJanuary/February 2007, p30                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1-1/4 cups) equals 274 calories, 6 g fat (1 g saturated fat), 17 mg cholesterol, 678 mg sodium, 45 g carbohydrate, 2 g fiber, 12 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/mandarin-pork-and-wild-rice-391321', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}