{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/439241-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 420, u'id': 439241, u'veryPopular': False, u'lowFodmap': False, u'title': u'Take The Night Off Slow Cooker Pineapple Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 230.8, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'4 pounds bone-in chicken breast halves with skin', u'aisle': u'Meat', u'name': u'chicken breast halves', u'metaInformation': [u'bone-in', u'with skin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 1045062, u'unit': u'pounds'}, {u'originalString': u'1/2 cup dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'2 teaspoons ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 (8 ounce) can pineapple chunks with juice', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'with juice', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Take-The-Night-Off-Slow-Cooker-Pineapple-Chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place chicken breasts into the bottom of a slow cooker.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Pour pineapple chunks with juice over chicken.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1029354, u'name': u'pineapple chunks'}]}, {u'equipment': [], u'step': u'Drizzle with honey and soy sauce and sprinkle with brown sugar and ginger. Set cooker on High and cook for 1 hour. Reduce setting to Low and cook until chicken is cooked through, moist, and tender, about 6 more hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 326, u'instructions': u'Place chicken breasts into the bottom of a slow cooker. Pour pineapple chunks with juice over chicken. Drizzle with honey and soy sauce and sprinkle with brown sugar and ginger. Set cooker on High and cook for 1 hour. Reduce setting to Low and cook until chicken is cooked through, moist, and tender, about 6 more hours.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/take-the-night-off-slow-cooker-pineapple-chicken-439241', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 430, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}