{u'recipes': [{u'sourceName': u'Smells Like Home', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/587751-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 587751, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peach Cobbler', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 121.28, u'creditText': u'Smells Like Home', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'2 tbsp dark-brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'tbsp'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3/4 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'10 ripe peaches, halved, pitted, and each half sliced into 8 slices (about 2 quarts)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'pitted', u'ripe', u'halved', u'sliced into 8 slices ( 2 quarts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tbsp course or sparkling sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'6 tablespoons cold unsalted butter, cut into small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.smells-like-home.com/2012/08/peach-cobbler/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the peaches, cornstarch, both sugars, and cinnamon in a large bowl. Toss until well combined and set the bowl aside, stirring every so often while you make the biscuit topping.To make the biscuit topping: In a large bowl, whisk the flour, sugar, baking powder, and salt together until well-combined.  Gently toss in the butter pieces and coat them with the flour mixture.  Rub the butter in with your fingers (use your thumbs and first two fingers) until the mixture becomes a little crumbly and the butter forms small clumps (coarse meal with the flour) – you’ll need to use a little pressure to get the cold butter to break up so don’t be afraid to “get dirty”.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the egg and cream together in a liquid-measuring cup. Slowly add this mixture to dry ingredients, mixing with a fork until the dough just comes together - it will be wet and sticky.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour the peach filling into the baking dish. Using a large ice cream scoop or a 1/4 cup measuring cup drop clumps of biscuit dough (about 1/2 cup each) over the top of the peaches, gently flattening them out slightly with your fingertips.  Sprinkle the biscuit dough with the coarse sugar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Bake until golden brown, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer pan to a rack and let cool slightly.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm with vanilla ice cream or whipped cream.', u'number': 6, u'ingredients': []}], u'name': u'Preheat oven to 375\xb0 F.  Set a 2-quart baking dish aside.To make the peach filling'}], u'aggregateLikes': 33, u'instructions': u'Preheat oven to 375\xb0 F.  Set a 2-quart baking dish aside.To make the peach filling: Place the peaches, cornstarch, both sugars, and cinnamon in a large bowl. Toss until well combined and set the bowl aside, stirring every so often while you make the biscuit topping.To make the biscuit topping: In a large bowl, whisk the flour, sugar, baking powder, and salt together until well-combined.  Gently toss in the butter pieces and coat them with the flour mixture.  Rub the butter in with your fingers (use your thumbs and first two fingers) until the mixture becomes a little crumbly and the butter forms small clumps (coarse meal with the flour) – you’ll need to use a little pressure to get the cold butter to break up so don’t be afraid to “get dirty”.Whisk the egg and cream together in a liquid-measuring cup. Slowly add this mixture to dry ingredients, mixing with a fork until the dough just comes together - it will be wet and sticky.Pour the peach filling into the baking dish. Using a large ice cream scoop or a 1/4 cup measuring cup drop clumps of biscuit dough (about 1/2 cup each) over the top of the peaches, gently flattening them out slightly with your fingertips.  Sprinkle the biscuit dough with the coarse sugar.  Bake until golden brown, about 45 minutes. Transfer pan to a rack and let cool slightly. Serve warm with vanilla ice cream or whipped cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/peach-cobbler-587751', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}