{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/295741-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 295741, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pan-Fried Flounder', u'diets': [u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 207.41, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'3 tablespoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 small bottle capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'solid', u'id': 2054, u'unit': u'bottle'}, {u'originalString': u'4 skinless flounder-fillets', u'aisle': u'Seafood', u'name': u'flounder', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flounder-fresh.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 15028, u'unit': u'fillet'}, {u'originalString': u'Flour, for dredging fish', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dredging fish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'servings'}, {u'originalString': u'1 lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/pan-fried-flounder-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash fillets in cold water and pat dry. Sprinkle with salt and pepper. Dredge fillets in flour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place oil and 2 tablespoons butter in flat, heavy-bottomed skillet and heat on medium-high until butter melts. Keeping heat at medium-high, cook fish on 1 side about 3 minutes (more or less, depending on size of fillets), until deep brown and crispy. Turn fish and cook on second side, about 3 minutes. Turn fish only once.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove fish to serving platter. Turn off heat. Into hot skillet, whisk in remaining 1 tablespoon butter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add lemon juice.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Pour in capers, liquid and all.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour thin sauce over fish fillets. serve at once.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Attems Ramato Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif. View More', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Wash fillets in cold water and pat dry. Sprinkle with salt and pepper. Dredge fillets in flour. Place oil and 2 tablespoons butter in flat, heavy-bottomed skillet and heat on medium-high until butter melts. Keeping heat at medium-high, cook fish on 1 side about 3 minutes (more or less, depending on size of fillets), until deep brown and crispy. Turn fish and cook on second side, about 3 minutes. Turn fish only once.                          Remove fish to serving platter. Turn off heat. Into hot skillet, whisk in remaining 1 tablespoon butter. Add lemon juice. Pour in capers, liquid and all. Whisk. Pour thin sauce over fish fillets. serve at once.', u'spoonacularSourceUrl': u'https://spoonacular.com/pan-fried-flounder-295741', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}