{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/212892-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 212892, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eton mess trifle', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 35, u'pricePerServing': 756.44, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tbsp toasted flaked almond', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'flaked', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'tbsp'}, {u'originalString': u'500ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'2 tbsp golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tbsp'}, {u'originalString': u'1 small jam-filled Swiss roll, sliced', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19297, u'unit': u''}, {u'originalString': u'150ml pot natural full-fat yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain full fat yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'ml'}, {u'originalString': u'16 ready-made mini meringues (or use 8 larger meringues broken into pieces)', u'aisle': u'Refrigerated', u'name': u'ready to use piecrust', u'metaInformation': [u'mini', u'(or use 8 larger meringues broken into pieces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'100ml sweet sherry', u'aisle': u'Alcoholic Beverages', u'name': u'sherry', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 10214106, u'unit': u'ml'}, {u'originalString': u'140g strawberries, chopped', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 9316, u'unit': u'g'}, {u'originalString': u'1 vanilla pod', u'aisle': u'Baking', u'name': u'vanilla pod', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'seeds from 1 split vanilla pod (save the pod for the coulis, below)', u'aisle': u'Baking', u'name': u'vanilla pod', u'metaInformation': [u'split', u'for the coulis, below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3090675/eton-mess-trifle', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 87, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'First make the coulis. Put all theingredients in a pan, bring to a simmerand bubble for a few mins until the sugarhas dissolved and the strawberries havestarted to soften.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the vanilla podand tip the strawberries into a blender orfood processor. Whizz until smooth, thensieve into a bowl to remove the seeds.Leave to cool.You’ll need a large trifle bowl orshallow dish to assemble the trifle.Arrange the Swiss roll slices on the sidesand bottom of the bowl and drizzle overabout 4 tbsp of the coulis.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Cut enoughstrawberries in half to line the edge of thebowl and place them, cut-side facing out,on top of the Swiss roll layer. Save about8 nice strawberries for the top of thetrifle, slice the remaining ones and mixwith 2 tbsp of the coulis.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Add the vanilla seeds and icing sugarto the cream and softly whip. Fold in theyogurt and ripple through the strawberrycoulis. Tip half the cream into the triflebowl, add the sliced strawberries,then half the meringues. Spoon in theremaining cream. Slice the remainingstrawberries into halves or quarters andpop these on top with the remainingmeringues and the flaked almonds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve immediately, before the meringuesstart to dissolve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 156, u'instructions': u'First make the coulis. Put all theingredients in a pan, bring to a simmerand bubble for a few mins until the sugarhas dissolved and the strawberries havestarted to soften. Remove the vanilla podand tip the strawberries into a blender orfood processor. Whizz until smooth, thensieve into a bowl to remove the seeds.Leave to cool.You’ll need a large trifle bowl orshallow dish to assemble the trifle.Arrange the Swiss roll slices on the sidesand bottom of the bowl and drizzle overabout 4 tbsp of the coulis. Cut enoughstrawberries in half to line the edge of thebowl and place them, cut-side facing out,on top of the Swiss roll layer. Save about8 nice strawberries for the top of thetrifle, slice the remaining ones and mixwith 2 tbsp of the coulis.Add the vanilla seeds and icing sugarto the cream and softly whip. Fold in theyogurt and ripple through the strawberrycoulis. Tip half the cream into the triflebowl, add the sliced strawberries,then half the meringues. Spoon in theremaining cream. Slice the remainingstrawberries into halves or quarters andpop these on top with the remainingmeringues and the flaked almonds.Serve immediately, before the meringuesstart to dissolve.', u'spoonacularSourceUrl': u'https://spoonacular.com/eton-mess-trifle-212892', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}