{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/544879-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 544879, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Cheeseburger Appetizers', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 60.62, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1/4 cup dry Italian-style bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'dry bread crumbs', u'metaInformation': [u'dry', u'italian-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'18 grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 10111529, u'unit': u''}, {u'originalString': u'1 lb. lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'4-1/2 oz. CRACKER BARREL Sharp Cheddar Cheese, cut into 18 slices', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'cut into 18 slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/mini-cheeseburger-appetizers-164843.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix first 4 ingredients just until blended; shape into 18 (1-inch) balls. Flatten slightly to form patties.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Spray large sheet of foil with cooking spray; place on grill grate.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add patties; grill 2 to 3 min. on each side or until done (160F).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Thread 1 each burger, cheese slice and tomato onto each of 18 toothpicks.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'Heat grill to medium heat.                                            Mix first 4 ingredients just until blended; shape into 18 (1-inch) balls. Flatten slightly to form patties.                                             Spray large sheet of foil with cooking spray; place on grill grate. Add patties; grill 2 to 3 min. on each side or until done (160F).                                             Thread 1 each burger, cheese slice and tomato onto each of 18 toothpicks.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-cheeseburger-appetizers-544879', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}