{u'recipes': [{u'sourceName': u'Simply Delicious Food', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/513187-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 513187, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tzatziki and a How to video', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 124.48, u'creditText': u'Simply Delicious Food', u'extendedIngredients': [{u'originalString': u'1 large English cucumber, coarsely grated', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'grated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111205, u'unit': u''}, {u'originalString': u'small handful fresh mint leaves, finely chopped', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, finely chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'zest and juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 cups Greek yoghurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'lowfat greek yoghurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 93652, u'unit': u'cups'}, {u'originalString': u'olive oil, to serve', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://simply-delicious-food.com/2013/08/05/tzatziki-and-a-how-to-video/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Grate the cucumber and squeeze out excess liquid (through a sieve or a piece of muslin).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a bowl and add all the other ingredients.Stir to combine and serve. (Can be made up to 3 hours in advance, keep covered in the fridge.)', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Assyrtiko and Moschofilero are my top picks for Tzatziki. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. The Sigalas Assyrtiko Santorini with a 4.2 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko.', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 125, u'instructions': u'Grate the cucumber and squeeze out excess liquid (through a sieve or a piece of muslin).Place in a bowl and add all the other ingredients.Stir to combine and serve. (Can be made up to 3 hours in advance, keep covered in the fridge.)', u'spoonacularSourceUrl': u'https://spoonacular.com/tzatziki-and-a-how-to-video-513187', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}