{u'recipes': [{u'sourceName': u'Amuse Your Bouche', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/578447-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 578447, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cheesy roasted vegetable orzo', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 238.43, u'creditText': u'Amuse Your Bouche', u'extendedIngredients': [{u'originalString': u'\xbd aubergine', u'aisle': u'Produce', u'name': u'aubergine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'Black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'10g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 10.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'50g cheddar cheese, grated', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1009, u'unit': u'g'}, {u'originalString': u'10 cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'\xbd courgette', u'aisle': u'Produce', u'name': u'courgette', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11477, u'unit': u''}, {u'originalString': u'150ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'Pinch nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'2tbsp oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'\xbdtsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'175g orzo', u'aisle': u'Pasta and Rice', u'name': u'orzo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 10920420, u'unit': u'g'}, {u'originalString': u'1tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'100g white mushrooms', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 11260, u'unit': u'g'}, {u'originalString': u'\xbd yellow pepper', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.amuse-your-bouche.com/cheesy-roasted-vegetable-orzo/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 190.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat the oven to 190C (Gas Mark 5 / 375F).Halve the cherry tomatoes, and chop the mushrooms into 2cm chunks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Cut all the other vegetables into 1cm pieces. Toss all the vegetables in the oil and sprinkle with the oregano. Lay in a single layer on a baking tray, and roast for around an hour, stirring once halfway.When the vegetables have been roasting for about half an hour, you can begin to prepare the rest of the dish. Boil the orzo according to the instructions on the packet - it is small, so shouldn't take long. Use plenty of water and stir regularly to prevent clumping.Melt the butter in a pan, and add the flour. Cook over a very low heat for 1 minute, whisking constantly.", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the milk a dash at a time, and continue whisking to make a smooth mixture before adding more.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add a pinch of nutmeg and season to taste. Finally, when you have a smooth, fairly thin sauce, add the grated cheese and stir again until it has all melted and the sauce is smooth once again.When ready, combine the cooked orzo and the roasted vegetables with the cheese sauce, and mix well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 547, u'instructions': u"Preheat the oven to 190C (Gas Mark 5 / 375F).Halve the cherry tomatoes, and chop the mushrooms into 2cm chunks. Cut all the other vegetables into 1cm pieces. Toss all the vegetables in the oil and sprinkle with the oregano. Lay in a single layer on a baking tray, and roast for around an hour, stirring once halfway.When the vegetables have been roasting for about half an hour, you can begin to prepare the rest of the dish. Boil the orzo according to the instructions on the packet - it is small, so shouldn't take long. Use plenty of water and stir regularly to prevent clumping.Melt the butter in a pan, and add the flour. Cook over a very low heat for 1 minute, whisking constantly. Add the milk a dash at a time, and continue whisking to make a smooth mixture before adding more. Add a pinch of nutmeg and season to taste. Finally, when you have a smooth, fairly thin sauce, add the grated cheese and stir again until it has all melted and the sauce is smooth once again.When ready, combine the cooked orzo and the roasted vegetables with the cheese sauce, and mix well. Serve warm.", u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-roasted-vegetable-orzo-578447', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}