{u'recipes': [{u'sourceName': u'Faithful Provisions', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/484978-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 484978, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pan Seared Fish with Asian Dressing', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 226.33, u'creditText': u'Faithful Provisions', u'extendedIngredients': [{u'originalString': u'2-3 tablespoons Asian Sesame Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'asian toasted sesame dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-toasted-sesame-dressing.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4016, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 lb white firm fish (cod, grouper, halibut, tilapia)', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [u'white', u'firm', u'(cod, grouper, halibut, tilapia)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'lb'}, {u'originalString': u'1 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons grapeseed oil (olive or canola are fine)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [u'fine', u'(olive or canola are )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup flour (white, wheat, almond or coconut work well)', u'aisle': u'Baking', u'name': u'white flour', u'metaInformation': [u'white', u'well', u'(, wheat, almond or coconut work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://faithfulprovisions.com/2010/10/09/pan-seared-fish-with-asian-dressing/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine flour and spices in a flat dish.   Dredge fish in flour mixture, on both sides. ("Dredge" means just coat it in the flour mixture.)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil and butter in large skillet.   Put fish into pan and cook for about 2 minutes on each side or until cooked.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Remove once golden brown.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a side salad and spoon dressing over fish and serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Kris Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Brilliant lemon-green in color, KRIS offers enticing aromas of acacia flowers, citrus, tangerine, and hints of almonds.Try pairing with risotto, tossed salads, homemade pasta and grilled white meats or salmon.Blend: 100% Pinot Grigio View More', u'title': u'Kris Pinot Grigio', u'price': u'$14.99', u'id': 433207, u'link': u'https://www.wine.com/product/kris-pinot-grigio-2016/206138', u'imageUrl': u'https://spoonacular.com/productImages/433207-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Combine flour and spices in a flat dish.   Dredge fish in flour mixture, on both sides. ("Dredge" means just coat it in the flour mixture.) Heat oil and butter in large skillet.   Put fish into pan and cook for about 2 minutes on each side or until cooked. Remove once golden brown. Serve with a side salad and spoon dressing over fish and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/pan-seared-fish-with-asian-dressing-484978', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}