{u'recipes': [{u'sourceName': u'Cheap Recipe Blog', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/615269-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 615269, u'veryPopular': False, u'lowFodmap': False, u'title': u'Delicata Squash Fries', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 352.25, u'creditText': u'Cheap Recipe Blog', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2015, u'unit': u'teaspoon'}, {u'originalString': u'1 delicata squash (no need to peel this kind of squash!)', u'aisle': u'Produce', u'name': u'delicata squash', u'metaInformation': [u'(no need to peel this kind of squash!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/delicata-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11643, u'unit': u''}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 -2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u"1/2 teaspoon shallot salt (I bought mine at Penzey's Spices)", u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'bought', u"(I mine at Penzey's Spices)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.cheaprecipeblog.com/2014/09/delicata-squash-fries/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the ends off of squash.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the squash in half.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each half in half so you have two U-shaped halves. Ultimately, you want 1/2-inch half-moon slices of squash, just like you see in the photo of the finished dish, above.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place squash in a large mixing bowl.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with olive oil.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add spices and toss to evenly coat.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place squash on a large oiled baking sheet.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 40 to 45 minutes, turning once, until squash slices are crisp.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot with dipping sauce (I made a simple Sriracha mayonnaise).', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 17, u'instructions': u'Preheat oven to 400F. Cut the ends off of squash. Cut the squash in half. Cut each half in half so you have two U-shaped halves. Ultimately, you want 1/2-inch half-moon slices of squash, just like you see in the photo of the finished dish, above.Place squash in a large mixing bowl. Drizzle with olive oil. Add spices and toss to evenly coat.Place squash on a large oiled baking sheet. Bake for 40 to 45 minutes, turning once, until squash slices are crisp. Serve hot with dipping sauce (I made a simple Sriracha mayonnaise).', u'spoonacularSourceUrl': u'https://spoonacular.com/delicata-squash-fries-615269', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}