{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/422963-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 422963, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mango Melba Shakes', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 89.53, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup chopped peeled mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u'1/4 cup 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 cup frozen unsweetened sliced peaches', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'unsweetened', u'frozen', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9236, u'unit': u'cup'}, {u'originalString': u'1/2 cup fresh raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/mango-melba-shakes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, combine all ingredients; cover and process for 30 seconds or until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into chilled glasses; serve immediately.', u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'Directions                                                                                In a blender, combine all ingredients; cover and process for 30 seconds or until smooth. Pour into chilled glasses; serve immediately.                                        Yield: 3 servings.                                                                                                                         Originally published as Mango Melba Shakes in  Country ExtraMay  2010, p53                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup equals 191 calories, 8 g fat (5 g saturated fat), 31 mg cholesterol, 63 mg sodium, 28 g carbohydrate, 3 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-melba-shakes-422963', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}