{u'recipes': [{u'sourceName': u'Spicy Southern Kitchen', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/779152-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 779152, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamiest Grits Ever', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 103.53, u'creditText': u'Spicy Southern Kitchen', u'extendedIngredients': [{u'originalString': u'1 stick butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'1\xbd cups half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1\xbd cups stone ground grits', u'aisle': u'Condiments', u'name': u'stone ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1002046, u'unit': u'cups'}, {u'originalString': u'3\xbd cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://spicysouthernkitchen.com/creamiest-grits-ever/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine all ingredients EXCEPT grits in a Dutch oven. Bring to a simmer, stirring occasionally.Gradually whisk in grits. (', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add them too quickly and they will clump.)Reduce heat to low and cook, stirring frequently, for 50 to 60 minutes.If grits get too thick add more water or half-and-half.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern works really well with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Rancho Zabaco Monte Rosso Zinfandel with a 4.2 out of 5 star rating seems like a good match. It costs about 40 dollars per bottle.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u"Rancho Zabaco 2008 Monte Rosso Vineyard Zinfandel is a flavorful expression of the unique terroir of this vineyard, which is located in the heart of the Sonoma Valley. Flavors of crushed berry, white pepper and nutmeg are matched with a ripe, structured mouthfeel. Monte Rosso's old Zinfandel vines, some more than 125 years old, make this wine a great pairing to a variety of foods and truly age-worthy, with its blend of rich tannins and natural acidity.Blend: 99% Zinfandel, 1% Petite Sirah View More", u'title': u'Rancho Zabaco Monte Rosso Zinfandel', u'price': u'$39.99', u'id': 460307, u'link': u'https://www.wine.com/product/rancho-zabaco-monte-rosso-zinfandel-2008/123059', u'imageUrl': u'https://spoonacular.com/productImages/460307-312x231.jpg'}]}, u'aggregateLikes': 213, u'instructions': u'Combine all ingredients EXCEPT grits in a Dutch oven. Bring to a simmer, stirring occasionally.Gradually whisk in grits. (Add them too quickly and they will clump.)Reduce heat to low and cook, stirring frequently, for 50 to 60 minutes.If grits get too thick add more water or half-and-half.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamiest-grits-ever-779152', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}