{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479948-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479948, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp Lollipops with Basil Pesto', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 55.3, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'1/2 baguette, cut into 1 1/2 inch cubes (about 2 cups)', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'cut into 1 1/2 inch cubes ( 2 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'1 lemon, zested and juiced', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon pesto (I used this 3-herb version, but you can use basic basil)', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'canned', u'(I used this 3-herb version, but you can use basic basil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'20 large shrimp (about 1 pound), peeled, deveined, and shells removed', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'20 skewers (6 to 8-inches), soaked in water for 20 minutes', u'aisle': u'?', u'name': u'skewers', u'metaInformation': [u'for 20 minutes', u'(6 to 8-inches)'], u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'unit': u''}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://feedmephoebe.com/2012/02/shrimp-lollipops-with-basil-pesto/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees.In a medium mixing bowl, combine the shrimp together with the lemon juice, zest, olive oil, salt, and pesto.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Add the bread and toss just to coat. Thread the shrimp onto the skewers, head first, then add a piece of bread, and thread the skewer back through the tail of the shrimp. (If using smaller shrimp, you may need to just thread the bread on after the whole shrimp. Repeat with the remaining skewers.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place the skewers on a parchment or foil lined baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the oven until the shrimp is pink and just cooked through, about 10 minutes. Taste one for seasoning, and sprinkle with salt if needed.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Maso Canali Pinot Grigio with a 4.6 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 82, u'instructions': u'Preheat the oven to 450 degrees.In a medium mixing bowl, combine the shrimp together with the lemon juice, zest, olive oil, salt, and pesto. Add the bread and toss just to coat. Thread the shrimp onto the skewers, head first, then add a piece of bread, and thread the skewer back through the tail of the shrimp. (If using smaller shrimp, you may need to just thread the bread on after the whole shrimp. Repeat with the remaining skewers.Place the skewers on a parchment or foil lined baking sheet. Bake in the oven until the shrimp is pink and just cooked through, about 10 minutes. Taste one for seasoning, and sprinkle with salt if needed.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-lollipops-with-basil-pesto-479948', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}