{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/618745-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 618745, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kimchi fried rice (bokkeumbap)', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 203.13, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'1 tbsp. of cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'fried egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u'serving'}, {u'originalString': u'fried seaweeds with sesame seeds (available at Korean groceries)', u'aisle': u'Canned and Jarred', u'name': u'fried onions', u'metaInformation': [u'with sesame seeds (available at korean groceries)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fried-onions.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 93709, u'unit': u'serving'}, {u'originalString': u'2 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tsp. of kimchi juice', u'aisle': u'Beverages', u'name': u'juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1019016, u'unit': u'tsp'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 c. of day-old rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20444, u'unit': u'c'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'serving'}, {u'originalString': u'scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'serving'}, {u'originalString': u'\xbd c. of cut up kimchi, squeezed', u'aisle': u'Cereal', u'name': u'steel cut oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/steel-cut-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93695, u'unit': u'c'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://casaveneracion.com/kimchi-fried-rice-bokkeumbap/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the cooking oil in a frying pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Saute the garlic and onion.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the kimchi and cook until heated through.Throw in the rice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drizzle in the kimchi juice. Sprinkle in a little salt.Stir fry until the rice is heated through.Ladle the kimchi fried rice into a bowl. Top with the fried egg, seaweeds and scallions.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 1019016, u'name': u'juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try Tanian et Vincent Careme Terre Brulee Chenin Blanc. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 75, u'instructions': u'Heat the cooking oil in a frying pan.Saute the garlic and onion.Add the kimchi and cook until heated through.Throw in the rice.Drizzle in the kimchi juice. Sprinkle in a little salt.Stir fry until the rice is heated through.Ladle the kimchi fried rice into a bowl. Top with the fried egg, seaweeds and scallions.Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/kimchi-fried-rice-bokkeumbap-618745', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}