{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520900-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 520900, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mighty meaty pasta with tomato cream sauce', u'diets': [], u'pricePerServing': 226.86, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'2 c. of chopped tomatoes (I used canned)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned', u'chopped', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'c'}, {u'originalString': u'grated cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'servings'}, {u'originalString': u'225 g. of pasta (I suggest spaghetti, linguini or fettuccine), cooked al dente', u'aisle': u'Pasta and Rice', u'name': u'cooked pasta', u'metaInformation': [u'cooked', u'(I suggest spaghetti, linguini or fettuccine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 20421, u'unit': u'g'}, {u'originalString': u'1 c. of cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'c'}, {u'originalString': u'250 g. of spicy sausages', u'aisle': u'Meat', u'name': u'sausages', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'g'}, {u'originalString': u'chopped flat-leaf parsley or sweet basil', u'aisle': u'Produce', u'name': u'flat-leaf parsley', u'metaInformation': [u'sweet', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaf'}, {u'originalString': u'250 g. of ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'g'}, {u'originalString': u'4 tbsps. of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsps'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 sprigs of oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2027, u'unit': u'sprigs'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://casaveneracion.com/mighty-meaty-pasta-with-tomato-cream-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 36, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Slit the skins of the sausages, peel off and discard. Pull the meat part into small pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Heat the olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the beef and sausage meat. Cook until no longer pink.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 7063, u'name': u'ground sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Add the chopped onion, stir and cook until the meat is lightly browned and the onion bits start to turn translucent.No garlic? Whether or not garlic should be added depends on the kind of sausage you’re using. If using a spicy and garlicky variety, adding more garlic might be overkill. So, I’ll leave the garlic part to you.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour in the chopped tomatoes. Strip the oregano leaves off their stalks directly on top.Stir. Season with salt, pepper and a bit of sugar to balance the acidity of the tomatoes. Bring to the boil, cover and simmer for 20 to 30 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour in the cream.Stir and boil gently, uncovered to prevent curdling, for about a minute. Adjust the seasonings, if necessary.To serve, place some cooked pasta on a plate or shallow bowl. Ladle a generous amount of sauce and meat over the noodles. Sprinkle with grated cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20421, u'name': u'cooked pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Garnish with parsley or basil.Have a lovely meal.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 14, u'instructions': u'InstructionsSlit the skins of the sausages, peel off and discard. Pull the meat part into small pieces.Heat the olive oil. Add the beef and sausage meat. Cook until no longer pink.Add the chopped onion, stir and cook until the meat is lightly browned and the onion bits start to turn translucent.No garlic? Whether or not garlic should be added depends on the kind of sausage you’re using. If using a spicy and garlicky variety, adding more garlic might be overkill. So, I’ll leave the garlic part to you.Pour in the chopped tomatoes. Strip the oregano leaves off their stalks directly on top.Stir. Season with salt, pepper and a bit of sugar to balance the acidity of the tomatoes. Bring to the boil, cover and simmer for 20 to 30 minutes.Pour in the cream.Stir and boil gently, uncovered to prevent curdling, for about a minute. Adjust the seasonings, if necessary.To serve, place some cooked pasta on a plate or shallow bowl. Ladle a generous amount of sauce and meat over the noodles. Sprinkle with grated cheese. Garnish with parsley or basil.Have a lovely meal.', u'spoonacularSourceUrl': u'https://spoonacular.com/mighty-meaty-pasta-with-tomato-cream-sauce-520900', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}