{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/508054-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 508054, u'veryPopular': True, u'lowFodmap': False, u'title': u'Greek Custard Pie (Galaktoboureko)', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 83.16, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbe cup granulated sugar, divided', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1\xbd cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'\xbc cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'Zest of 1 orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1 package phyllo dough, about 12 to 16 sheets', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18338, u'unit': u'package'}, {u'originalString': u'1 cup fine semolina', u'aisle': u'Health Foods;Baking', u'name': u'semolina', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20066, u'unit': u'cup'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'6 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.browneyedbaker.com/2012/01/11/greek-custard-pie-galaktoboureko-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F. Have your pan ready to go - either a 16-inch round cake pan or a 10x13-inch lasagna dish. The phyllo should be room temperature or slightly cooler. Open the package right before using it so the sheets do not dry out.2. Stir the milk, semolina, \xbd cup of the sugar, the butter, and vanilla in a large sauce pan over medium heat. Stir the mixture gently but constantly until it becomes thick like pudding. This may take up to 15 minutes or so.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 20066, u'name': u'semolina'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and cool for 5 to 10 minutes. Beat the eggs with the remaining \xbc cup of granulated sugar in a small bowl and then stir it into milk mixture. Stir in the orange zest.3. Melt the butter and begin by brushing the the bottom of your pan with melted butter.4. Layer the bottom of the pan with about half of the phyllo, liberally brushing with butter between each layer. Lightly press the sheets into the sides and corner and let the edges hang over the top; you will fold them over later. (Do not skimp on the butter! You should use half on the bottom layers and half on the top.)5.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the slightly cooled custard over the bottom sheets and spread to the sides. Layer the remaining sheets of phyllo on top of the custard as you did the bottom, continuing to brush melted butter between layers until you have used all the phyllo. Then, brush butter on the overlapping sides and roll the edges down creating a “rim” around the edge of the pan. Liberally brush the top and the edge with the rest of your butter.6.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake until the top is golden brown all over, 30 to 45 minutes. (I suggest checking early and often, as you don't want the phyllo to burn.)7. While the pie is baking, make the syrup. Bring the sugar, water and orange juice to a boil in a small saucepan. Boil for 5 minutes then remove from the heat. Off the heat, stir in the vanilla extract; set aside.8. When you remove the pie from the oven, let it cool for 15 minutes. Then, pour the syrup evenly over the entire pie. Allow the pie to sit for at least 1 hour before serving so the syrup can be absorbed. Store leftover pie in the refrigerator for up to 3 days.", u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Chateau Chantal Late Harvest Riesling. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 21 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 5957, u'instructions': u"1. Preheat oven to 375 degrees F. Have your pan ready to go - either a 16-inch round cake pan or a 10x13-inch lasagna dish. The phyllo should be room temperature or slightly cooler. Open the package right before using it so the sheets do not dry out.2. Stir the milk, semolina, \xbd cup of the sugar, the butter, and vanilla in a large sauce pan over medium heat. Stir the mixture gently but constantly until it becomes thick like pudding. This may take up to 15 minutes or so. Remove the pan from the heat and cool for 5 to 10 minutes. Beat the eggs with the remaining \xbc cup of granulated sugar in a small bowl and then stir it into milk mixture. Stir in the orange zest.3. Melt the butter and begin by brushing the the bottom of your pan with melted butter.4. Layer the bottom of the pan with about half of the phyllo, liberally brushing with butter between each layer. Lightly press the sheets into the sides and corner and let the edges hang over the top; you will fold them over later. (Do not skimp on the butter! You should use half on the bottom layers and half on the top.)5. Pour the slightly cooled custard over the bottom sheets and spread to the sides. Layer the remaining sheets of phyllo on top of the custard as you did the bottom, continuing to brush melted butter between layers until you have used all the phyllo. Then, brush butter on the overlapping sides and roll the edges down creating a “rim” around the edge of the pan. Liberally brush the top and the edge with the rest of your butter.6. Bake until the top is golden brown all over, 30 to 45 minutes. (I suggest checking early and often, as you don't want the phyllo to burn.)7. While the pie is baking, make the syrup. Bring the sugar, water and orange juice to a boil in a small saucepan. Boil for 5 minutes then remove from the heat. Off the heat, stir in the vanilla extract; set aside.8. When you remove the pie from the oven, let it cool for 15 minutes. Then, pour the syrup evenly over the entire pie. Allow the pie to sit for at least 1 hour before serving so the syrup can be absorbed. Store leftover pie in the refrigerator for up to 3 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/greek-custard-pie-galaktoboureko-508054', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}