{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/582824-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 582824, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Pumpkin Parfaits with Greek Yogurt {Spooky Treats Week – Treat #1}', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 313.28, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'\xbe cup of crumbled graham crackers, oats, granola, etc.', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 18617, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon pumpkin pie spice, divided in half', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}, {u'originalString': u'2 Tablespoons of pumpkin puree (not pie filling!)', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [u'(not pie filling!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11424, u'unit': u'Tablespoons'}, {u'originalString': u'2 cups vanilla greek yogurt, divided in half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim vanilla greek yogurt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 99033, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://dailydishrecipes.com/easy-pumpkin-parfaits-with-greek-yogurt/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine 1 cup of the vanilla greek yogurt with the pumpkin puree and \xbc teaspoon of the pumpkin pie spice.In another small bowl, combine the remaining 1 cup of vanilla greek yogurt with the other \xbc teaspoon of the pumpkin spice.To serve, in a small glass, layer the vanilla yogurt, then the graham crackers (or whatever you decided to use) then the pumpkin yogurt, then another layer of the graham crackers and then top both glasses with remaining vanilla yogurt.Depending on the size of the glass used, you could maybe get three out of this.Goes great paired with some fresh cut up banana slices.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Parfait on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 192, u'instructions': u'In a small bowl, combine 1 cup of the vanilla greek yogurt with the pumpkin puree and \xbc teaspoon of the pumpkin pie spice.In another small bowl, combine the remaining 1 cup of vanilla greek yogurt with the other \xbc teaspoon of the pumpkin spice.To serve, in a small glass, layer the vanilla yogurt, then the graham crackers (or whatever you decided to use) then the pumpkin yogurt, then another layer of the graham crackers and then top both glasses with remaining vanilla yogurt.Depending on the size of the glass used, you could maybe get three out of this.Goes great paired with some fresh cut up banana slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-pumpkin-parfaits-with-greek-yogurt-spooky-treats-week-treat-1-582824', u'dishTypes': [], u'occasions': [u'halloween'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}