{u'recipes': [{u'sourceName': u'Completely Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/591488-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 591488, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Caramel & Nutella Stuffed Double Chocolate Chip Cookies', u'diets': [], u'pricePerServing': 60.64, u'creditText': u'Completely Delicious', u'extendedIngredients': [{u'originalString': u'3/4 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'12 caramel-filled chocolates', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 19074, u'unit': u''}, {u'originalString': u'Approximately 1/2 cup (140 grams) Nutella or chocolate hazelnut spread', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'chocolate hazelnut spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 19125, u'unit': u'grams'}, {u'originalString': u'1/2 cup (45 grams) cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 45.0, u'consistency': u'solid', u'id': 19165, u'unit': u'grams'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Coarse salt or fleur de sel, for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'fleur de sel', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1022047, u'unit': u'servings'}, {u'originalString': u'2 cups (240 grams) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 240.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'1 1/2 cups (320 grams) light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 320.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup (85 grams) semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'grams'}, {u'originalString': u'1/2 cup (113 grams) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 113.0, u'consistency': u'solid', u'id': 1145, u'unit': u'grams'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.completelydelicious.com/2014/03/salted-caramel-nutella-stuffed-double-chocolate-chip-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350 degrees F. Line a sheet pan with parchment paper or a silicone baking mat. In a medium saucepan, melt the butter.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat and stir in the brown sugar and eggs, mixing after each addition.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the cocoa, salt and baking powder and stir until well combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the flour and stir until a few streaks remain. Stir in the chocolate chips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place rounded tablespoons of dough on the prepared sheet pan. Use your finger to make a large indentation the center of the dough, and fill with a small spoonful of nutella (scant 1 teaspoon) and top with a caramel-filled chocolate. Take another rounded tablespoon of dough and flatten into a disk.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [], u'step': u'Place on top of filled cookies and seal the edges. Sprinkle with salt or fleur de sel.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1022047, u'name': u'fleur de sel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 8-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool on the pan 5 minutes, then transfer to a cooling rack. Cookies are best when they are still warm.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1863, u'instructions': u'Preheat oven to 350 degrees F. Line a sheet pan with parchment paper or a silicone baking mat. In a medium saucepan, melt the butter. Remove from heat and stir in the brown sugar and eggs, mixing after each addition. Add the cocoa, salt and baking powder and stir until well combined. Add the flour and stir until a few streaks remain. Stir in the chocolate chips.Place rounded tablespoons of dough on the prepared sheet pan. Use your finger to make a large indentation the center of the dough, and fill with a small spoonful of nutella (scant 1 teaspoon) and top with a caramel-filled chocolate. Take another rounded tablespoon of dough and flatten into a disk. Place on top of filled cookies and seal the edges. Sprinkle with salt or fleur de sel. Bake for 8-10 minutes. Let cool on the pan 5 minutes, then transfer to a cooling rack. Cookies are best when they are still warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/salted-caramel-nutella-stuffed-double-chocolate-chip-cookies-591488', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}