{u'recipes': [{u'sourceName': u'Texanerin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/480313-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 480313, u'veryPopular': True, u'lowFodmap': False, u'title': u'Healthier Carrot Cake Cheesecake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 59.39, u'creditText': u'Texanerin', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup (50 grams) unrefined sugar or brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'2 tablespoons (28 grams) melted coconut oil or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 28.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'grams'}, {u'originalString': u'100 grams (about \xbe cup) peeled and grated carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 tablespoon (14 grams) melted coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 14.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'grams'}, {u'originalString': u'8 ounces (225 grams) cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 1017, u'unit': u'grams'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup (112 grams) plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 112.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'grams'}, {u'originalString': u'\xbd cup (62 grams) whole spelt flour or whole wheat flour', u'aisle': u'Health Foods;Baking', u'name': u'spelt flour', u'metaInformation': [u'whole wheat', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 62.0, u'consistency': u'solid', u'id': 93823, u'unit': u'grams'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.texanerin.com/2014/04/healthier-carrot-cake-cheesecake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Lightly grease a 6\xbd" springform pan and set aside.In a medium mixing bowl using an electric hand mixer, beat together the cream cheese and sugar until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the salt, vanilla and egg and beat until smooth.Stir in the Greek yogurt and set this bowl aside.Preheat the oven to 350\xb0F (176\xb0C).Prepare the cake batter by mixing together all the dry ingredients (flour through salt) in a medium bowl.In another medium mixing bowl, mix together the oil, apple sauce, sugars and egg.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the dry mix to the wet and stir just until combined.Fold in the carrots.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour half of the cake batter on the bottom of the prepared pan.Dollop large spoonfuls of half the cheesecake batter over the carrot cake batter. Do not swirl or mix it together.Dollop the remaining carrot cake batter over the cheesecake batter layer.Evenly spread the remaining cheesecake on top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u"Bake for 30 minutes or until the middle of the cheesecake is still jiggly but appears to be almost set. The cake will rise and crack but don't worry as you'll be covering the cake with frosting.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let the cheesecake cool completely and then refrigerate for 3 hours.After the cheesecake has cooled thoroughly, prepare the frosting by mixing together the cream cheese and sugar until smooth.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add the Greek yogurt, oil, vanilla and salt and mix until thoroughly combined.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Spread the frosting over the top of the cheesecake and chill for another hour until the frosting firms up just a bit.Refrigerate until ready to serve.Cover and refrigerate for up to 4 days.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1983, u'instructions': u'Lightly grease a 6\xbd" springform pan and set aside.In a medium mixing bowl using an electric hand mixer, beat together the cream cheese and sugar until smooth.Add the salt, vanilla and egg and beat until smooth.Stir in the Greek yogurt and set this bowl aside.Preheat the oven to 350\xb0F (176\xb0C).Prepare the cake batter by mixing together all the dry ingredients (flour through salt) in a medium bowl.In another medium mixing bowl, mix together the oil, apple sauce, sugars and egg.Add the dry mix to the wet and stir just until combined.Fold in the carrots.Pour half of the cake batter on the bottom of the prepared pan.Dollop large spoonfuls of half the cheesecake batter over the carrot cake batter. Do not swirl or mix it together.Dollop the remaining carrot cake batter over the cheesecake batter layer.Evenly spread the remaining cheesecake on top.Bake for 30 minutes or until the middle of the cheesecake is still jiggly but appears to be almost set. The cake will rise and crack but don\'t worry as you\'ll be covering the cake with frosting.Let the cheesecake cool completely and then refrigerate for 3 hours.After the cheesecake has cooled thoroughly, prepare the frosting by mixing together the cream cheese and sugar until smooth. Add the Greek yogurt, oil, vanilla and salt and mix until thoroughly combined.Spread the frosting over the top of the cheesecake and chill for another hour until the frosting firms up just a bit.Refrigerate until ready to serve.Cover and refrigerate for up to 4 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthier-carrot-cake-cheesecake-480313', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 310, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}