{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 225177, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oaty apple crumble', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 73.49, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g flaked almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12061, u'unit': u'g'}, {u'originalString': u'1 bag or 6 eating apples, peeled, cored and cut into chunks', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'cored', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u'bag'}, {u'originalString': u'1 bag or 6 Bramley apples, peeled, cored and cut into chunks', u'aisle': u'Produce', u'name': u'bramley apples', u'metaInformation': [u'cored', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/braeburn-apples.png', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 1009003, u'unit': u'bag'}, {u'originalString': u'250g pack butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'50g honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'g'}, {u'originalString': u'100g soft light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'300g oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'300g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'85g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'100g sultanas or raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'sultanas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9297, u'unit': u'g'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1139654/oaty-apple-crumble', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the apples with the caster sugarin a large pan, stirring occasionally –adda splash of water if they start to stick onthe bottom. When just about tender anda bit saucy, stir in the sultanas or raisinsand tip into 2 large ovenproof dishes.Melt the brown sugar, honey and buttertogether in a large pan. Off the heat, stirin the oats, flour, almonds and cinnamonuntil sticky and crumbly. Divide over theapples. To bake straight away, heat oven to180C/160C fan/gas 4 then bake for 40-50mins until topping is golden and crisp.To freeze, wrap dishes well or freeze thefruit and crumble mixture in separatefreezer bags if you don’t have sparebaking dishes. To cook from frozen, coverwith foil and bake at 180C/160C fan/gas 4for 1\xbd hrs, then turn the oven up to220C/200C fan/gas 8 and bake for afurther 45 mins, removing the foil forthe last 15 mins.', u'length': {u'number': 110, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'id': 9297, u'name': u'golden raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}], u'name': u''}], u'aggregateLikes': 68, u'instructions': u'Cook the apples with the caster sugarin a large pan, stirring occasionally –adda splash of water if they start to stick onthe bottom. When just about tender anda bit saucy, stir in the sultanas or raisinsand tip into 2 large ovenproof dishes.Melt the brown sugar, honey and buttertogether in a large pan. Off the heat, stirin the oats, flour, almonds and cinnamonuntil sticky and crumbly. Divide over theapples. To bake straight away, heat oven to180C/160C fan/gas 4 then bake for 40-50mins until topping is golden and crisp.To freeze, wrap dishes well or freeze thefruit and crumble mixture in separatefreezer bags if you don’t have sparebaking dishes. To cook from frozen, coverwith foil and bake at 180C/160C fan/gas 4for 1\xbd hrs, then turn the oven up to220C/200C fan/gas 8 and bake for afurther 45 mins, removing the foil forthe last 15 mins.', u'spoonacularSourceUrl': u'https://spoonacular.com/oaty-apple-crumble-225177', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}