{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/793914-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 793914, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Breakfast Chilaquiles', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 88.9, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'A couple strips of bacon, cooked and crumbled, or breakfast sausage, cooked and crumbled', u'aisle': u'Meat', u'name': u'breakfast sausage', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breakfast-sausage.jpg', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 2.0, u'consistency': u'solid', u'id': 7919, u'unit': u'strips'}, {u'originalString': u'Corn tortilla chips', u'aisle': u'Savory Snacks', u'name': u'corn tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 19056, u'unit': u'serving'}, {u'originalString': u'Scrambled eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u'serving'}, {u'originalString': u'Shredded Mexican cheeses', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican cream', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 93772, u'unit': u'serving'}, {u'originalString': u'Chopped onion, peppers (bell peppers or hot peppers or both), black beans, corn', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'black', u'hot', u'chopped', u'(bell peppers or peppers or both)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'serving'}, {u'originalString': u"Your favorite salsa (I would suggest Cilantro Almond Salsa or Copycat Chili's salsa)", u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'your favorite', u"(I would suggest Cilantro Almond Salsa or Copycat Chili's salsa)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'serving'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/easy-breakfast-chilaquiles/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 F. Spray a casserole or other baking dish with cooking spray.Make a layer of tortilla chips in the bottom of the pan. Sprinkle some shredded cheese over the chips, then top with chunks of scrambled eggs, bacon, onion, peppers, beans &/or corn to your liking. Cover this layer with salsa, then add another layer of chips and toppings. Cover this again with salsa, then add a little cheese on top.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake at 400 F. for 15 - 20 minutes or until the cheeses are nicely melted and the middle of the dish is hot and bubbly. Top with avocado & cilantro if desired and serve!', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23, u'instructions': u'Preheat the oven to 400 F. Spray a casserole or other baking dish with cooking spray.Make a layer of tortilla chips in the bottom of the pan. Sprinkle some shredded cheese over the chips, then top with chunks of scrambled eggs, bacon, onion, peppers, beans &/or corn to your liking. Cover this layer with salsa, then add another layer of chips and toppings. Cover this again with salsa, then add a little cheese on top. Bake at 400 F. for 15 - 20 minutes or until the cheeses are nicely melted and the middle of the dish is hot and bubbly. Top with avocado & cilantro if desired and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-breakfast-chilaquiles-793914', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}