{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/553503-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553503, u'veryPopular': False, u'lowFodmap': False, u'title': u'Barley, Spinach and Lentil Soup', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 69.03, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'1/3 cup of barley', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'barley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20004, u'unit': u'cup'}, {u'originalString': u'1 8oz can tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'1/2 cup chopped carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1lb dried brown lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dried brown lentils', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16069, u'unit': u'lb'}, {u'originalString': u'4 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2-3 tablespoons of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 cup fresh spinach, you can also use frozen', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'frozen', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'6 - 8 cups of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.eatgood4life.com/barley-spinach-and-lentil-soup/', u'glutenFree': False, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large pan over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, carrot and garlic.\xa0', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add water, lentils, tomato sauce, salt and barley. Bring to boil and reduce heat and simmer 30 minutes or until lentils are tender. Turn heat off and add spinach. If frozen add 5 minutes before turning off the heat.TIP: You may add some dry spices before adding the water if you like such as dill, oregano, pepper flakes etc', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'id': 20004, u'name': u'barley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 7, u'instructions': u'Heat oil in a large pan over medium heat. Add onion, carrot and garlic.\xa0 Add water, lentils, tomato sauce, salt and barley. Bring to boil and reduce heat and simmer 30 minutes or until lentils are tender. Turn heat off and add spinach. If frozen add 5 minutes before turning off the heat.TIP: You may add some dry spices before adding the water if you like such as dill, oregano, pepper flakes etc', u'spoonacularSourceUrl': u'https://spoonacular.com/barley-spinach-and-lentil-soup-553503', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}