{u'recipes': [{u'sourceName': u'Moms with Crock Pots', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483365-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 483365, u'veryPopular': False, u'lowFodmap': False, u'title': u'Red Beans and Rice (Slow Cooker)', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 156.51, u'creditText': u'Moms with Crock Pots', u'extendedIngredients': [{u'originalString': u'2 -3 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 bell pepper , chopped', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 teaspoon black pepper , fresh ground', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 -2 teaspoon cajun seasoning , Tony Cacheres and Zatarains brand are both very good', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032028, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon chicken stock , powdered', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dried chipotle powder , I use one Knorr mini cube (optional)', u'aisle': u'Spices and Seasonings', u'name': u'chipotle powder', u'metaInformation': [u'dried', u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1052009, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons cornstarch or 2 tablespoons cornflour', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'1 lb dried kidney beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dried kidney beans', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16032, u'unit': u'lb'}, {u'originalString': u'4 garlic cloves , chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1 ham hock (optional)', u'aisle': u'Meat', u'name': u'ham hock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93669, u'unit': u''}, {u'originalString': u'1 teaspoon liquid smoke (optional)', u'aisle': u'Spices and Seasonings;Condiments', u'name': u'liquid smoke', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93627, u'unit': u'teaspoon'}, {u'originalString': u'1 onion , chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 -2 tablespoon salt , according to your taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'1 lb smoked sausage', u'aisle': u'Meat', u'name': u'smoked sausage', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7916, u'unit': u'lb'}, {u'originalString': u'1 teaspoon Tabasco sauce', u'aisle': u'Condiments', u'name': u'tabasco sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoon'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://momswithcrockpots.com/2012/01/red-beans-and-rice-slow-cooker/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'SOAK BEANS The night before you want to eat, check beans to be sure there are no stones then place beans in a large bowl and fill almost to the top with water. It’s better to have too much water than not enough. The beans will more than double in size overnight. In the morning, I drain beans in a colander and rinse well.PLACE IN CROCKPOT: Beans, ham hock, black pepper, chicken stock powder, chopped garlic, garlic salt, bay leaves, and optional Chipotle powder and liquid smoke. Note: Save adding salt until the end of cook time.COVER WITH HOT WATER just until fully covered. Then add an extra inch of water on top of that. This will give your beans a chance to swell even more during cooking. Cover Crockpot with lid.QUICKLY: Saut\xe9 onions and bell-pepper just until they begin to cook.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1052009, u'name': u'ground chipotle chile pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 93627, u'name': u'liquid smoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'id': 93669, u'name': u'ham hock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add these to the beans and stir.COOK: If you are going to be gone all day, cook beans on low setting for 6 to 8 hours. If you will be around to stir, etc., I recommend cooking them on high until they are almost fully cooked (about 4 or 5 hours). Then turn them down to low for the last bit of cooking.When beans are fully cooked, remove bay leaves (if you can find them all) add butter and stir.To thicken beans, add 2 tablespoons corn flour mixed with just enough cold water to dissolve it.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add this to beans and stir for a minute. Beans should thicken a bit in fairly short order. Repeat until you get the desired consistency.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add salt by half-teaspoon until you reach the level of your liking. It may not take much for you. Also add a bit more fresh ground pepper.Put your rice on to cook. Slice smoked sausage and cook in a medium-hot cast iron skillet until nicely brown and starting to emit those nice juices. Take skillet off heat but leave sausages where they are. Don’t cover.RINSE your rice with hot water. Once drained, place about half a cup of hot fluffy rice in a wide, shallow bowl.COVER rice with a generous amount of red beans. Top with a good amount of hot smoked sausage slices.SPRINKLE with hot sauceSERVE with hot buttered, grilled slices of French bread, salad or coleslaw.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'id': 7916, u'name': u'smoked sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 275, u'instructions': u'SOAK BEANS The night before you want to eat, check beans to be sure there are no stones then place beans in a large bowl and fill almost to the top with water. It’s better to have too much water than not enough. The beans will more than double in size overnight. In the morning, I drain beans in a colander and rinse well.PLACE IN CROCKPOT: Beans, ham hock, black pepper, chicken stock powder, chopped garlic, garlic salt, bay leaves, and optional Chipotle powder and liquid smoke. Note: Save adding salt until the end of cook time.COVER WITH HOT WATER just until fully covered. Then add an extra inch of water on top of that. This will give your beans a chance to swell even more during cooking. Cover Crockpot with lid.QUICKLY: Saut\xe9 onions and bell-pepper just until they begin to cook. Add these to the beans and stir.COOK: If you are going to be gone all day, cook beans on low setting for 6 to 8 hours. If you will be around to stir, etc., I recommend cooking them on high until they are almost fully cooked (about 4 or 5 hours). Then turn them down to low for the last bit of cooking.When beans are fully cooked, remove bay leaves (if you can find them all) add butter and stir.To thicken beans, add 2 tablespoons corn flour mixed with just enough cold water to dissolve it. Add this to beans and stir for a minute. Beans should thicken a bit in fairly short order. Repeat until you get the desired consistency.Add salt by half-teaspoon until you reach the level of your liking. It may not take much for you. Also add a bit more fresh ground pepper.Put your rice on to cook. Slice smoked sausage and cook in a medium-hot cast iron skillet until nicely brown and starting to emit those nice juices. Take skillet off heat but leave sausages where they are. Don’t cover.RINSE your rice with hot water. Once drained, place about half a cup of hot fluffy rice in a wide, shallow bowl.COVER rice with a generous amount of red beans. Top with a good amount of hot smoked sausage slices.SPRINKLE with hot sauceSERVE with hot buttered, grilled slices of French bread, salad or coleslaw.', u'spoonacularSourceUrl': u'https://spoonacular.com/red-beans-and-rice-slow-cooker-483365', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}