{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611134-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 611134, u'veryPopular': True, u'lowFodmap': False, u'title': u'Taffy Apple Salad', u'diets': [u'dairy free'], u'pricePerServing': 99.19, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'2 1/2 cups miniature marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'1 (15 ounce) can pineapple chunks - drained with juice reserved', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'with juice reserved', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups roasted Spanish peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted peanuts', u'metaInformation': [u'spanish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16092, u'unit': u'cups'}, {u'originalString': u'2 tart apples - peeled, cored and chopped', u'aisle': u'Produce', u'name': u'tart apples', u'metaInformation': [u'cored', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'1 (8 ounce) container frozen whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounce'}, {u'originalString': u'1 1/2 tablespoons distilled white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white distilled vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Taffy-Apple-Salad/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the pineapple chunks and marshmallows.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1029354, u'name': u'pineapple chunks'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix together, cover and refrigerate overnight.In a medium saucepan, stir together the pineapple juice, egg, flour, vinegar and sugar over medium low heat. Cook and stir sauce until thickened.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 422, u'instructions': u'Combine the pineapple chunks and marshmallows. Mix together, cover and refrigerate overnight.In a medium saucepan, stir together the pineapple juice, egg, flour, vinegar and sugar over medium low heat. Cook and stir sauce until thickened.  Transfer to a medium sized bowl, cover and refrigerate overnight.In a large bowl, blend together the marshmallow mix and sauce. Stir in the peanuts, whipped topping and apples. Refrigerate until serving time.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/taffy-apple-salad-611134', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}