{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609618-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 609618, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oatmeal-Dark Chocolate Chip & Coconut Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 35.27, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cups (255 grams) dark chocolate chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 255.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'grams'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1\xbd cups (181 grams) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 181.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'1 cup (198 grams) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 198.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'1 cup (213 grams) light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 213.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'3 cups (298 grams) old-fashioned rolled oats', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 298.0, u'consistency': u'solid', u'id': 8120, u'unit': u'grams'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup (43 grams) sweetened shredded coconut', u'aisle': u'Baking', u'name': u'sweetened shredded coconut', u'metaInformation': [u'shredded', u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 43.0, u'consistency': u'solid', u'id': 12179, u'unit': u'grams'}, {u'originalString': u'1 cup (227 grams) unsalted butter, softened but still cool', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 227.0, u'consistency': u'solid', u'id': 1145, u'unit': u'grams'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.browneyedbaker.com/2014/08/25/oatmeal-dark-chocolate-chip-coconut-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F; adjust oven racks to low and middle positions. Line baking sheets with parchment paper.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the flour, baking powder and salt in a small bowl; set aside.3. Cream together the butter and both sugars on medium speed until light and fluffy, about 3 minutes. Beat in the eggs, one at a time, and then mix in the vanilla.4. Stir in the flour mixture with a wooden spoon or a large rubber spatula, then stir in the oats, chocolate chips and shredded coconut.5. Using 2 heaping tablespoons per cookie, roll the dough into balls and place on the cookie sheets, spacing them at least 2 inches apart.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake until the cookie edges are golden brown, but the middles are still quite pale, about 12 to 14 minutes. Rotate the sheets from front to back and top to bottom halfway through the baking time. Cool the cookies on the baking sheets for 2 minutes, then transfer to a cooling rack to cool for at least 30 minutes. Cookies can be stored in an airtight container at room temperature for up to 5 days.', u'length': {u'number': 44, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 298, u'instructions': u'1. Preheat oven to 350 degrees F; adjust oven racks to low and middle positions. Line baking sheets with parchment paper.2. Whisk the flour, baking powder and salt in a small bowl; set aside.3. Cream together the butter and both sugars on medium speed until light and fluffy, about 3 minutes. Beat in the eggs, one at a time, and then mix in the vanilla.4. Stir in the flour mixture with a wooden spoon or a large rubber spatula, then stir in the oats, chocolate chips and shredded coconut.5. Using 2 heaping tablespoons per cookie, roll the dough into balls and place on the cookie sheets, spacing them at least 2 inches apart. Bake until the cookie edges are golden brown, but the middles are still quite pale, about 12 to 14 minutes. Rotate the sheets from front to back and top to bottom halfway through the baking time. Cool the cookies on the baking sheets for 2 minutes, then transfer to a cooling rack to cool for at least 30 minutes. Cookies can be stored in an airtight container at room temperature for up to 5 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/oatmeal-dark-chocolate-chip-coconut-cookies-609618', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}