{u'recipes': [{u'sourceName': u'Real Housemoms', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/836762-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 836762, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Chipotle Fries', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 236.27, u'creditText': u'Real Housemoms', u'extendedIngredients': [{u'originalString': u'1 (7.5-ounce) can chipotle peppers in adobo sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle peppers in adobo', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.5, u'consistency': u'solid', u'id': 11632, u'unit': u'ounce'}, {u'originalString': u'1 handful of fresh cilantro, chopped', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'24-ounce bag frozen fries', u'aisle': u'Frozen', u'name': u'frozen fries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-fries-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 11408, u'unit': u'ounce'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'juice from one lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'8 ounces Monterey jack, shredded', u'aisle': u'Cheese', u'name': u'monterey jack', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 medium red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt & sour cream, if desired', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://realhousemoms.com/cheesy-chipotle-fries/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F. In a large bowl, toss frozen fries in about 2 tablespoons of the adobo sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-fries-isolated.jpg', u'id': 11408, u'name': u'french fries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread in a single layer on a baking sheet and bake for about 30 minutes, flipping half way through cooking time.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a saute pan over medium-high heat and cook onion until just golden brown and tender, about 5 minutes, while stirring occasionally. During the last minute of cook time, add the garlic and allow to cook just until its golden brown.Using your blender, blend cooked onion and garlic with remaining contents of chipotle peppers with sauce, honey, and lime juice until smooth. This makes just over 1 cup of sauce and it is super spicy.Once the fries have cooked for about 30 minutes, remove them from oven and spoon as much or as little of this sauce on top. I prefer to use it sparingly, but do this according to how hot you like your fries.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-fries-isolated.jpg', u'id': 11408, u'name': u'french fries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer the remaining sauce to a ceramic dish and set it on the fry pan to warm it up in the oven. Top fries with cheese and return baking dish to oven for about 5 minutes to allow cheese to fully melt. Top with additional salt, if desired, as well as minced cilantro. Can also be served with sour cream to help cool down the heat.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-fries-isolated.jpg', u'id': 11408, u'name': u'french fries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 42, u'instructions': u'Preheat oven to 450 degrees F. In a large bowl, toss frozen fries in about 2 tablespoons of the adobo sauce. Spread in a single layer on a baking sheet and bake for about 30 minutes, flipping half way through cooking time.Heat oil in a saute pan over medium-high heat and cook onion until just golden brown and tender, about 5 minutes, while stirring occasionally. During the last minute of cook time, add the garlic and allow to cook just until its golden brown.Using your blender, blend cooked onion and garlic with remaining contents of chipotle peppers with sauce, honey, and lime juice until smooth. This makes just over 1 cup of sauce and it is super spicy.Once the fries have cooked for about 30 minutes, remove them from oven and spoon as much or as little of this sauce on top. I prefer to use it sparingly, but do this according to how hot you like your fries. Transfer the remaining sauce to a ceramic dish and set it on the fry pan to warm it up in the oven. Top fries with cheese and return baking dish to oven for about 5 minutes to allow cheese to fully melt. Top with additional salt, if desired, as well as minced cilantro. Can also be served with sour cream to help cool down the heat.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-chipotle-fries-836762', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}