{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/516855-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 516855, u'veryPopular': True, u'lowFodmap': False, u'title': u'Grilled Steak Chopped Summer Salad', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 772.66, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 cup blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'1 cup chopped carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup crumbled gorgonzola cheese', u'aisle': u'Cheese', u'name': u'gorgonzola cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1011004, u'unit': u'cup'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup Cholula green pepper hot sauce', u'aisle': u'Condiments', u'name': u'hot pepper sauce', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6168, u'unit': u'cup'}, {u'originalString': u'juice from one lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1/2 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/3 cup red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1022068, u'unit': u'cup'}, {u'originalString': u'4 cups chopped romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3/4 pound skirt steak (or flank steak, but skirt is better!)', u'aisle': u'Meat', u'name': u'skirt steak', u'metaInformation': [u'(or flank steak, but skirt is better!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'liquid', u'id': 23167, u'unit': u'pound'}, {u'originalString': u'1 cup chopped strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'1 cup chopped yellow bell pepper', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u'cup'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.recipegirl.com/2014/06/09/grilled-steak-chopped-summer-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix marinade/dressing:  In a medium bowl or jar, whisk together the oil, vinegar, hot sauce, garlic, honey, lime and a sprinkle of salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Remove 1/3 cup of the mixture and set it aside to use as the salad dressing.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place steak in a large ziploc baggie.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add remaining marinade to the bag and move around to combine.  Refrigerate and let marinate for at least a couple of hours and up to 4 hours.2.  Grill:  Preheat grill to medium.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Drain marinade from the steak.  Grill steak until done- a few minutes on each side (it cooks quickly since this is such a thin cut).', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let rest a few minutes, then chop the steak.3.  Assemble the salad (as a main dish):  Divide the lettuce between two plates.  Divide remaining ingredients in half and decoratively arrange on top of the lettuce.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the reserved salad dressing on top of each salad and serve.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Beringer Howell Mountain Bancroft Ranch Merlot with a 4.2 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"The 2006 Bancroft Ranch Merlot is a rich garnet color, and brims with flavors of ripe black fruits, brown spices and a hint of orange zest. Its refined tannins and depth of flavor make it one of Beringer's most memorable wines from Howell Mountain.Blend: 93% Merlot, 4% Cabernet Sauvignon, and 3% Cabernet Franc", u'title': u'Beringer Howell Mountain Bancroft Ranch Merlot', u'price': u'$34.99', u'id': 438453, u'link': u'https://www.wine.com/product/beringer-howell-mountain-bancroft-ranch-merlot-2006/116574', u'imageUrl': u'https://spoonacular.com/productImages/438453-312x231.jpg'}]}, u'aggregateLikes': 3015, u'instructions': u'1.  Mix marinade/dressing:  In a medium bowl or jar, whisk together the oil, vinegar, hot sauce, garlic, honey, lime and a sprinkle of salt and pepper.  Remove 1/3 cup of the mixture and set it aside to use as the salad dressing.  Place steak in a large ziploc baggie.  Add remaining marinade to the bag and move around to combine.  Refrigerate and let marinate for at least a couple of hours and up to 4 hours.2.  Grill:  Preheat grill to medium.  Drain marinade from the steak.  Grill steak until done- a few minutes on each side (it cooks quickly since this is such a thin cut).  Let rest a few minutes, then chop the steak.3.  Assemble the salad (as a main dish):  Divide the lettuce between two plates.  Divide remaining ingredients in half and decoratively arrange on top of the lettuce.  Drizzle the reserved salad dressing on top of each salad and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-steak-chopped-summer-salad-516855', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 23, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}