{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/196529-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196529, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ramen Crust Pizza', u'diets': [], u'pricePerServing': 222.3, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'12 ounces grated mozzarella or Jack cheese', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 ounces grated parmesan cheese, divided', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'divided', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'3/4 cup homemade or store-bought pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'homemade', u'store-bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'2 packages instant ramen noodles, noodles only', u'aisle': u'Pasta and Rice', u'name': u'ramen noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ramen.jpg', u'unitLong': u'packages', u'unitShort': u'packages', u'amount': 2.0, u'consistency': u'solid', u'id': 6583, u'unit': u'packages'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/09/ramen-crust-pizza-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Adjust oven rack to center position and preheat oven to 450\xb0F. Bring a large pot of salted water to a boil.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Add noodles and cook, breaking them apart with tongs, until flexible but not completely softened, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drain carefully.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a 10-inch cast iron skillet over medium heat until shimmering.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add noodles and press with the bottom of a spatula into an even later that completely covers the bottom of the skillet. Reduce heat to low.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread half of mozzarella or Jack cheese evenly over noodles, then spread sauce, going all the way to the edge of the pan.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread remaining mozzarella or jack on top along with half of parmesan. Top pizza as desired, then place in oven.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Bake until top is browned and bubbly, about 20 minutes. Sprinkle with remaining parmesan. Allow to cool slightly, then use a thin metal spatula to loosen edges from skillet. Carefully slide pizza out onto cutting board. Slice, and serve immediately.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Ramen Noodles can be paired with Riesling, Sake, and Sauvignon Blanc. Sak\xe9 is an obvious choice when it comes to Japanese food. If you want to stick to grape wine, though, you might opt for sauvignon blanc or riesling. The Chateau Ste. Michelle Cold Creek Vineyard Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'riesling', u'sake', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish. View More', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 3008, u'instructions': u'Procedures                                                                              1                                                                            Adjust oven rack to center position and preheat oven to 450\xb0F. Bring a large pot of salted water to a boil. Add noodles and cook, breaking them apart with tongs, until flexible but not completely softened, about 2 minutes. Drain carefully.                                                                                                                            2                                                                            Heat olive oil in a 10-inch cast iron skillet over medium heat until shimmering. Add noodles and press with the bottom of a spatula into an even later that completely covers the bottom of the skillet. Reduce heat to low.                                                                                                                            3                                                                            Spread half of mozzarella or Jack cheese evenly over noodles, then spread sauce, going all the way to the edge of the pan. Spread remaining mozzarella or jack on top along with half of parmesan. Top pizza as desired, then place in oven. Bake until top is browned and bubbly, about 20 minutes. Sprinkle with remaining parmesan. Allow to cool slightly, then use a thin metal spatula to loosen edges from skillet. Carefully slide pizza out onto cutting board. Slice, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/ramen-crust-pizza-196529', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}