{u'recipes': [{u'sourceName': u'My Korean Kitchen', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/567482-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 567482, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sugar High, Stir Fried Rice Cake and Noodles (Rabokki)', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 271.24, u'creditText': u'My Korean Kitchen', u'extendedIngredients': [{u'originalString': u"Dark brown sugar - 4 Tbsp ; If you don't want to be attacked by sugar high pimples, I recommend you to reduce the amount of sugar. :) maybe reduce it down to 2 Tbsp", u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tbsp'}, {u'originalString': u'4 leaves of cabbage', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 4.0, u'consistency': u'solid', u'id': 11109, u'unit': u'leaves'}, {u'originalString': u'Fish cake 4 sheets - 240g', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'gsheets', u'unitShort': u'gsheets', u'amount': 240.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'gsheets'}, {u'originalString': u'Minced garlic -1 tsp', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'Gochujang - 4 Tbsp', u'aisle': u'Ethnic Foods', u'name': u'gochujang', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1016973, u'unit': u'Tbsp'}, {u'originalString': u'8 instant dumplings (optional)', u'aisle': u'Cereal;Baking', u'name': u'instant grits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 8092, u'unit': u''}, {u'originalString': u'Korean chili powder (Gochutgaru) - 1 tsp', u'aisle': u'Ethnic Foods', u'name': u'korean chili powder', u'metaInformation': [u'(Gochutgaru)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1072009, u'unit': u'tsp'}, {u'originalString': u'1 instant noodle pack.', u'aisle': u'Pasta and Rice', u'name': u'noodle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u''}, {u'originalString': u'1 onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Fresh rice cakes 300g (about 30 pieces) - If you use pre-packaged rice cakes, soak them in hot water for 3 minutes before you use them.', u'aisle': u'Savory Snacks', u'name': u'rice cakes', u'metaInformation': [u'fresh', u'hot', u'for 3 minutes before you use them.', u'( 30 pieces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-cakes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 19816, u'unit': u'g'}, {u'originalString': u'1 stalk of spring onion (optional)', u'aisle': u'Produce', u'name': u'spring onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'stalk'}, {u'originalString': u'1\xbd cups of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 70.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://mykoreankitchen.com/2007/01/15/sugar-high-stir-fried-rice-cake-and-noodles-rabokki-in-korean/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Thin slice the onion and diagonally slice the spring onion.Rinse the fish cakes in hot water. (To clean the oil coating from its surface)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Cut the fish cakes and cabbage into medium size pieces.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the water into the pot. Start to boil it on high heat. (3 to 5 mins)', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the sauce and stir it well.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add all the other ingredients and reduce the heat to medium to low. Stir them well. Simmer them until cooked (about 5 mins)', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'Thin slice the onion and diagonally slice the spring onion.Rinse the fish cakes in hot water. (To clean the oil coating from its surface)Cut the fish cakes and cabbage into medium size pieces.Pour the water into the pot. Start to boil it on high heat. (3 to 5 mins)Add the sauce and stir it well.Add all the other ingredients and reduce the heat to medium to low. Stir them well. Simmer them until cooked (about 5 mins)Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/sugar-high-stir-fried-rice-cake-and-noodles-rabokki-567482', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}