{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/428421-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 428421, u'veryPopular': False, u'lowFodmap': False, u'title': u'Golden Gelatin Salad', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 35.74, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (20 ounces) crushed pineapple', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 9354, u'unit': u'ounces'}, {u'originalString': u'1 cup grated carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 envelope unflavored gelatin', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'unflavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u'envelope'}, {u'originalString': u'1/2 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 cup vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}, {u'originalString': u'1/4 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/golden-gelatin-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, sprinkle gelatin over cold water; let stand for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain pineapple, reserving 1 cup juice (discard remaining juice or save for another use). Set the pineapple aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a saucepan, bring reserved juice to a boil.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heart. Stir in sugar, salt and gelatin mixture until dissolved.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add orange juice and vinegar. Refrigerate for 2 hours or until partially set. Fold in the carrots and pineapple.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}]}, {u'equipment': [], u'step': u'Transfer to a 4-cup mold coated with cooking spray. Refrigerate until firm. Unmold onto a serving platter.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'Directions                                                                                In a bowl, sprinkle gelatin over cold water; let stand for 1 minute. Drain pineapple, reserving 1 cup juice (discard remaining juice or save for another use). Set the pineapple aside.                                                                                            In a saucepan, bring reserved juice to a boil. Remove from the heart. Stir in sugar, salt and gelatin mixture until dissolved. Add orange juice and vinegar. Refrigerate for 2 hours or until partially set. Fold in the carrots and pineapple. Transfer to a 4-cup mold coated with cooking spray. Refrigerate until firm. Unmold onto a serving platter.                                        Yield: 8 servings.                                                                                                                         Originally published as Golden Gelatin Salad in  ReminisceSeptember/October 2000, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 82 calories, trace fat (trace saturated fat), 0 cholesterol, 81 mg sodium, 20 g carbohydrate, 1 g fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/golden-gelatin-salad-428421', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}