{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/544820-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 544820, u'veryPopular': True, u'lowFodmap': False, u'title': u'Olive Cheese Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 171.5, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 6-ounce can black olives, drained', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'ounce'}, {u'originalString': u'1 stick butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'1 loaf crusty French bread, sliced lengthwise', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [u'french', u'sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'loaf'}, {u'originalString': u'2 stalks green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'stalks'}, {u'originalString': u'1/2 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'12 ounces Monterey Jack cheese, grated', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'1 6-ounce jar pimiento-stuffed green olives, drained', u'aisle': u'Canned and Jarred', u'name': u'pimento stuffed olives', u'metaInformation': [u'green', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-stuffed.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1049195, u'unit': u'ounce'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/olive-cheese-bread-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 325 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Roughly chop both the black olives and pimiento-stuffed green olives. Slice the green onions into thin pieces.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'id': 1059195, u'name': u'black olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-olives---sliced.jpg', u'id': 1029195, u'name': u'green olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine the butter, mayonnaise, cheese, olives and green onions in a mixing bowl. Stir together until thoroughly combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Spread the mixture onto the French bread.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}]}, {u'equipment': [], u'step': u'Bake until the cheese is melted and browning, 20 to 25 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cheese Bread can be paired with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 405, u'instructions': u'Watch how to make this recipe.                    Preheat the oven to 325 degrees F.                          Roughly chop both the black olives and pimiento-stuffed green olives. Slice the green onions into thin pieces.                          Combine the butter, mayonnaise, cheese, olives and green onions in a mixing bowl. Stir together until thoroughly combined.                          Spread the mixture onto the French bread. Bake until the cheese is melted and browning, 20 to 25 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/olive-cheese-bread-544820', u'dishTypes': [u'side dish', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}