{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523100-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 523100, u'veryPopular': False, u'lowFodmap': False, u'title': u'Walnut Cinnamon Peanut Butter Power Bonbons', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 72.52, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'3 tsp Crispy Brown Rice Cereal', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'crispy'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20040, u'unit': u'tsp'}, {u'originalString': u'-1/2 tsp Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'2 Tbs Coconut Butter', u'aisle': u'Health Foods', u'name': u'coconut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 93746, u'unit': u'Tbs'}, {u'originalString': u'1oz Dark Chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 19904, u'unit': u'oz'}, {u'originalString': u'-2 tsp Powdered Erythritol', u'aisle': u'Health Foods;Baking', u'name': u'erythritol', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sanding-sugar.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 98887, u'unit': u'tsp'}, {u'originalString': u'30 Raisins, divided', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 30.0, u'consistency': u'solid', u'id': 9299, u'unit': u''}, {u'originalString': u'3 Raw Walnuts', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 12155, u'unit': u''}, {u'originalString': u'-Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 29.0, u'sourceUrl': u'http://dessertswithbenefits.com/surprise-peanut-butter-power-bonbons-3-ways/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the peanut butter protein balls, but flatten them from balls to cookies/patties to ~.3" thickness and ~1.5" width (should make a total of 6 patties)Coat three of the patties with the cinnamon, spreading with your finger.  Top this with a walnut.  Grab another patty and lay it on top of the walnut, pressing down on the edges to close it.  When done with the 3 bonbons, refrigerate while you make the icing', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a tiny bowl, add the cinnamon and erythritol.  Slowly drop water in a few drops at a time until it is icing consistency.  Scoop this into a ziploc bag and snip a tiny chunk out of the corner, ice with desired design.Make the peanut butter protein balls, but flatten them from balls to cookies/patties to ~.3" thickness and ~1.5" width (should make a total of 6 patties)Top three patties with 1 tsp of the rice krispies each.  Grab another patty and carefully lay it on top, pressing down on the edges to close it.  When done with the 3 bonbons, refrigerate while you make the chocolate drizzle', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sanding-sugar.png', u'id': 98887, u'name': u'erythritol'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"In a tiny bowl, melt the chocolate at 30-second intervals until melted (I accidentally heated the chocolate a little too much so I refrigerated it for ~3 minutes so it didn't slide down the bonbon).", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour this into a ziploc bag and snip a tiny chunk out of the corner, drizzle with desired design.Make the peanut butter protein balls, but flatten them from balls to cookies/patties to ~.3" thickness and ~1.5" width (should make a total of 6 patties)Top three patties with 10 raisins each (depends on the size).  Grab another patty and lay it on top, pressing down on the edges to close it.  When done with the 3 bonbons, refrigerate while you make the glaze', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"In a tiny bowl, microwave the coconut butter until melted (doesn't take long!  Again, I accidentally warmed mine too much so I refrigerated it for about 5 minutes, which made it thick enough so that it didn't pour all over the bonbon).", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'id': 93746, u'name': u'coconut butter'}]}, {u'equipment': [], u'step': u'Pour this into a ziploc bag and snip a tiny chunk out of the corner, drizzle with desired design.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 24, u'instructions': u'Make the peanut butter protein balls, but flatten them from balls to cookies/patties to ~.3" thickness and ~1.5" width (should make a total of 6 patties)Coat three of the patties with the cinnamon, spreading with your finger.  Top this with a walnut.  Grab another patty and lay it on top of the walnut, pressing down on the edges to close it.  When done with the 3 bonbons, refrigerate while you make the icingIn a tiny bowl, add the cinnamon and erythritol.  Slowly drop water in a few drops at a time until it is icing consistency.  Scoop this into a ziploc bag and snip a tiny chunk out of the corner, ice with desired design.Make the peanut butter protein balls, but flatten them from balls to cookies/patties to ~.3" thickness and ~1.5" width (should make a total of 6 patties)Top three patties with 1 tsp of the rice krispies each.  Grab another patty and carefully lay it on top, pressing down on the edges to close it.  When done with the 3 bonbons, refrigerate while you make the chocolate drizzleIn a tiny bowl, melt the chocolate at 30-second intervals until melted (I accidentally heated the chocolate a little too much so I refrigerated it for ~3 minutes so it didn\'t slide down the bonbon).  Pour this into a ziploc bag and snip a tiny chunk out of the corner, drizzle with desired design.Make the peanut butter protein balls, but flatten them from balls to cookies/patties to ~.3" thickness and ~1.5" width (should make a total of 6 patties)Top three patties with 10 raisins each (depends on the size).  Grab another patty and lay it on top, pressing down on the edges to close it.  When done with the 3 bonbons, refrigerate while you make the glazeIn a tiny bowl, microwave the coconut butter until melted (doesn\'t take long!  Again, I accidentally warmed mine too much so I refrigerated it for about 5 minutes, which made it thick enough so that it didn\'t pour all over the bonbon).   Pour this into a ziploc bag and snip a tiny chunk out of the corner, drizzle with desired design.', u'spoonacularSourceUrl': u'https://spoonacular.com/walnut-cinnamon-peanut-butter-power-bonbons-523100', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}