{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/754951-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 754951, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salmon Nicoise Salad', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 358.98, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup quartered cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'8 ounces green beans, trimmed', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11052, u'unit': u'ounces'}, {u'originalString': u'1/4 cup pitted kalamata olives, halved', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 15-ounce can no-salt-added white beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'no salt added diced tomatoes', u'metaInformation': [u'white', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11885, u'unit': u'ounce'}, {u'originalString': u'1/4 cup plain nonfat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 small red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 tablespoons red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tablespoons'}, {u'originalString': u'1 pound small red-skinned potatoes (about 10)', u'aisle': u'Produce', u'name': u'red-skinned potatoes', u'metaInformation': [u'small', u'( 10)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'pound'}, {u'originalString': u'1 romaine lettuce heart, chopped', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u''}, {u'originalString': u'1 15-ounce can skinless, boneless wild Alaskan pink salmon', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'wild', u'boneless', u'skinless', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounce'}], u'healthScore': 89.0, u'imageType': u'jpeg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/salmon-nicoise-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the potatoes in a saucepan and cover with cold water. Bring to a boil and cook until tender, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and let cool, then thinly slice.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Meanwhile, put the green beans in a microwave-safe bowl and add a splash of water. Cover with plastic wrap and microwave until tender, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [], u'step': u'Drain and pat dry; set aside.', u'number': 4, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the yogurt, vinegar and olive oil in a medium bowl; season with 1/4 teaspoon salt and a few grinds of pepper. Toss the romaine with 1 tablespoon of the dressing in a large bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Divide the romaine among bowls. Arrange the red onion, green beans, salmon, olives, potatoes, tomatoes and white beans on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Drizzle with the remaining dressing. Season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Photograph by Charles Masters', u'number': 4, u'ingredients': []}], u'name': u'Make the dressing'}], u'aggregateLikes': 99, u'instructions': u'Put the potatoes in a saucepan and cover with cold water. Bring to a boil and cook until tender, about 20 minutes. Drain and let cool, then thinly slice.                          Meanwhile, put the green beans in a microwave-safe bowl and add a splash of water. Cover with plastic wrap and microwave until tender, 6 to 8 minutes. Drain and pat dry; set aside.                          Make the dressing: Whisk the yogurt, vinegar and olive oil in a medium bowl; season with 1/4 teaspoon salt and a few grinds of pepper. Toss the romaine with 1 tablespoon of the dressing in a large bowl.                          Divide the romaine among bowls. Arrange the red onion, green beans, salmon, olives, potatoes, tomatoes and white beans on top. Drizzle with the remaining dressing. Season with salt and pepper.                          Photograph by Charles Masters', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-nicoise-salad-754951', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}