{u'recipes': [{u'sourceName': u'Seeded at the Table', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527997-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 527997, u'veryPopular': False, u'lowFodmap': False, u'title': u'No-Bake Summer Berry Bread Pudding #TheChew', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 25, u'pricePerServing': 172.33, u'creditText': u'Seeded at the Table', u'extendedIngredients': [{u'originalString': u'1 cup blackberries, fresh or frozen', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9042, u'unit': u'cup'}, {u'originalString': u'1 cup blueberries, fresh or frozen', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'12 slices cinnamon swirl bread (like this one)', u'aisle': u'Bakery/Bread', u'name': u'cinnamon swirl bread', u'metaInformation': [u'(like this one)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-raisin-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'solid', u'id': 18047, u'unit': u'slices'}, {u'originalString': u'3/4 cup of your favorite fruit jam/preserves/jelly', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19297, u'unit': u'cup'}, {u'originalString': u'Juice from half a lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 cup raspberries, fresh or frozen (or 1 cup chopped strawberries)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons sugar (more to taste)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'to taste', u'(more )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tablespoons'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.seededatthetable.com/2013/07/11/no-bake-summer-berry-bread-pudding-thechew/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Toss together the berries, sugar and lemon juice in a medium sauce pan.  Cook on medium-high heat just until the berries burst, about 5 minutes.  (Might take longer if using frozen.)', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Let set to cool for about 10 minutes.Meanwhile, line the bottom and sides of each cavity in a 6-cup jumbo muffin pan with plastic wrap. Set aside.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread 1 Tablespoon of jam onto 6 full slices of the bread.  Press one jam-covered bread slice into the bottom and sides of each plastic-wrap lined cavity, jam side facing up.  The bread should line the bottom and sides of the pan, creating a cup.  Be careful to ensure the plastic wrap is still sticking out a little from under each piece of bread.Evenly distribute the berry compote into each bread-lined muffin cup.  Using a round 3-inch biscuit cutter or the top of a round glass, cut a circle out of the remaining 6 slices of bread.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread 1 Tablespoon of jam on each bread round, then place jam-side down on top of each muffin cup.Cover the whole pan with plastic wrap then place a baking sheet on top to weigh it down.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Place the pan in the fridge, keeping the baking sheet on top and let set over night.The next day, flip the muffin tin upside down onto the baking sheet and let the molds transfer to the baking sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Remove the plastic wrap.  Use a large spatula to transfer each pudding mold to an individual serving plate.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately with a dollop of whipped cream and a sprinkling of cinnamon.(Best served no later than the next day.)', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Toss together the berries, sugar and lemon juice in a medium sauce pan.  Cook on medium-high heat just until the berries burst, about 5 minutes.  (Might take longer if using frozen.)  Let set to cool for about 10 minutes.Meanwhile, line the bottom and sides of each cavity in a 6-cup jumbo muffin pan with plastic wrap. Set aside. Spread 1 Tablespoon of jam onto 6 full slices of the bread.  Press one jam-covered bread slice into the bottom and sides of each plastic-wrap lined cavity, jam side facing up.  The bread should line the bottom and sides of the pan, creating a cup.  Be careful to ensure the plastic wrap is still sticking out a little from under each piece of bread.Evenly distribute the berry compote into each bread-lined muffin cup.  Using a round 3-inch biscuit cutter or the top of a round glass, cut a circle out of the remaining 6 slices of bread.  Spread 1 Tablespoon of jam on each bread round, then place jam-side down on top of each muffin cup.Cover the whole pan with plastic wrap then place a baking sheet on top to weigh it down.  Place the pan in the fridge, keeping the baking sheet on top and let set over night.The next day, flip the muffin tin upside down onto the baking sheet and let the molds transfer to the baking sheet.  Remove the plastic wrap.  Use a large spatula to transfer each pudding mold to an individual serving plate.  Serve immediately with a dollop of whipped cream and a sprinkling of cinnamon.(Best served no later than the next day.)', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-summer-berry-bread-pudding-thechew-527997', u'dishTypes': [u'dessert'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}