{u'recipes': [{u'sourceName': u'A Dash of Compassion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/624631-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 624631, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry apple spice overnight oatmeal', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 170.03, u'creditText': u'A Dash of Compassion', u'extendedIngredients': [{u'originalString': u'1/4 tsp allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'1/2 cup cranberry applesauce (see note)', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'2 tbsp chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tbsp'}, {u'originalString': u'1 cup fresh or frozen cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'3/4 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/4 cup pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'2 cups nondairy milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u"2 tsp blackstrap molasses (don't skip this!)", u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [u"(don't skip this!)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tsp'}, {u'originalString': u'2 cups rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.adashofcompassion.com/2014/12/cranberry-apple-spice-overnight-oatmeal/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, stir together all ingredients, except the cranberries, until combined. Stir in the cranberries. Cover and refrigerate overnight, or if you want to eat sooner, allow to sit for at least one hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Serve cold, or transfer to a large saucepan and heat over medium-low, stirring frequently, until warmed through.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add more nondairy milk to thin out, if desired.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with chopped nuts, shredded coconut, pumpkin seeds, hemp seeds, more cranberries, etc. to make it even more fun!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}], u'name': u''}], u'aggregateLikes': 35, u'instructions': u'In a large mixing bowl, stir together all ingredients, except the cranberries, until combined. Stir in the cranberries. Cover and refrigerate overnight, or if you want to eat sooner, allow to sit for at least one hour.Serve cold, or transfer to a large saucepan and heat over medium-low, stirring frequently, until warmed through. Add more nondairy milk to thin out, if desired. Serve with chopped nuts, shredded coconut, pumpkin seeds, hemp seeds, more cranberries, etc. to make it even more fun!', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-apple-spice-overnight-oatmeal-624631', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}