{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/831092-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 831092, u'veryPopular': False, u'lowFodmap': False, u'title': u'Japanese Chicken Noodle Soup', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 408.45, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 cups julienned carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'2 pounds bone-in chicken breasts, skinless', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'bone-in', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u'pounds'}, {u'originalString': u'2 cups sliced shiitake or enoki mushrooms', u'aisle': u'Produce', u'name': u'enoki mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/enoki-mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11950, u'unit': u'cups'}, {u'originalString': u'1 tablespoon minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'2 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 cups sliced green cabbage', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'8 cups low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 1/4 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'3 cups cooked udon noodles or whole-wheat spaghetti', u'aisle': u'Ethnic Foods', u'name': u'udon noodles', u'metaInformation': [u'whole-wheat', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/udon-noodles.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 98966, u'unit': u'cups'}, {u'originalString': u'2 tablespoons white miso (see Tip)', u'aisle': u'Ethnic Foods', u'name': u'white miso', u'metaInformation': [u'white', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10116112, u'unit': u'tablespoons'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.eatingwell.com/recipe/251277/japanese-chicken-noodle-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil in a large pot over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion and garlic and cook, stirring occasionally, until softened, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add ginger; cook, stirring, for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Add broth and chicken. Cover, increase heat to high and bring to a simmer. Uncover and cook, turning the chicken occasionally, until an instant-read thermometer inserted into the thickest part without touching bone registers 165F, 20 to 22 minutes. Skim any foam from the surface as the chicken cooks.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer the chicken to a clean cutting board. When cool enough to handle, remove the meat from the bones and shred.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Meanwhile, add cabbage, mushrooms and carrots to the pot; return to a simmer. Cook until vegetables are tender, 4 to 10 minutes. Stir in the shredded chicken, salt, pepper and noodles and cook until heated through, about 3 minutes more.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in miso.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Ghost Pines Sonoma County Napa County Monterey County Chardonnay. It has 5 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Heat oil in a large pot over medium heat. Add onion and garlic and cook, stirring occasionally, until softened, 2 to 3 minutes. Add ginger; cook, stirring, for 1 minute. Add broth and chicken. Cover, increase heat to high and bring to a simmer. Uncover and cook, turning the chicken occasionally, until an instant-read thermometer inserted into the thickest part without touching bone registers 165F, 20 to 22 minutes. Skim any foam from the surface as the chicken cooks. Transfer the chicken to a clean cutting board. When cool enough to handle, remove the meat from the bones and shred.                        Meanwhile, add cabbage, mushrooms and carrots to the pot; return to a simmer. Cook until vegetables are tender, 4 to 10 minutes. Stir in the shredded chicken, salt, pepper and noodles and cook until heated through, about 3 minutes more. Remove from heat and stir in miso.', u'spoonacularSourceUrl': u'https://spoonacular.com/japanese-chicken-noodle-soup-831092', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}