{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205257-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205257, u'veryPopular': False, u'lowFodmap': True, u'title': u'Cherry Shrub Spritzer', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 91.38, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 ounce Lillet Blanc', u'aisle': u'Alcoholic Beverages', u'name': u'lillet blanc', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 93786, u'unit': u'ounce'}, {u'originalString': u'1/2 ounce fresh juice from 1 lime', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'ounce'}, {u'originalString': u'1/2 ounce cherry shrub syrup (see related recipe)', u'aisle': u'Alcoholic Beverages', u'name': u'maraschino cherry syrup', u'metaInformation': [u'(see related recipe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 99032, u'unit': u'ounce'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/07/drinking-in-season-cherry-shrub-spritzer-lillet-blanc-cocktail-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shrub syrup to the bottom of a Collins glass. Fill the glass with ice, then add the Lillet Blanc, lime juice, and seltzer. Stir lightly to combine, and serve immediately.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93786, u'name': u'lillet blanc'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 52, u'instructions': u'Procedures                                                                              1                                                                            Add the shrub syrup to the bottom of a Collins glass. Fill the glass with ice, then add the Lillet Blanc, lime juice, and seltzer. Stir lightly to combine, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-shrub-spritzer-205257', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}