{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/741910-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 741910, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fontina and Mozzarella Grilled Cheese with Bacon and Honey Crisp Apples', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 447.97, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 Honey Crisp apple, peeled and sliced really thinly', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'crisp', u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u''}, {u'originalString': u'12 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1/4 cup Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002046, u'unit': u'cup'}, {u'originalString': u'16 slices fontina, thinly sliced from the deli', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 16.0, u'consistency': u'solid', u'id': 1020, u'unit': u'slices'}, {u'originalString': u'8 slices fresh mozzarella, 1/4 inch thick', u'aisle': u'Cheese', u'name': u'fresh mozzarella', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1026, u'unit': u'slices'}, {u'originalString': u'8 slices pumpernickel', u'aisle': u'Bakery/Bread', u'name': u'pumpernickel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpernickel.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18044, u'unit': u'slices'}, {u'originalString': u'1 stick unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}], u'healthScore': 19.0, u'imageType': u'jpeg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/anne-burrell/fontina-and-mozzarella-grilled-cheese-with-bacon-and-honey-crisp-apples.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 46, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the bacon in a large saute pan over medium heat until brown and crispy on both sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer to a plate lined with paper towels and reserve.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat a griddle or nonstick saute pan to medium. Between two pieces of paper towels, pat dry the mozzarella.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [], u'step': u'Spread each piece of bread with a thin, even layer of butter.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread the other side of each piece of bread with Dijon. Lay the bread down with the Dijon sides facing up on a baking sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place one slice of fontina, one slice of mozzarella and then another slice of fontina on each piece of bread. Lay 3 bacon slices on half of the slices of the cheese-lined bread. Top the bacon with an even layer of apple slices (these are the bottoms, the ones with just cheese are the tops--together they make a pair!).', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Place the tops and bottoms on the griddle butter-side down and cook until the bread gets brown and crusty and the cheese begins to melt, 5 to 7 minutes. When the cheese is nice and melty, flip the tops onto the bottoms so the cheese is on the inside. Give each sandwich a press, flip over and cook for 1 to 2 minutes more.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the sandwiches in half on the bias and serve hot.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 888, u'instructions': u'Cook the bacon in a large saute pan over medium heat until brown and crispy on both sides. Transfer to a plate lined with paper towels and reserve.                          Preheat a griddle or nonstick saute pan to medium. Between two pieces of paper towels, pat dry the mozzarella.                          Spread each piece of bread with a thin, even layer of butter. Spread the other side of each piece of bread with Dijon. Lay the bread down with the Dijon sides facing up on a baking sheet.                          Place one slice of fontina, one slice of mozzarella and then another slice of fontina on each piece of bread. Lay 3 bacon slices on half of the slices of the cheese-lined bread. Top the bacon with an even layer of apple slices (these are the bottoms, the ones with just cheese are the tops--together they make a pair!).                          Place the tops and bottoms on the griddle butter-side down and cook until the bread gets brown and crusty and the cheese begins to melt, 5 to 7 minutes. When the cheese is nice and melty, flip the tops onto the bottoms so the cheese is on the inside. Give each sandwich a press, flip over and cook for 1 to 2 minutes more.                          Cut the sandwiches in half on the bias and serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/fontina-and-mozzarella-grilled-cheese-with-bacon-and-honey-crisp-apples-741910', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}