{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219796-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 219796, u'veryPopular': False, u'lowFodmap': False, u'title': u'Family meals: Chicken & veg casserole', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 193.87, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'knob of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'3 medium carrots, finely chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 medium sticks celery, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'sticks'}, {u'originalString': u'1 chicken stock cube', u'aisle': u'Canned and Jarred', u'name': u'chicken stock cube', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6080, u'unit': u''}, {u'originalString': u'500g approx chicken thighs', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 5091, u'unit': u'g'}, {u'originalString': u'1 x 400g can chickpeas, drained (optional)', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 16057, u'unit': u''}, {u'originalString': u'1 tsp dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'tsp'}, {u'originalString': u'2 fat garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 red or orange pepper, diced', u'aisle': u'Produce', u'name': u'orange pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'1 tsp sweet smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'sweet paprika', u'metaInformation': [u'smoked', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'tsp'}, {u'originalString': u'2 x 400g cans chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2451650/family-meals-chicken-and-veg-casserole', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter in a large heavy-based pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the onion, carrot and celery and cook gently until softened.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chicken thighs, garlic, spices and thyme. Cook stirring until the chicken is opaque.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Pour in the tomatoes, plus one extra can of water or enough to cover the chicken and vegetables.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add the stock and pepper. Bring to a simmer and cook uncovered for 50 mins.If using, add the chickpeas and cook for a further five mins.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [], u'step': u'Serve with rice. For young children, break the chicken into smaller pieces and serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 95, u'instructions': u'Heat the butter in a large heavy-based pan. Add the onion, carrot and celery and cook gently until softened.Add the chicken thighs, garlic, spices and thyme. Cook stirring until the chicken is opaque.Pour in the tomatoes, plus one extra can of water or enough to cover the chicken and vegetables. Add the stock and pepper. Bring to a simmer and cook uncovered for 50 mins.If using, add the chickpeas and cook for a further five mins. Serve with rice. For young children, break the chicken into smaller pieces and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/family-meals-chicken-veg-casserole-219796', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}