{u'recipes': [{u'sourceName': u'Healthy Delicious', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/586527-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 586527, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stuffed Collard Greens', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 9.42, u'creditText': u'Healthy Delicious', u'extendedIngredients': [{u'originalString': u'1 bunch collard greens', u'aisle': u'Produce', u'name': u'collard greens', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11161, u'unit': u'bunch'}, {u'originalString': u'\xbc cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'1 tabelspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u''}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 shallots, minced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'Tabasco\xae original red sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'red', u'tabasco\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'1 cup sushi rice', u'aisle': u'Pasta and Rice', u'name': u'sushi rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220054, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.healthy-delicious.com/2013/10/stuffed-collard-greens/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare the rice according to the directions on the package.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a small pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the minced shallot and cook until golden and slightly crisp, 2-3 minutes; pour the shallot and oil into the rice.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Mix in the raisins and season to taste with salt and pepper.Lay a collard green flat on the workspace in front of you, veiny side up. Use a sharp knife or a pair of kitchen shears to carefully cut out the tough center stem. Spoon 1 tablespoon of filling onto one end of the green. Fold in the sides, the roll up like a burrito.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/steamer.jpg', u'id': 404767, u'name': u'steamer basket'}], u'step': u'Place seam-side down in a steamer basket. Repeat with enough greens to make a single layer in the basket; sprinkle heavily with tabasco. Repeat with remaining greens to form a second layer.Steam for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm, at room temperature, or chilled.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Collard Greens works really well with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Chateau Ste. Michelle Cold Creek Vineyard Riesling. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish.', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 60, u'instructions': u'Prepare the rice according to the directions on the package. Let cool.Heat the olive oil in a small pan. Add the minced shallot and cook until golden and slightly crisp, 2-3 minutes; pour the shallot and oil into the rice. Mix in the raisins and season to taste with salt and pepper.Lay a collard green flat on the workspace in front of you, veiny side up. Use a sharp knife or a pair of kitchen shears to carefully cut out the tough center stem. Spoon 1 tablespoon of filling onto one end of the green. Fold in the sides, the roll up like a burrito. Place seam-side down in a steamer basket. Repeat with enough greens to make a single layer in the basket; sprinkle heavily with tabasco. Repeat with remaining greens to form a second layer.Steam for 30 minutes. Serve warm, at room temperature, or chilled.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-collard-greens-586527', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}