{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/152069-556x370.', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 195, u'id': 152069, u'veryPopular': False, u'lowFodmap': False, u'title': u'Damson Tartlets', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 163.92, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 Turkish or 1/2 California bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'turkish bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 cup confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'3 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 pound damson plums or prune plums', u'aisle': u'Produce', u'name': u'plums', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 9279, u'unit': u'pound'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'2 sticks (1/2 pound) cold unsalted butter, cut into 1/2-inch cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'pound'}, {u'originalString': u'1/2 vanilla bean, split lengthwise', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'2 tablespoons white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Damson-Tartlets-240164', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put cream in a large bowl, then scrape seeds from vanilla bean into cream. Beat in sugar and zest with an electric mixer until cream just holds stiff peaks. Fold in about 2 tablespoons plum compote, then divide cream among tartlet shells.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}, {u'equipment': [], u'step': u'Serve topped with some of remaining compote (you will have a lot left over).', u'number': 2, u'ingredients': []}], u'name': u'Make cream filling'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Pulse flour, butter, and confectioners sugar in a food processor until it resembles coarse meal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add egg yolks and pulse just until a dough forms.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Transfer dough to a lightly floured surface and divide in half. Form each half into a 4-inch square (about 1 inch thick) and wrap in plastic wrap. Freeze until solid, at least 2 hours.', u'number': 3, u'ingredients': []}], u'name': u'Make pastry dough'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"Bring whole plums, sugar, wine, and bay leaf to a simmer in a heavy medium saucepan over medium-low heat, covered, stirring occasionally until sugar has dissolved (be careful juices don't boil over). Reduce heat to low and simmer, covered, stirring occasionally, until plums fall apart, about 30 minutes.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and chill, uncovered, until cold, then cover. Discard pits and bay leaf, then add a little confectioners sugar to taste if desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}], u'name': u'Make compote while pastry freezes'}, {u'steps': [{u'equipment': [], u'step': u"• If you can't find damson or prune plums, substitute the slightly sweeter red or black plums and use 2 tablespoons lemon juice in place of wine (for greater acidity).• Four-inch fluted tartlet pans are available at Bridge Kitchenware (212-688-4220; bridgekitchenware.com).• Pastry can be frozen up to 1 month.• Compote keeps, covered and chilled, 2 weeks.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'black plum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}], u'name': u"Cooks' notes"}, {u'steps': [{u'equipment': [], u'step': u'Coarsely grate pastry from one frozen square into tartlet pans, dividing it evenly. (Reserve remaining dough for another use.) Press dough flakes into tartlet pans to line bottoms and sides evenly. Prick bottoms all over with a fork, then freeze tartlets until firm, at least 1 hour.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425\xb0F with rack in middle.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Put tartlets in a shallow baking pan and put in oven. Turn oven temperature down to 400\xb0F and bake until shells are golden all over, 15 to 18 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer tartlet pans to a rack to cool completely, then remove shells from pans.', u'number': 4, u'ingredients': []}], u'name': u'Bake pastry'}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellafina Prosecco with a 4.6 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"Intensely aromatic and crisp on the palate, with aromas and flavorsof yellow apple, white peach, pear and notes of white flowers.Excellent as an aperitif, it is a perfect accompaniment to hors-d'oeuvres and delicate first courses. Also wonderful with fish and shellfish. View More", u'title': u'Bellafina Prosecco', u'price': u'$11.99', u'id': 461572, u'link': u'https://www.wine.com/product/bellafina-prosecco/136821', u'imageUrl': u'https://spoonacular.com/productImages/461572-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u"Preparation                                                    Make pastry dough:                Pulse flour, butter, and confectioners sugar in a food processor until it resembles coarse meal. Add egg yolks and pulse just until a dough forms.                                                                            Transfer dough to a lightly floured surface and divide in half. Form each half into a 4-inch square (about 1 inch thick) and wrap in plastic wrap. Freeze until solid, at least 2 hours.                                                                        Make compote while pastry freezes:                Bring whole plums, sugar, wine, and bay leaf to a simmer in a heavy medium saucepan over medium-low heat, covered, stirring occasionally until sugar has dissolved (be careful juices don't boil over). Reduce heat to low and simmer, covered, stirring occasionally, until plums fall apart, about 30 minutes. Transfer to a bowl and chill, uncovered, until cold, then cover. Discard pits and bay leaf, then add a little confectioners sugar to taste if desired.                                                                        Bake pastry:                Coarsely grate pastry from one frozen square into tartlet pans, dividing it evenly. (Reserve remaining dough for another use.) Press dough flakes into tartlet pans to line bottoms and sides evenly. Prick bottoms all over with a fork, then freeze tartlets until firm, at least 1 hour.                                                                            Preheat oven to 425\xb0F with rack in middle.                                                                            Put tartlets in a shallow baking pan and put in oven. Turn oven temperature down to 400\xb0F and bake until shells are golden all over, 15 to 18 minutes.                                                                            Transfer tartlet pans to a rack to cool completely, then remove shells from pans.                                                                        Make cream filling:                Put cream in a large bowl, then scrape seeds from vanilla bean into cream. Beat in sugar and zest with an electric mixer until cream just holds stiff peaks. Fold in about 2 tablespoons plum compote, then divide cream among tartlet shells. Serve topped with some of remaining compote (you will have a lot left over).                                                Cooks' notes:            • If you can't find damson or prune plums, substitute the slightly sweeter red or black plums and use 2 tablespoons lemon juice in place of wine (for greater acidity).• Four-inch fluted tartlet pans are available at Bridge Kitchenware (212-688-4220; bridgekitchenware.com).• Pastry can be frozen up to 1 month.• Compote keeps, covered and chilled, 2 weeks.", u'spoonacularSourceUrl': u'https://spoonacular.com/damson-tartlets-152069', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}