{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/390328-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 390328, u'veryPopular': False, u'lowFodmap': False, u'title': u"Amy's Chocolate Chip Cookies", u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 14.19, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 (3.5 ounce) package instant vanilla pudding mix', u'aisle': u'Baking', u'name': u'instant vanilla pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 19206, u'unit': u'ounce'}, {u'originalString': u'3/4 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup margarine, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4073, u'unit': u'cup'}, {u'originalString': u'2 cups semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Amys-Chocolate-Chip-Cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F (190 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a medium-sized mixing bowl, combine flour and baking soda. Set aside. In another large mixing bowl, combine butter, white sugar, brown sugar, vanilla, and pudding mix. Beat until smooth and creamy. Beat in eggs. Gradually stir in flour mixture. Stir in chocolate chips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Drop batter by heaping teaspoonfuls, about 2 inches apart, onto an ungreased cookie sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 9 to 9 1/2 minutes, or until browned.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 65, u'instructions': u'Preheat oven to 375 degrees F (190 degrees C).                            In a medium-sized mixing bowl, combine flour and baking soda. Set aside. In another large mixing bowl, combine butter, white sugar, brown sugar, vanilla, and pudding mix. Beat until smooth and creamy. Beat in eggs. Gradually stir in flour mixture. Stir in chocolate chips.                            Drop batter by heaping teaspoonfuls, about 2 inches apart, onto an ungreased cookie sheet. Bake for 9 to 9 1/2 minutes, or until browned.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/amys-chocolate-chip-cookies-390328', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 48, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}