{u'recipes': [{u'sourceName': u'Healing Tomato', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/848947-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 848947, u'veryPopular': True, u'lowFodmap': True, u'title': u'Vegan Buttercream Frosting', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 26.01, u'creditText': u'Healing Tomato', u'extendedIngredients': [{u'originalString': u'1 Tbsp of almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'Tbsp'}, {u'originalString': u'1 cup of confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'2 drops of natural pink food coloring', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 2.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'2 drops of vanilla essence', u'aisle': u'Baking', u'name': u'vanilla essence', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012050, u'unit': u'drops'}, {u'originalString': u'1 cup of vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.healingtomato.com/2015/10/07/vegan-buttercream-frosting/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Take 1 cup of confectioners sugar.  I like to sieve the sugar in a separate bowl and set it aside. In a separate bowl, add 1 cup of vegetable shortening', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'vegetable shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Using a hand mixture, blend on low speed for about 7 minutes or until it becomes smooth.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add vanilla essence and blend for 30 more seconds', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1012050, u'name': u'artificial vanilla'}]}, {u'equipment': [], u'step': u'Add the sieved confectioners sugar to the shortening', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Blend with a hand mixture on low speed.  Blend until the shortening and sugar mix.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Add 1 Tbsp of almond milk and blend again.  Blend until all the mixture is blended well together and it is light and fluffy.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}]}, {u'equipment': [], u'step': u'Add 1-2 drops of natural pink food coloring and mix well. Frost with it immediately and serve.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11065, u'instructions': u'Take 1 cup of confectioners sugar.  I like to sieve the sugar in a separate bowl and set it aside. In a separate bowl, add 1 cup of vegetable shorteningUsing a hand mixture, blend on low speed for about 7 minutes or until it becomes smooth.  Add vanilla essence and blend for 30 more secondsAdd the sieved confectioners sugar to the shorteningBlend with a hand mixture on low speed.  Blend until the shortening and sugar mix. Add 1 Tbsp of almond milk and blend again.  Blend until all the mixture is blended well together and it is light and fluffy.Add 1-2 drops of natural pink food coloring and mix well. Frost with it immediately and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-buttercream-frosting-848947', u'dishTypes': [u'frosting', u'icing'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}