{u'recipes': [{u'sourceName': u'My Whole Food Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/835642-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 835642, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet and Salty Holiday Bark', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 44.91, u'creditText': u'My Whole Food Life', u'extendedIngredients': [{u'originalString': u'Dash of almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'Dash'}, {u'originalString': u'2 cups chocolate chunks (I like Enjoy life)', u'aisle': u'Baking', u'name': u'chocolate chunks', u'metaInformation': [u'(I like Enjoy life)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10419903, u'unit': u'cups'}, {u'originalString': u'1/4 cup pistachios', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'1/4 cup pomegranate', u'aisle': u'Produce', u'name': u'pomegranate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1009286, u'unit': u'cup'}, {u'originalString': u'1/4 cup pretzels', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19047, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://mywholefoodlife.com/2016/12/19/sweet-and-salty-holiday-bark/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'In a double boiler, melt the chocolate with the small amount of almond milk.Once melted, spread the chocolate onto a parchment lined', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'baking sheet', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'.Sprinkle the toppings onto the chocolate and gently press them in.Freeze until the chocolate has set.  Around 4 hours.Once frozen, cut into squares or break into pieces.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Bark works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'In a double boiler, melt the chocolate with the small amount of almond milk.Once melted, spread the chocolate onto a parchment lined                  baking sheet             .Sprinkle the toppings onto the chocolate and gently press them in.Freeze until the chocolate has set.  Around 4 hours.Once frozen, cut into squares or break into pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-salty-holiday-bark-835642', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}