{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/708631-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 708631, u'veryPopular': True, u'lowFodmap': False, u'title': u'Paleo Chicken Satay - Paleo Cupboard', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'pescatarian'], u'pricePerServing': 357.37, u'extendedIngredients': [{u'originalString': u'- 1/3 cup. almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'- 2 tsp. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'- 3 Tbsp. coconut aminos', u'aisle': u'Health Foods;Condiments', u'name': u'coconut aminos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 98929, u'unit': u'Tbsp'}, {u'originalString': u'- 1 Tbsp. extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tbsp'}, {u'originalString': u'- 1 Tbsp. fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'Tbsp'}, {u'originalString': u'- 1 inch of fresh ginger, peeled and grated', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'- 1 1/2 cups full fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'cups'}, {u'originalString': u'- 2 cloves garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'- 1/4 tsp. ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'- Dash ground black pepper (or more to taste)', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black', u'to taste', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Dash'}, {u'originalString': u'- 1 Tbsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'- 2 tsp. lime juice (or more to taste)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'to taste', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tsp'}, {u'originalString': u'1 small onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'- 1/4 tsp. crush red pepper (or more to taste)', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'red', u'to taste', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'- 2 Tbsp. raw honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbsp'}, {u'originalString': u'- 1/2 tsp. sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'- Dash. sea salt (or more to taste)', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 21.0, u'imageType': u'png', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.paleocupboard.com/chicken-skewers-with-satay-sauce.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Mix the marinade ingredients together in a large resealable container or resealable plastic bag.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the chicken inside and allow to marinate in the refrigerator for 2 hours or more.2. To make the sauce, combine all of the ingredients in a small saucepan over medium-high heat and bring just to a boil. Reduce heat to low and allow to simmer for about 5 minutes. Taste and adjust seasonings as needed.3. Skewer the chicken onto bamboo skewers and grill for 3-4 minutes on each side or until chicken is cooked through.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Serve the chicken on the skewer along with the sauce (I prefer my sauce to be served slightly warm).', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2526, u'instructions': u'<p>1. Mix the marinade ingredients together in a large resealable container or resealable plastic bag. Place the chicken inside and allow to marinate in the refrigerator for 2 hours or more.2. To make the sauce, combine all of the ingredients in a small saucepan over medium-high heat and bring just to a boil. Reduce heat to low and allow to simmer for about 5 minutes. Taste and adjust seasonings as needed.3. Skewer the chicken onto bamboo skewers and grill for 3-4 minutes on each side or until chicken is cooked through. Serve the chicken on the skewer along with the sauce (I prefer my sauce to be served slightly warm).</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/paleo-chicken-satay-paleo-cupboard-708631', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}