{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/203829-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 203829, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sriracha and SPAM Fried Rice', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 50.4, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 cups cooked white rice, cooled (preferably day-old)', u'aisle': u'Pasta and Rice', u'name': u'cooked white rice', u'metaInformation': [u'white', u'cooled', u'cooked', u'(preferably day-old)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'1/2 cup frozen corn kernels', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11172, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Sliced green onions, green part only, for garnish', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'3 tablespoons toasted sesame oil or peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup Sriracha, plus more for garnish', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1016168, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/02/sriracha-and-spam-fried-rice-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl whisk together the Sriracha and soy sauce. Reserve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a large nonstick or cast-iron skillet or wok over very high heat until it is rocket hot.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 tablespoon of the oil to the skillet and let it heat up until it begins to shimmer and wrinkle, 10 to 15 seconds. Toss in the SPAM and corn and cook until the meat begins to brown, 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add an additional tablespoon of oil to the pan, and heat for 10 seconds.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rice, stirring to coat each grain with oil. Stir-fry for 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Move the rice mixture toward the outer edges of the pan, creating a “well” in the center.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining tablespoon of oil to the center of the pan, and heat until it shimmers, 10 to 15 seconds.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Add the eggs and garlic, stirring feverishly. Cook until the eggs are cooked through, then drizzle the Sriracha/ soy mixture over the rice. Toss everything together to combine, cooking for an additional 30 seconds or so.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'4', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mound the rice into bowls, garnish with Sriracha and green onions, and serve immediately.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 394, u'instructions': u'Procedures                                                                              1                                                                            In a small bowl whisk together the Sriracha and soy sauce. Reserve.                                                                                                                            2                                                                            Heat a large nonstick or cast-iron skillet or wok over very high heat until it is rocket hot. Add 1 tablespoon of the oil to the skillet and let it heat up until it begins to shimmer and wrinkle, 10 to 15 seconds. Toss in the SPAM and corn and cook until the meat begins to brown, 3 to 5 minutes. Add an additional tablespoon of oil to the pan, and heat for 10 seconds. Add the rice, stirring to coat each grain with oil. Stir-fry for 3 minutes.                                                                                                                            3                                                                            Move the rice mixture toward the outer edges of the pan, creating a “well” in the center. Add the remaining tablespoon of oil to the center of the pan, and heat until it shimmers, 10 to 15 seconds. Add the eggs and garlic, stirring feverishly. Cook until the eggs are cooked through, then drizzle the Sriracha/ soy mixture over the rice. Toss everything together to combine, cooking for an additional 30 seconds or so.                                                                                                                            4                                                                            Mound the rice into bowls, garnish with Sriracha and green onions, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/sriracha-and-spam-fried-rice-203829', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}