{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/199949-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199949, u'veryPopular': False, u'lowFodmap': True, u'title': u'Toisan-Style Joong', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 623.52, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/4 cup dried baby shrimp, about 1 ounce total (Cantonese: ha mai, see note)', u'aisle': u'Seafood', u'name': u'baby shrimp', u'metaInformation': [u'dried', u'(Cantonese: ha mai, see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 15152, u'unit': u'cup'}, {u'originalString': u'1 (12-ounce) package dried joong leaves (see note)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [u'dried', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 2004, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'8 raw salted duck egg yolks (recipe, see note)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'duck egg', u'metaInformation': [u'raw', u'salted', u'(recipe, see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quail-eggs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1138, u'unit': u''}, {u'originalString': u'2 1/2 pounds glutinous rice (Cantonese: loh mai, see note)', u'aisle': u'Pasta and Rice', u'name': u'glutinous rice', u'metaInformation': [u'(Cantonese: loh mai, see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-jasmine-cooked.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 10020054, u'unit': u'pounds'}, {u'originalString': u'4 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 (14-ounce) package dried split hulled mung beans (see note)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'mung beans', u'metaInformation': [u'dried', u'split', u'hulled', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mung-beans.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16080, u'unit': u'ounce'}, {u'originalString': u'1/2 pound cured pork belly (recipe)', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'(recipe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 10005, u'unit': u'pound'}, {u'originalString': u'3 links of Chinese sausage, about 6 ounces total (Cantonese: lap cheong, see note)', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'chinese', u'(Cantonese: lap cheong, see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'links', u'unitShort': u'links', u'amount': 3.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'links'}, {u'originalString': u'4 dried scallops, about 1 ounce total (Cantonese: ghown bhoy, see note', u'aisle': u'Seafood', u'name': u'scallops', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10015172, u'unit': u''}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/05/toisan-style-joong-zong-zi-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Follow recipe to brine duck eggs. If using cooked salted duck egg yolks, go to step 2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quail-eggs.jpg', u'id': 1138, u'name': u'duck eggs'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Follow recipe to cure pork belly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'id': 10005, u'name': u'pork belly'}]}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place shrimp and scallops in separate small bowls. Wash three times in cold water drain. Cover completely with water and let soak for fifteen minutes. drain and set aside. Shred scallops into strips and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'9', u'number': 2, u'ingredients': []}], u'name': u'For the dried shrimp and dried scallops'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Place beans in fine meshed strainer. Rinse under cold running water until water runs clear.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add vegetable oil and salt and mix well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add mung beans to rice and toss to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mung-beans.png', u'id': 16080, u'name': u'mung beans'}]}, {u'equipment': [], u'step': u'11', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'To Assemble: Take two whole joong leaves of approximately the same size.  Make sure there are no tears or rips in leaves. Leaves should curve in same direction. Take one joong leaf in each hand holding it horizontally in front of you while making sure the ends match each other. Overlap edge of one leaf onto center spine of other leaf. Hold overlapping leaves together with your thumb in the center of the leaves and fold in half.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'12', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Fold bottom half inch of leaf upwards and tuck under thumb to create pocket inside leaves for joong. Hold the folded leaves in one hand and then use the other hand to open the leaves to make the pocket inside.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'13', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Holding leaves firmly, place 3 tablespoons rice mixture in pocket.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add once piece cured pork belly, half an egg yolk, three shrimp, three strands scallops and one piece lap cheong to center of rice. Cover filling with another 3 tablespoons rice.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'id': 10005, u'name': u'pork belly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'14', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Add third joong leaf by wrapping it around top of the two leaves in order to extend the height of the joong. You will be using this leaf to close everything up.Take outer edge of third leaf and fold it towards the center, sealing the joong. The joong should now be sealed at one end and open at the other.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'15', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Smooth out leaves towards open end and then gather all the ends, fold them towards the center and hold down with your thumb. Be firm, but do not rip or tear leaves. If leaves tear, start over. Secure the with kitchen twine by making several loops around joong and securing with knot. Pat finished joong with hands on both sides to compact. Repeat until joong leaves and filling are finished. Excess joong leaves can be dried at room temperature on a wire cooling rack and reused', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'16', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Layer finished joong in a large stockpot and cover with water.', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place on stove over high heat, cover, and bring to a boil. Reduce heat to medium. Cook for 2 1/2 hours, topping up pot with boiling water to keep joong submerged and rotating joong every hour to promote even cooking.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'17', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Remove joong and drain in colander set in sink. Allow to rest for ten minutes.', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Cut open parcels and serve immediately with soy sauce.Extra joong can be stored in refrigerator for up to one week or in freezer for several months. To reheat, place in simmering water until heated through.', u'number': 20, u'ingredients': []}], u'name': u'For the mung bean'}, {u'steps': [{u'equipment': [], u'step': u'Place at least half of the package of joong leaves in a large container and cover completely with cool water.  Soak leaves for twenty-four hours, changing water twice.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Place joong leaves in large stockpot or Dutch oven. Cover with water and place on stove over high heat. Bring to a boil, reduce heat to medium and cook for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Drain leaves and rinse with cold water. Using a vegetable brush, take one leaf and scrub each side and rinse again under running water. Trim off  stem using kitchen shears and discard. Repeat until all the leaves are scrubbed, rinsed and trimmed. Put leave sin colander and set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'For the lap cheong: Rinse lap cheong under cold running water and drain.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each lap cheong in half crosswise. Split each half lengthwise twice into quarters (you should get 8 pieces out of each lap cheong). Set aside.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'6', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'For the the cured pork belly: Rinse pork belly under cold running water to remove excess salt. Pat dry with paper towels and slice into 1/2-inch wide strips lengthwise.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'id': 10005, u'name': u'pork belly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut each strip into 1-inch pieces. Set aside.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'7', u'number': 11, u'ingredients': []}], u'name': u'For the joong leaves'}, {u'steps': [{u'equipment': [], u'step': u'Cut each yolk in half and set aside.  If using raw salted duck egg yolk: Separate whites from yolks. Reserve whites for another use (they will keep for 1 month in the refrigerator).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quail-eggs.jpg', u'id': 1138, u'name': u'duck eggs'}]}, {u'equipment': [], u'step': u'Cut yolks in half using lightly oiled kitchen shears.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'8', u'number': 3, u'ingredients': []}], u'name': u'For the salted duck egg yolks If using cooked salted duck egg yolks'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Place rice in fine meshed strainer. Rinse under cold running water until water runs clear.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to large bowl and cover completely with cold water. Allow to soak 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain well and transfer to large bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'10', u'number': 4, u'ingredients': []}], u'name': u'For the rice'}], u'winePairing': {}, u'aggregateLikes': 38, u'instructions': u'Procedures                                                                              1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Follow recipe to brine duck eggs. If using cooked salted duck egg yolks, go to step 2.                                                                                                                            2                                                                            Follow recipe to cure pork belly.                                                                                                                            3                                                                            For the joong leaves: Place at least half of the package of joong leaves in a large container and cover completely with cool water.  Soak leaves for twenty-four hours, changing water twice.                                                                                                                            4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Place joong leaves in large stockpot or Dutch oven. Cover with water and place on stove over high heat. Bring to a boil, reduce heat to medium and cook for 30 minutes. Drain leaves and rinse with cold water. Using a vegetable brush, take one leaf and scrub each side and rinse again under running water. Trim off  stem using kitchen shears and discard. Repeat until all the leaves are scrubbed, rinsed and trimmed. Put leave sin colander and set aside.                                                                                                                            5                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 For the lap cheong: Rinse lap cheong under cold running water and drain. Cut each lap cheong in half crosswise. Split each half lengthwise twice into quarters (you should get 8 pieces out of each lap cheong). Set aside.                                                                                                                            6                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 For the the cured pork belly: Rinse pork belly under cold running water to remove excess salt. Pat dry with paper towels and slice into 1/2-inch wide strips lengthwise. Cut each strip into 1-inch pieces. Set aside.                                                                                                                            7                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 For the salted duck egg yolks: If using cooked salted duck egg yolks:  Cut each yolk in half and set aside.  If using raw salted duck egg yolk: Separate whites from yolks. Reserve whites for another use (they will keep for 1 month in the refrigerator). Cut yolks in half using lightly oiled kitchen shears.                                                                                                                            8                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 For the dried shrimp and dried scallops: Place shrimp and scallops in separate small bowls. Wash three times in cold water drain. Cover completely with water and let soak for fifteen minutes. drain and set aside. Shred scallops into strips and set aside.                                                                                                                             9                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 For the rice: Place rice in fine meshed strainer. Rinse under cold running water until water runs clear.  Transfer to large bowl and cover completely with cold water. Allow to soak 15 minutes. Drain well and transfer to large bowl.                                                                                                                            10                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 For the mung bean: Place beans in fine meshed strainer. Rinse under cold running water until water runs clear. Add vegetable oil and salt and mix well. Add mung beans to rice and toss to combine.                                                                                                                            11                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 To Assemble: Take two whole joong leaves of approximately the same size.  Make sure there are no tears or rips in leaves. Leaves should curve in same direction. Take one joong leaf in each hand holding it horizontally in front of you while making sure the ends match each other. Overlap edge of one leaf onto center spine of other leaf. Hold overlapping leaves together with your thumb in the center of the leaves and fold in half.                                                                                                                              12                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Fold bottom half inch of leaf upwards and tuck under thumb to create pocket inside leaves for joong. Hold the folded leaves in one hand and then use the other hand to open the leaves to make the pocket inside.                                                                                                                            13                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Holding leaves firmly, place 3 tablespoons rice mixture in pocket. Add once piece cured pork belly, half an egg yolk, three shrimp, three strands scallops and one piece lap cheong to center of rice. Cover filling with another 3 tablespoons rice.                                                                                                                            14                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Add third joong leaf by wrapping it around top of the two leaves in order to extend the height of the joong. You will be using this leaf to close everything up.Take outer edge of third leaf and fold it towards the center, sealing the joong. The joong should now be sealed at one end and open at the other.                                                                                                                            15                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Smooth out leaves towards open end and then gather all the ends, fold them towards the center and hold down with your thumb. Be firm, but do not rip or tear leaves. If leaves tear, start over. Secure the with kitchen twine by making several loops around joong and securing with knot. Pat finished joong with hands on both sides to compact. Repeat until joong leaves and filling are finished. Excess joong leaves can be dried at room temperature on a wire cooling rack and reused                                                                                                                            16                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Layer finished joong in a large stockpot and cover with water. Place on stove over high heat, cover, and bring to a boil. Reduce heat to medium. Cook for 2 1/2 hours, topping up pot with boiling water to keep joong submerged and rotating joong every hour to promote even cooking.                                                                                                                            17                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Remove joong and drain in colander set in sink. Allow to rest for ten minutes. Cut open parcels and serve immediately with soy sauce.Extra joong can be stored in refrigerator for up to one week or in freezer for several months. To reheat, place in simmering water until heated through.', u'spoonacularSourceUrl': u'https://spoonacular.com/toisan-style-joong-199949', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}