{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587031-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 587031, u'veryPopular': True, u'lowFodmap': True, u'title': u'Strawberry Basil Pretzel Bites with Salami and Parmesan', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 24.39, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'4 large basil leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'12 whole PretzelCrisps Everything Flavor', u'aisle': u'Tea and Coffee', u'name': u'flavor shot', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 10242040, u'unit': u''}, {u'originalString': u'3 tablespoons freshly grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'6 slices dry Italian salami, halved', u'aisle': u'Meat', u'name': u'salami', u'metaInformation': [u'dry', u'italian', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 7071, u'unit': u'slices'}, {u'originalString': u'salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup diced fresh strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.laurenslatest.com/strawberry-basil-pretzel-bites-with-salami-and-parmesan/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, stir strawberries, basil, salt and pepper together gently. Arrange pretzel crisps onto serving platter and top with half a piece of salami. Spoon 1-2 teaspoons of the strawberry mixture overtop the salami and top with a sprinkle of parmesan cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'id': 7071, u'name': u'salami'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 399, u'instructions': u'In a small bowl, stir strawberries, basil, salt and pepper together gently. Arrange pretzel crisps onto serving platter and top with half a piece of salami. Spoon 1-2 teaspoons of the strawberry mixture overtop the salami and top with a sprinkle of parmesan cheese. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-basil-pretzel-bites-with-salami-and-parmesan-587031', u'dishTypes': [u'side dish'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}