{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/419778-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 419778, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon Biscuit Wreath', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 49.49, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 jar (5 ounces) sharp American cheese spread', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 1253, u'unit': u'ounces'}, {u'originalString': u'4 bacon strips, cooked and crumbled', u'aisle': u'Meat', u'name': u'bacon strips', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'1 tube (12 ounces) flaky biscuits', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 18009, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons butter-flavored shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'butter flavored shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 4615, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/bacon-biscuit-wreath', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, melt the cheese spread and shortening; stir until blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into a well-greased 6-cup oven-proof ring mold or 9-in. fluted tube pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each biscuits into quarters and place over cheese mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake at 400\xb0 for 12-14 minutes or until golden brown. Immediately invert pan onto a serving platter and remove. Sprinkle with bacon and parsley.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 31, u'instructions': u'Directions                                                                                In a small saucepan, melt the cheese spread and shortening; stir until blended. Pour into a well-greased 6-cup oven-proof ring mold or 9-in. fluted tube pan. Cut each biscuits into quarters and place over cheese mixture. Bake at 400\xb0 for 12-14 minutes or until golden brown. Immediately invert pan onto a serving platter and remove. Sprinkle with bacon and parsley. Serve warm.                                        Yield: 10 servings.                                                                                                                         Originally published as Bacon Biscuit Wreath in  Quick CookingNovember/December 1998, p40                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-biscuit-wreath-419778', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}