{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/60142-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 255, u'id': 60142, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Boston Cream Pie', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 62.17, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 tub (8 oz.) COOL WHIP FREE Whipped Topping, thawed, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free cool whip', u'metaInformation': [u'divided', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'1 cup cold fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 pkg. (3.4 oz.) JELL-O Vanilla Flavor Instant Pudding', u'aisle': u'Baking', u'name': u'instant vanilla pudding', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19206, u'unit': u'oz'}, {u'originalString': u"2 squares BAKER'S Semi-Sweet Chocolate", u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'squares', u'unitShort': u'squares', u'amount': 2.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'squares'}, {u'originalString': u'9 NABISCO Grahams, coarsely broken', u'aisle': u'?', u'name': u'nabisco grahams', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/easy-boston-cream-pie-115952.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Beat pudding mix and milk with whisk 2 min. Stir in 1-1/2 cups COOL WHIP.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let stand 5 min.  Meanwhile, line 8-inch round pan with plastic wrap.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove 1 Tbsp. graham pieces; set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread half of the remaining graham pieces onto bottom of prepared pan; cover with layers of pudding mixture and remaining grahams.  Refrigerate 4 hours.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Microwave chocolate and 1 cup of the remaining COOL WHIP in microwaveable bowl on HIGH 1 min.; stir until chocolate is melted and mixture is well blended.  Invert dessert onto plate; top with chocolate glaze. Refrigerate 15 min.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with remaining COOL WHIP and reserved graham pieces.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Boston Cream Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Vineyards Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 25 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Beat pudding mix and milk with whisk 2 min. Stir in 1-1/2 cups COOL WHIP.  Let stand 5 min.  Meanwhile, line 8-inch round pan with plastic wrap.  Remove 1 Tbsp. graham pieces; set aside.                                              Spread half of the remaining graham pieces onto bottom of prepared pan; cover with layers of pudding mixture and remaining grahams.  Refrigerate 4 hours.                                            Microwave chocolate and 1 cup of the remaining COOL WHIP in microwaveable bowl on HIGH 1 min.; stir until chocolate is melted and mixture is well blended.  Invert dessert onto plate; top with chocolate glaze. Refrigerate 15 min.  Garnish with remaining COOL WHIP and reserved graham pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-boston-cream-pie-60142', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 270, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}