{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758504-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758504, u'veryPopular': False, u'lowFodmap': False, u'title': u'Parmesan Tasting Platter', u'diets': [], u'pricePerServing': 265.42, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'Aged balsamic vinegar, optional', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'aged balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 1002069, u'unit': u'servings'}, {u'originalString': u'1 cup celery sticks', u'aisle': u'Produce', u'name': u'celery sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'8 dried apricots, halved', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 9032, u'unit': u''}, {u'originalString': u'\xbd cup dried cherries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cherries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93822, u'unit': u'cup'}, {u'originalString': u'6 dried figs, cut into \xbd-inch pieces', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried', u'cut into \xbd-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9094, u'unit': u''}, {u'originalString': u'1 3-oz. box grissini (crispy breadsticks)', u'aisle': u'Savory Snacks', u'name': u'grissini', u'metaInformation': [u'crispy', u'( breadsticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grissini.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 98914, u'unit': u'oz'}, {u'originalString': u'1 cup toasted whole hazelnuts', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'whole', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12120, u'unit': u'cup'}, {u'originalString': u'4 oz. grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'oz'}, {u'originalString': u'8 oz. good-quality Parmesan cheese broken into small chunks', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'oz'}, {u'originalString': u'2 pears, each cored and cut into 8 wedges', u'aisle': u'Produce', u'name': u'pears', u'metaInformation': [u'cored', u'cut into 8 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'\xbd cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'2 medium-tart apples, each cored and cut into 8 wedges', u'aisle': u'Produce', u'name': u'tart apples', u'metaInformation': [u'cored', u'cut into 8 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/parmesan-tasting-platter/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make Crisps: Preheat oven to 325\xb0F, and line baking sheet with silicone baking mat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread tablespoonfuls of grated cheese into thin circles on baking mat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Bake 15 to 18 minutes, or until cheese has stopped bubbling, looks dry, and begins to brown. Cool on baking mat, then remove with spatula.   2. To assemble Platter: Arrange Parmesan Crisps and all other ingredients on large platter. Provide toothpicks, and encourage guests to try chunks of cheese with different items when tasting wine.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 98, u'instructions': u'1. To make Crisps: Preheat oven to 325\xb0F, and line baking sheet with silicone baking mat. Spread tablespoonfuls of grated cheese into thin circles on baking mat. Bake 15 to 18 minutes, or until cheese has stopped bubbling, looks dry, and begins to brown. Cool on baking mat, then remove with spatula.   2. To assemble Platter: Arrange Parmesan Crisps and all other ingredients on large platter. Provide toothpicks, and encourage guests to try chunks of cheese with different items when tasting wine.', u'spoonacularSourceUrl': u'https://spoonacular.com/parmesan-tasting-platter-758504', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}