{u'recipes': [{u'sourceName': u'Bakerette', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/585792-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 585792, u'veryPopular': True, u'lowFodmap': False, u'title': u'Melt-In-Your-Mouth Chocolate Peanut Butter No-Bake Cookies', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 21.14, u'creditText': u'Bakerette', u'extendedIngredients': [{u'originalString': u'1/2 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3 cups QUICK oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'1 cup peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'Waxed paper', u'aisle': u'Ethnic Foods', u'name': u'rice paper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 10118368, u'unit': u'servings'}, {u'originalString': u'1/2 cup skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 to 2 cups sugar, to taste', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/3 cup unsweetened cocoa', u'aisle': u'Baking', u'name': u'unsweetened cocoa', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 39.0, u'sourceUrl': u'http://bakerette.com/chocolate-peanut-butter-no-bake-cookies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan on medium heat melt the butter, then add sugar, cocoa and milk. Turn heat up to medium-high and bring to a boil and boil for 1 1/2 to 4 minutes. (See notes below.)', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the peanut butter and vanilla and stir until the peanut butter is melted and the mixture is smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add the quick oats and stir well.Drop immediately by tablespoonfuls onto a sheet of waxed paper until cool and hardened. For quicker cooling, place in the freezer for 5 minutes or in the refrigerator.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 364, u'instructions': u'In a large saucepan on medium heat melt the butter, then add sugar, cocoa and milk. Turn heat up to medium-high and bring to a boil and boil for 1 1/2 to 4 minutes. (See notes below.)Add the peanut butter and vanilla and stir until the peanut butter is melted and the mixture is smooth. Add the quick oats and stir well.Drop immediately by tablespoonfuls onto a sheet of waxed paper until cool and hardened. For quicker cooling, place in the freezer for 5 minutes or in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/melt-in-your-mouth-chocolate-peanut-butter-no-bake-cookies-585792', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}