{u'recipes': [{u'sourceName': u'Foodista', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/632103-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 632103, u'veryPopular': False, u'lowFodmap': False, u'title': u'Almond Butter Slices', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 48.31, u'creditText': u'Foodista.com – The Cooking Encyclopedia Everyone Can Edit', u'extendedIngredients': [{u'originalString': u'100 grams Almond slices', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12061, u'unit': u'grams'}, {u'originalString': u'15 grams Saffron baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 15.0, u'consistency': u'solid', u'id': 18371, u'unit': u'grams'}, {u'originalString': u'125 grams Kerrygold butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'300 grams German #405 flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'150 grams German Quark (or fromage frais)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'quark', u'metaInformation': [u'(or fromage frais)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 93676, u'unit': u'grams'}, {u'originalString': u'90 ml Safflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'safflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 90.0, u'consistency': u'liquid', u'id': 4511, u'unit': u'ml'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'20 grams Vanilla sugar', u'aisle': u'Baking', u'name': u'vanilla sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 10319335, u'unit': u'grams'}, {u'originalString': u'1/2 cup organic whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.foodista.com/recipe/BVWV7SDX/almond-butter-slices', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'condiment', u'dip', u'spread'], u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat the oven to 180C/350F. Line a 30x40cm baking tray with paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine the sugar, vanilla sugar and almond slices for the topping in a bowl. Set aside.Sift the flour and baking powder into a mixing bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-sugar.jpg', u'id': 10319335, u'name': u'vanilla sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in Quark, milk, oil, sugar and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93676, u'name': u'quark'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Mix all the ingredients with a hand mixer fitted with dough hooks for 1 minute on high speed. Dont over stir the dough or it will become sticky.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place the dough onto the prepared tray and roll it out.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the softened butter all over the surface of the dough. Spead the topping mixture evenly onto the dough.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake on the upper rack of the hot oven for about 20 minutes until golden crispy.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are great choices for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Chateau Ste. Michelle Dry Riesling with a 4.5 out of 5 star rating seems like a good match. It costs about 10 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters.', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'<ol><li>Preheat the oven to 180C/350F. Line a 30x40cm baking tray with paper. Combine the sugar, vanilla sugar and almond slices for the topping in a bowl. Set aside.</li><li>Sift the flour and baking powder into a mixing bowl. Add in Quark, milk, oil, sugar and salt. Mix all the ingredients with a hand mixer fitted with dough hooks for 1 minute on high speed. Dont over stir the dough or it will become sticky.</li><li>Place the dough onto the prepared tray and roll it out. Spread the softened butter all over the surface of the dough. Spead the topping mixture evenly onto the dough. Bake on the upper rack of the hot oven for about 20 minutes until golden crispy.</li></ol>', u'spoonacularSourceUrl': u'https://spoonacular.com/almond-butter-slices-632103', u'license': u'CC BY 3.0', u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}