{u'recipes': [{u'sourceName': u'Homesick Texan', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/667174-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 667174, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shrimp and avocado salad with remoulade dressing', u'diets': [u'gluten free', u'dairy free', u'whole 30', u'pescatarian'], u'pricePerServing': 414.51, u'creditText': u'Homesick Texan', u'extendedIngredients': [{u'originalString': u'2 avocados, peeled, pitted, and diced', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'diced', u'pitted', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'2 celery ribs, finely diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'2 cloves garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons Creole or grainy mustard', u'aisle': u'Condiments', u'name': u'grainy mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoons'}, {u'originalString': u'2 green onions, green part only, finely chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/2 teaspoon prepared horseradish', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002055, u'unit': u'teaspoon'}, {u'originalString': u'1 head ice berg lettuce, cored and chopped', u'aisle': u'Produce', u'name': u'ice-berg lettuce', u'metaInformation': [u'cored', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u'head'}, {u'originalString': u'1 tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'Lemon wedges, for serving', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'3/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped Italian parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon red pepper sauce, such as Tabasco', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'red', u' such as tabasco'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoon'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 pound small shrimp (51-60 count), peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'small', u'deveined', u'peeled', u'(51-60 count)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.homesicktexan.com/2015/06/shrimp-and-avocado-salad-with-remoulade.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'To make the remoulade dressing, whisk together the mayonnaise, mustard, lemon juice, Worcestershire sauce, horseradish, red pepper sauce, garlic, green onion, and parsley. Taste and add salt if needed. To make the shrimp for the salad, bring a 3-quart saucepan filled with water to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the the shrimp and the salt. Cook the shrimp until pink, about 2 minutes, then drain and rinse with cold water. To assemble the salad, in a large mixing bowl, toss the cooked shrimp with the lettuce, celery, and avocado. You can either serve the salad dressed by adding the remoulade to the mixing bowl and tossing, or you can evenly divide the salad onto 4 plates or into 4 bowls, and serve with the dressing on the side. I also like to serve the salad with lemon wedges for an added bit of brightness.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Tramin Pinot Grigio. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Bright yellow in color with coppery reflections and clear fruit aromas of pear, citrus, honeysuckle, tropical fruits and light spices. Firm, velvety and rich on the palate, with well-integrated acidity. A very round and satisfying wine. Recommended with fish antipasti, risotto with asparagus, omelets and pasta', u'title': u'Tramin Pinot Grigio', u'price': u'$18.29', u'id': 448227, u'link': u'https://www.wine.com/product/tramin-pinot-grigio-2009/106454', u'imageUrl': u'https://spoonacular.com/productImages/448227-312x231.jpg'}]}, u'aggregateLikes': 1820, u'instructions': u'To make the remoulade dressing, whisk together the mayonnaise, mustard, lemon juice, Worcestershire sauce, horseradish, red pepper sauce, garlic, green onion, and parsley. Taste and add salt if needed. To make the shrimp for the salad, bring a 3-quart saucepan filled with water to a boil. Add the the shrimp and the salt. Cook the shrimp until pink, about 2 minutes, then drain and rinse with cold water. To assemble the salad, in a large mixing bowl, toss the cooked shrimp with the lettuce, celery, and avocado. You can either serve the salad dressed by adding the remoulade to the mixing bowl and tossing, or you can evenly divide the salad onto 4 plates or into 4 bowls, and serve with the dressing on the side. I also like to serve the salad with lemon wedges for an added bit of brightness.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-and-avocado-salad-with-remoulade-dressing-667174', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}