{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/761951-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 761951, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sesame Noodle Salad with Asparagus and Tofu', u'diets': [u'dairy free'], u'pricePerServing': 162.42, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'Sesame Dressing (click for link)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'asian toasted sesame dressing', u'metaInformation': [u'for link)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-toasted-sesame-dressing.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4016, u'unit': u'servings'}, {u'originalString': u'1 lb. asparagus, tough ends trimmed, cut into 2-inch lengths', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed', u'cut into 2-inch lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'lb'}, {u'originalString': u'2 tsp. Bragg Liquid Aminos', u'aisle': u'Health Foods;Condiments', u'name': u"bragg's liquid aminos", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 93767, u'unit': u'tsp'}, {u'originalString': u'1/3 to \xbd cup chopped fresh cilantro', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 18139, u'unit': u''}, {u'originalString': u'1 English cucumber, peeled and julienned', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'julienned', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111205, u'unit': u''}, {u'originalString': u'6 oz. dried vermicelli', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice vermicelli', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 20133, u'unit': u'oz'}, {u'originalString': u'1 \xbd Tbs. sesame oil or other mild-flavored oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 1.5, u'consistency': u'liquid', u'id': 4058, u'unit': u'Tbs'}, {u'originalString': u'2 cups well-drained diced firm tofu (13 oz.)', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'diced', u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.0, u'consistency': u'solid', u'id': 16162, u'unit': u'oz'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/sesame-noodle-salad-with-asparagus-and-tofu/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring large pot of lightly salted water to a boil for vermicelli. Meanwhile, in large skillet, heat sesame oil over medium-high heat. Stir in asafetida if desired and tofu. Sprinkle with liquid aminos and cook, stirring often, until tofu is golden-brown, about 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Add asparagus, sprinkle lightly with salt, cover and cook until crisp-tender, 3 to 4 minutes. Immediately remove from heat; set aside.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Add vermicelli to boiling water; stir to prevent sticking. Cook until just tender, about 6 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drain, rinse under cold running water and drain well.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer noodles to large bowl; add half of the Sesame Dressing and season with salt and freshly ground pepper to taste. Toss well. Spoon asparagus-tofu mixture on top, sprinkle with cucumber and drizzle with some remaining Sesame Dressing. Sprinkle with cilantro and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Bring large pot of lightly salted water to a boil for vermicelli. Meanwhile, in large skillet, heat sesame oil over medium-high heat. Stir in asafetida if desired and tofu. Sprinkle with liquid aminos and cook, stirring often, until tofu is golden-brown, about 7 minutes.Add asparagus, sprinkle lightly with salt, cover and cook until crisp-tender, 3 to 4 minutes. Immediately remove from heat; set aside.Add vermicelli to boiling water; stir to prevent sticking. Cook until just tender, about 6 minutes. Drain, rinse under cold running water and drain well. Transfer noodles to large bowl; add half of the Sesame Dressing and season with salt and freshly ground pepper to taste. Toss well. Spoon asparagus-tofu mixture on top, sprinkle with cucumber and drizzle with some remaining Sesame Dressing. Sprinkle with cilantro and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/sesame-noodle-salad-with-asparagus-and-tofu-761951', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}