{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/435359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 435359, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pesto Chicken Pasta', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 67.08, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 cup cubed cooked chicken', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cubed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cup'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1-1/2 cups 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'8 ounces uncooked ziti or uncooked small tube pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'small', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'ounces'}, {u'originalString': u'1 cup frozen peas and carrots', u'aisle': u'Canned and Jarred;Frozen', u'name': u'peas and carrots', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas-and-carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11322, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 envelope pesto sauce mix', u'aisle': u'Pasta and Rice', u'name': u'pesto sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 93698, u'unit': u'envelope'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pesto-chicken-pasta', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Cook pasta according to package directions; add peas and carrots during the last 2 minutes of cooking. Meanwhile, in a small saucepan, whisk the pesto mix, cornstarch and milk until smooth.  Bring to a boil; cook and stir for 2 minutes or until thickened.  Stir in the chicken, salt and pepper.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas-and-carrots.jpg', u'id': 11322, u'name': u'peas and carrots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain pasta mixture; place in a large serving bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the chicken mixture; toss to coat. Sprinkle with walnuts.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 53, u'instructions': u'Directions                                                                                Cook pasta according to package directions; add peas and carrots during the last 2 minutes of cooking. Meanwhile, in a small saucepan, whisk the pesto mix, cornstarch and milk until smooth.  Bring to a boil; cook and stir for 2 minutes or until thickened.  Stir in the chicken, salt and pepper.                                                                                           Drain pasta mixture; place in a large serving bowl. Add the chicken mixture; toss to coat. Sprinkle with walnuts.                                        Yield: 4 servings.                                                                                                                         Originally published as Pesto Chicken Pesto in  Quick CookingJuly/August 2004, p43                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/pesto-chicken-pasta-435359', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}