{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/725081-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 725081, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Babka', u'diets': [], u'pricePerServing': 75.39, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'1 \xbc-ounce envelope active dry yeast (about 2\xbc teaspoons)', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'3 ounces bittersweet chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 large egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 cups all-purpose flour, plus more for surface', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'plus more for surface'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'5 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup granulated sugar, plus more', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'plus more'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 tablespoons granulated sugar, divided', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'\xbe teaspoon ground cinnamon, divided', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoon'}, {u'originalString': u'\xbc teaspoon kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons unsalted butter, melted, divided, plus more room temperature for pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'divided', u'melted', u'plus more room temperature for pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'7 tablespoons unsalted butter, room temperature, cut into pieces, plus more for bowl', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'plus more for bowl', u'cut into pieces, ', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup whole milk, warmed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.bonappetit.com/recipe/chocolate-babka', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour milk into a measuring glass or small bowl; sprinkle yeast and a pinch of granulated sugar over milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let stand until foamy, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk egg, egg yolk, and remaining  cup granulated sugar in a medium bowl until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in yeast mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine salt and 2 cups flour in the bowl of an electric mixer fitted with the paddle attachment.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add egg mixture and beat on low speed until nearly incorporated, about 30 seconds. Switch to dough hook and add 7 Tbsp. butter; beat on medium-low until butter is completely incorporated and dough is smooth and just slightly sticky, 810 minutes.Turn out dough onto a lightly floured surface and knead a few times until very smooth (dough will still be wet and a little sticky).', u'length': {u'number': 810, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to a large buttered bowl. Cover with plastic wrap and let rise in a warm place until doubled in size, 12 hours, then chill 45 minutes.Preheat oven to 350. Generously butter a 8x4" loaf pan.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat chocolate, cocoa, 2 Tbsp. butter, 1 Tbsp. granulated sugar,  tsp. cinnamon, and  tsp. salt in a heatproof bowl set over a saucepan of simmering water, stirring occasionally, until chocolate and butter are melted and mixture is smooth. (Alternatively, microwave on medium power 1 minute, stirring halfway through.)Turn out chilled dough onto a clean lightly floured surface.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Roll out to a 22x12" rectangle and orient so a long side is facing you. Using an offset spatula, spread chocolate filling over dough to extend to the edges.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}], u'step': u'Roll up dough away from you like a jelly roll, pulling lightly on it as you roll to maintain thickness. (Use a metal bench scraper if needed to help dough release from surface.)', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Cut log in half crosswise. Set halves so they are side by side and touching. A long side should still be facing you.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Place one half over the other to make an X, then twist the two ends on one side twice. Repeat on opposite side. (You should have a total of 4 twists.)', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer bread to pan, cover with plastic wrap, and let rise 30 minutes.Meanwhile, make the streusel.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk brown sugar and remaining 1 Tbsp. granulated sugar,  tsp. cinnamon, and  tsp. salt in medium bowl to blend.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in remaining 2 Tbsp. butter.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Add flour and toss with a fork until moist clumps form (streusel will look slightly wet).', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk egg and cream in a small bowl and brush egg wash over loaf. Scatter streusel over top.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake babka, rotating pan halfway through, until golden brown, 5060 minutes.', u'length': {u'number': 5060, u'unit': u'minutes'}, u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer pan to a wire rack and let babka cool in pan 15 minutes, then turn out onto rack, running a paring knife around edges to help loosen if needed.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool completely before slicing.', u'number': 20, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Babka. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 5058, u'instructions': u'Pour milk into a measuring glass or small bowl; sprinkle yeast and a pinch of granulated sugar over milk. Let stand until foamy, about 5 minutes. Whisk egg, egg yolk, and remaining  cup granulated sugar in a medium bowl until smooth. Whisk in yeast mixture.Combine salt and 2 cups flour in the bowl of an electric mixer fitted with the paddle attachment. Add egg mixture and beat on low speed until nearly incorporated, about 30 seconds. Switch to dough hook and add 7 Tbsp. butter; beat on medium-low until butter is completely incorporated and dough is smooth and just slightly sticky, 810 minutes.Turn out dough onto a lightly floured surface and knead a few times until very smooth (dough will still be wet and a little sticky). Transfer to a large buttered bowl. Cover with plastic wrap and let rise in a warm place until doubled in size, 12 hours, then chill 45 minutes.Preheat oven to 350. Generously butter a 8x4" loaf pan. Heat chocolate, cocoa, 2 Tbsp. butter, 1 Tbsp. granulated sugar,  tsp. cinnamon, and  tsp. salt in a heatproof bowl set over a saucepan of simmering water, stirring occasionally, until chocolate and butter are melted and mixture is smooth. (Alternatively, microwave on medium power 1 minute, stirring halfway through.)Turn out chilled dough onto a clean lightly floured surface. Roll out to a 22x12" rectangle and orient so a long side is facing you. Using an offset spatula, spread chocolate filling over dough to extend to the edges. Roll up dough away from you like a jelly roll, pulling lightly on it as you roll to maintain thickness. (Use a metal bench scraper if needed to help dough release from surface.) Cut log in half crosswise. Set halves so they are side by side and touching. A long side should still be facing you. Place one half over the other to make an X, then twist the two ends on one side twice. Repeat on opposite side. (You should have a total of 4 twists.) Transfer bread to pan, cover with plastic wrap, and let rise 30 minutes.Meanwhile, make the streusel. Whisk brown sugar and remaining 1 Tbsp. granulated sugar,  tsp. cinnamon, and  tsp. salt in medium bowl to blend. Mix in remaining 2 Tbsp. butter. Add flour and toss with a fork until moist clumps form (streusel will look slightly wet). Whisk egg and cream in a small bowl and brush egg wash over loaf. Scatter streusel over top.Bake babka, rotating pan halfway through, until golden brown, 5060 minutes. Transfer pan to a wire rack and let babka cool in pan 15 minutes, then turn out onto rack, running a paring knife around edges to help loosen if needed. Let cool completely before slicing.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-babka-725081', u'dishTypes': [u'dessert'], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}