{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/519222-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 519222, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cordon Bleu Bubble Up', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 220.31, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'1 lb jar Alfredo Sauce', u'aisle': u'Pasta and Rice', u'name': u'alfredo sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93606, u'unit': u'lb'}, {u'originalString': u'2 cans Grands Biscuits', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 18009, u'unit': u'cans'}, {u'originalString': u'1/2 lb deli ham, shredded', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10010151, u'unit': u'lb'}, {u'originalString': u'1/2 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062047, u'unit': u'tsp'}, {u'originalString': u'1/2 lb chicken, cooked and shredded', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 5348, u'unit': u'lb'}, {u'originalString': u'2 c. Swiss Cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1040, u'unit': u'c'}], u'healthScore': 17.0, u'imageType': u'png', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/2013/10/cordon-bleu-bubble-up/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut each biscuit into 6 pieces and place in bowl. Toss biscuits with Alfredo sauce, garlic powder, and garlic salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'id': 93606, u'name': u'alfredo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken, ham and 1 c. Swiss cheese. Toss until well blended.Spray a 9 in x 13 in pan with non-stick cooking spray.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour biscuit mixture into the pan and top with remaining cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [], u'step': u'Bake at 375 degrees for 30 to 35 minutes or until biscuits are done.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Riesling, Sparkling Wine, and Zinfandel are great choices for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Columbia Winery Cellarmaster's Riesling with a 4.7 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 16386, u'instructions': u'Preheat oven to 375 degrees.Cut each biscuit into 6 pieces and place in bowl. Toss biscuits with Alfredo sauce, garlic powder, and garlic salt. Add chicken, ham and 1 c. Swiss cheese. Toss until well blended.Spray a 9 in x 13 in pan with non-stick cooking spray. Pour biscuit mixture into the pan and top with remaining cheese. Bake at 375 degrees for 30 to 35 minutes or until biscuits are done.', u'spoonacularSourceUrl': u'https://spoonacular.com/cordon-bleu-bubble-up-519222', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}