{u'recipes': [{u'sourceName': u'Food Faith Fitness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/616434-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 616434, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Rice with Roasted Pumpkin, Harissa and Goat Cheese {Gluten Free, + Vegetarian}', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 191.26, u'creditText': u'Food Faith Fitness', u'extendedIngredients': [{u'originalString': u'1 cup Uncooked, Black rice', u'aisle': u'Pasta and Rice', u'name': u'black rice', u'metaInformation': [u'black', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-rice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020036, u'unit': u'cup'}, {u'originalString': u'\xbd Cup Cilantro, roughly chopped (or to taste)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'roughly chopped', u'to taste', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'Cup'}, {u'originalString': u'1 Tbsp Cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'Tbsp'}, {u'originalString': u'\xbd Tsp Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tsps', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'Tsp'}, {u'originalString': u'2 Oz Goat cheese, crumbled', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1159, u'unit': u'Oz'}, {u'originalString': u'1 Tbsp Harissa', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'Tbsp'}, {u'originalString': u'Additional Harissa, for garnish', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'servings'}, {u'originalString': u'\xbd tsp Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'\xbc Cup Pepitas', u'aisle': u'Savory Snacks', u'name': u'pepitas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10012014, u'unit': u'Cup'}, {u'originalString': u'4 cups Peeled Pumpkin, chopped into \xbe inch cubes (about 1 small pie pumpkin)', u'aisle': u'Produce', u'name': u'pumpkin', u'metaInformation': [u'small', u'peeled', u'chopped', u'( 1 pie pumpkin)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11422, u'unit': u'cups'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.foodfaithfitness.com/black-rice-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Begin by combining the water are the black rice in a large sauce pan with a pinch of salt. Bring to a boil and then turn down to low, cover, and simmer until all the water is absorbed, about 1 hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-rice.jpg', u'id': 10020036, u'name': u'black rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Let stand for 15 minutes, without stirring, and then gently fluffy with a fork.While the rice cooks, preheat your oven to 400 degrees.In a large bowl, toss together the pumpkin cubes, 2 tbsp olive oil, and 1 Tbsp of garlic.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Mix until the pumpkin is evenly coated and then place the cubes onto a baking sheet. Sprinkle with salt and roast until fork tender, about 10-15 mins.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Combine the pepitas and olive oil in a small bowl and spread out onto a small baking tray. Sprinkle with salt and place into the oven during the last 5 minutes that the pumpkin cooks, so that they are lightly toasted.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the cumin seeds in a small, dry pan set on high heat and toast, stirring constantly until lightly golden brown and fragrant, just a minute or so.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer them to a chopped board and crush them using the underside of a glass cup. You can also use a spice grinder if you want them really fine. Toss the crushed cumin seeds into the cooked rice and stir so that it gets evenly distributed throughout the rice.Divide the cooked rice between 4 bowls. The divide the pumpkin, pepitas, chopped cilantro and crumbled goat cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}]}, {u'equipment': [], u'step': u'Garnish with additional Harissa and salt (if needed) and DEVOUR!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'id': 1006972, u'name': u'harissa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 252, u'instructions': u'Begin by combining the water are the black rice in a large sauce pan with a pinch of salt. Bring to a boil and then turn down to low, cover, and simmer until all the water is absorbed, about 1 hour. Let stand for 15 minutes, without stirring, and then gently fluffy with a fork.While the rice cooks, preheat your oven to 400 degrees.In a large bowl, toss together the pumpkin cubes, 2 tbsp olive oil, and 1 Tbsp of garlic. Mix until the pumpkin is evenly coated and then place the cubes onto a baking sheet. Sprinkle with salt and roast until fork tender, about 10-15 mins.Combine the pepitas and olive oil in a small bowl and spread out onto a small baking tray. Sprinkle with salt and place into the oven during the last 5 minutes that the pumpkin cooks, so that they are lightly toasted.Place the cumin seeds in a small, dry pan set on high heat and toast, stirring constantly until lightly golden brown and fragrant, just a minute or so. Transfer them to a chopped board and crush them using the underside of a glass cup. You can also use a spice grinder if you want them really fine. Toss the crushed cumin seeds into the cooked rice and stir so that it gets evenly distributed throughout the rice.Divide the cooked rice between 4 bowls. The divide the pumpkin, pepitas, chopped cilantro and crumbled goat cheese. Garnish with additional Harissa and salt (if needed) and DEVOUR!', u'spoonacularSourceUrl': u'https://spoonacular.com/black-rice-with-roasted-pumpkin-harissa-and-goat-cheese-gluten-free-+-vegetarian-616434', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}