{u'recipes': [{u'sourceName': u'My Baking Heart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508468-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 508468, u'veryPopular': False, u'lowFodmap': False, u'title': u'Poppy Seed Poundcake Muffins', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 69.96, u'creditText': u'My Baking Heart', u'extendedIngredients': [{u'originalString': u'1/2 t baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u't'}, {u'originalString': u'2 lg eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 c all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'1/4 tsp Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 tbsp poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'tbsp'}, {u'originalString': u'1/2 c Splenda for Baking', u'aisle': u'Baking', u'name': u'splenda', u'metaInformation': [u'for baking'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/splenda.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019868, u'unit': u'c'}, {u'originalString': u'1/2 c unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'c'}, {u'originalString': u'1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 c plain yogurt or fat-free sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'plain', u'fat-free', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'c'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://mybakingheart.com/2012/05/21/poppy-seed-poundcake-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place rack in center of oven and preheat to 400 degrees F. Line a 12 cup muffin pan with paper liners or spray each muffin cup with a non-stick vegetable spray. In a bowl, whisk the flour with the poppy seeds, salt, and baking soda.In the bowl of your electric mixer, or with a hand mixer, beat the butter and Splenda for Baking until light and fluffy. Beat in the eggs, one at a time, mixing well after each addition. Scrape down the sides of the bowl as needed. Beat in the yogurt (or sour cream) and vanilla extract until well blended. Stir in the flour mixture just until moistened. Do not over mix. Spoon the batter into the muffin cups using two spoons or an ice cream scoop.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/splenda.png', u'id': 10019868, u'name': u'splenda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for about 18 to 20 minutes or until a toothpick inserted in the center of a muffin comes out clean.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven and place on a wire rack to cool for about five minutes before removing muffins from the pan.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 62, u'instructions': u'Place rack in center of oven and preheat to 400 degrees F. Line a 12 cup muffin pan with paper liners or spray each muffin cup with a non-stick vegetable spray. In a bowl, whisk the flour with the poppy seeds, salt, and baking soda.In the bowl of your electric mixer, or with a hand mixer, beat the butter and Splenda for Baking until light and fluffy. Beat in the eggs, one at a time, mixing well after each addition. Scrape down the sides of the bowl as needed. Beat in the yogurt (or sour cream) and vanilla extract until well blended. Stir in the flour mixture just until moistened. Do not over mix. Spoon the batter into the muffin cups using two spoons or an ice cream scoop. Bake for about 18 to 20 minutes or until a toothpick inserted in the center of a muffin comes out clean. Remove from oven and place on a wire rack to cool for about five minutes before removing muffins from the pan.', u'spoonacularSourceUrl': u'https://spoonacular.com/poppy-seed-poundcake-muffins-508468', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}