{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/472357-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 472357, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Pot Pie III', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 76.18, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 (10.75 ounce) can condensed cream of celery soup', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of celery soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-celery-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6010, u'unit': u'ounce'}, {u'originalString': u'1 (10.75 ounce) can condensed cream of potato soup', u'aisle': u'Canned and Jarred', u'name': u'cream of potato soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6053, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'2 cups frozen mixed vegetables', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'mixed', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11583, u'unit': u'cups'}, {u'originalString': u'2 boneless, skinless chicken breast halves, boiled', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast halves', u'metaInformation': [u'boneless', u'skinless', u'boiled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1045062, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Chicken-Pot-Pie-III/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F (200 degrees C). Line a 9 inch pie dish with pastry.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Blanch frozen mixed vegetables for 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'id': 11583, u'name': u'mixed vegetables'}]}, {u'equipment': [], u'step': u'Drain.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Dice chicken and place in a large bowl.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add vegetables, thyme, celery soup and potato soup. Stir together.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Pour filling into pastry lined pie dish. Arrange top layer of pie crust, seal and flute the edges.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut slits in the top of the crust to allow for steam to escape.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place pie on cookie sheet. Put aluminum foil around the pie crust edges.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 400 degrees F (200 degrees C) for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil and continue to bake for an additional 30 minutes until golden brown.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and let stand for 5 minutes and then serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 203, u'instructions': u'Preheat oven to 400 degrees F (200 degrees C). Line a 9 inch pie dish with pastry.                            Blanch frozen mixed vegetables for 3 to 4 minutes. Drain.                            Dice chicken and place in a large bowl.  Add vegetables, thyme, celery soup and potato soup. Stir together.                            Pour filling into pastry lined pie dish. Arrange top layer of pie crust, seal and flute the edges. Cut slits in the top of the crust to allow for steam to escape.                            Place pie on cookie sheet. Put aluminum foil around the pie crust edges. Bake at 400 degrees F (200 degrees C) for 30 minutes.  Remove foil and continue to bake for an additional 30 minutes until golden brown. Remove from oven and let stand for 5 minutes and then serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-pot-pie-iii-472357', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}