{u'recipes': [{u'sourceName': u'Minimalist Baker', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/668033-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 668033, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Chia Watermelon Smoothie', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 494.55, u'creditText': u'Minimalist Baker', u'extendedIngredients': [{u'originalString': u'1/2 - 3/4 cup (120-180 ml) unsweetened plain almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'plain', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 120.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'ml'}, {u'originalString': u'1/2 ripe banana (50 g), previously peeled, chopped and frozen', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen', u'ripe', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 9040, u'unit': u'g'}, {u'originalString': u'1 Tbsp chia or hemp seeds (optional)', u'aisle': u'Health Foods', u'name': u'hemp seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93602, u'unit': u'Tbsp'}, {u'originalString': u'1 lime, juiced ( - 30 ml)', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 30.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 cup (120 g) frozen strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 120.0, u'consistency': u'solid', u'id': 9316, u'unit': u'g'}, {u'originalString': u'1 1/2 cups (240 g) fresh watermelon, cubed (black seeds removed)', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [u'fresh', u'black', u'seeds removed)', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 240.0, u'consistency': u'solid', u'id': 9326, u'unit': u'g'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://minimalistbaker.com/strawberry-chia-watermelon-smoothie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add all ingredients to a blender and blend until creamy and smooth, adding more almond milk to thin, or more frozen strawberries or ice to thicken.Taste and adjust seasonings as needed, adding more lime for acidity, banana for sweetness, or watermelon for a more intense watermelon flavor.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Serves 2 - top with additional chia seeds to mock watermelon seeds! Best when fresh, though leftovers keep covered in the refrigerator for 1-2 days.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Dutton-Goldfield Dutton Ranch Pinot Noir. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 43 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The ripening season was classic Russian River, with warm days and cool nights—and with no major heat spells, the fruit ripening was perfect to give lush tannins, bright berry fruit and bright acidity. The wine shows rich, dense black cherry and blackberry fruit and nuances of strawberry, raspberry, and nutmeg in the nose. In the mouth, the first impression is fresh berry fruit, then the soft, broad tannins carry notes of marionberries, nutmeg and sandalwood through a lingering finish. Thanks partially to the moderate alcohol and bright acidity, the finish lingers with fresh cherry fruit and creamy berry compote.This wine has a broad range of food pairings, whether alone with some well chosen cheeses, richer fish preparations or a good old steak on the barbeque. View More', u'title': u'Dutton-Goldfield Dutton Ranch Pinot Noir', u'price': u'$42.99', u'id': 438099, u'link': u'https://www.wine.com/product/dutton-goldfield-dutton-ranch-pinot-noir-2014/154141', u'imageUrl': u'https://spoonacular.com/productImages/438099-312x231.jpg'}]}, u'aggregateLikes': 5066, u'instructions': u'Add all ingredients to a blender and blend until creamy and smooth, adding more almond milk to thin, or more frozen strawberries or ice to thicken.Taste and adjust seasonings as needed, adding more lime for acidity, banana for sweetness, or watermelon for a more intense watermelon flavor.Serves 2 - top with additional chia seeds to mock watermelon seeds! Best when fresh, though leftovers keep covered in the refrigerator for 1-2 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-chia-watermelon-smoothie-668033', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [u"mother's day", u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}