{u'recipes': [{u'sourceName': u'Steamy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/602228-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 602228, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baby Artichokes with Garlic and Tomatoes', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 195.82, u'creditText': u'Steamy Kitchen', u'extendedIngredients': [{u'originalString': u'1 pound baby artichokes', u'aisle': u'Produce', u'name': u'baby artichokes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93631, u'unit': u'pound'}, {u'originalString': u'2 tablespoons minced fresh parsley (or other fresh herb like basil)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced', u'(or other herb like basil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2-3 garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1-2 tomatoes, roughly chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1/4 cup vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'1/4 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.steamykitchen.com/15471-baby-artichokes-with-garlic-and-tomatoes.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Fill a large bowl with cool water, Take just one of the lemon halves (you\'ll cook with the other half) and squeeze the juice into the water. Go ahead and throw in the spent lemon into the water too.2. Prepare the artichokes by cutting off  and discarding the top 1/2" of the artichoke. Peel away the first couple of dark green layers of the artichoke leaves until you reach pale, smooth, light green leaves. Slice the artichoke into 1/4" slices.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/salad-spinner.jpg', u'id': 404792, u'name': u'salad spinner'}], u'step': u"Place slices into the lemon-water. Repeat with remaining artichokes. You can do this step ahead of time and refrigerate until ready.3. Just before you're ready to cook, place the artichokes into a salad spinner and remove all of the water (or you could pat very dry with towels.)4.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u"Heat a large saute pan (I prefer a wok) over medium-high heat. Swirl in the olive oil. When hot, add the artichoke slices. Try not to overlap the slices - spread them out all over the pan. You may want to cook this in two batches if your pan isn't large enough. Cook for 2 minutes and them toss to flip. The artichokes should be nicely browned.If you're cooking in two batches, go ahead and dish out the cooked artichoke and brown the second batch. When second batch is done, add the first batch back in the pan.5.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add in the garlic slices and saute until fragrant, tossing frequently.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add in the tomatoes, season with salt and pepper. Give it another good toss.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Pour in the wine, broth and squeeze in the juice of the remaining lemon half. 6. Bring to simmer, cover, reduce heat to medium-low and cook for 5 minutes. Give it a taste - adjust with salt and pepper if needed. Is the artichoke tender? If not, cover and cook for another minute. Finish with fresh parsley.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 34, u'instructions': u'1. Fill a large bowl with cool water, Take just one of the lemon halves (you\'ll cook with the other half) and squeeze the juice into the water. Go ahead and throw in the spent lemon into the water too.2. Prepare the artichokes by cutting off  and discarding the top 1/2" of the artichoke. Peel away the first couple of dark green layers of the artichoke leaves until you reach pale, smooth, light green leaves. Slice the artichoke into 1/4" slices. Place slices into the lemon-water. Repeat with remaining artichokes. You can do this step ahead of time and refrigerate until ready.3. Just before you\'re ready to cook, place the artichokes into a salad spinner and remove all of the water (or you could pat very dry with towels.)4. Heat a large saute pan (I prefer a wok) over medium-high heat. Swirl in the olive oil. When hot, add the artichoke slices. Try not to overlap the slices - spread them out all over the pan. You may want to cook this in two batches if your pan isn\'t large enough. Cook for 2 minutes and them toss to flip. The artichokes should be nicely browned.If you\'re cooking in two batches, go ahead and dish out the cooked artichoke and brown the second batch. When second batch is done, add the first batch back in the pan.5. Add in the garlic slices and saute until fragrant, tossing frequently. Add in the tomatoes, season with salt and pepper. Give it another good toss. Pour in the wine, broth and squeeze in the juice of the remaining lemon half. 6. Bring to simmer, cover, reduce heat to medium-low and cook for 5 minutes. Give it a taste - adjust with salt and pepper if needed. Is the artichoke tender? If not, cover and cook for another minute. Finish with fresh parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/baby-artichokes-with-garlic-and-tomatoes-602228', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}