{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/470730-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 470730, u'veryPopular': False, u'lowFodmap': False, u'title': u'Garlic Alfredo Tilapia', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 378.34, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 cup Alfredo sauce', u'aisle': u'Pasta and Rice', u'name': u'alfredo sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93606, u'unit': u'cup'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon Creole seasoning, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'creole seasoning', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002031, u'unit': u'tablespoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'4 tilapia fillets', u'aisle': u'Seafood', u'name': u'tilapia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 15261, u'unit': u'fillet'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Garlic-Alfredo-Tilapia/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat an oven to 425 degrees F (220 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Brush the tilapia fillets with oil on both sides, season with Creole seasoning to taste, then place into a 9x13-inch baking dish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1002031, u'name': u'creole seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'id': 15261, u'name': u'tilapia fillets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the preheated oven until the flesh is no longer translucent, and the fish flakes easily with a fork, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Meanwhile, melt the butter in a small saucepan over medium heat. Stir in the garlic, and cook until the garlic has softened and the aroma has mellowed, about 2 minutes. Stir in the Alfredo sauce and bring to a simmer. Reduce the heat to low, and keep warm until the fish is ready.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'id': 93606, u'name': u'alfredo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Pour the sauce over the fish to serve. Sprinkle with additional Creole seasoning if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1002031, u'name': u'creole seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}], u'name': u''}], u'aggregateLikes': 209, u'instructions': u'Preheat an oven to 425 degrees F (220 degrees C).                            Brush the tilapia fillets with oil on both sides, season with Creole seasoning to taste, then place into a 9x13-inch baking dish.                            Bake in the preheated oven until the flesh is no longer translucent, and the fish flakes easily with a fork, about 10 minutes.                            Meanwhile, melt the butter in a small saucepan over medium heat. Stir in the garlic, and cook until the garlic has softened and the aroma has mellowed, about 2 minutes. Stir in the Alfredo sauce and bring to a simmer. Reduce the heat to low, and keep warm until the fish is ready. Pour the sauce over the fish to serve. Sprinkle with additional Creole seasoning if desired.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-alfredo-tilapia-470730', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}