{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225580-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 225580, u'veryPopular': False, u'lowFodmap': True, u'title': u'All-in-one gammon, egg & chips', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 313.33, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 large baking potato, unpeeled, cut into chunky chips', u'aisle': u'Produce', u'name': u'baking potato', u'metaInformation': [u'large', u'unpeeled', u'cut into chunky chips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 small gammon steak', u'aisle': u'Meat', u'name': u'gammon steak', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-steak.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 10149, u'unit': u''}, {u'originalString': u'ketchup, to serve', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'serving'}, {u'originalString': u'1 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1267635/allinone-gammon-egg-and-chips', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the potatoes with the oil andsome salt and pepper.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake on aroasting tray for 25 mins, until startingto go brown.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove and turn the chips. Pushto edges of the tray, put the gammonin the centre and cook for 7 mins more.Take the tray out of the oven and turnthe gammon over, then crack the egginto the corner of the tray. Cook for7 mins more until the egg is set andthe gammon is cooked through.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Servewith ketchup, if you like.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 22, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Drizzle the potatoes with the oil andsome salt and pepper. Bake on aroasting tray for 25 mins, until startingto go brown.Remove and turn the chips. Pushto edges of the tray, put the gammonin the centre and cook for 7 mins more.Take the tray out of the oven and turnthe gammon over, then crack the egginto the corner of the tray. Cook for7 mins more until the egg is set andthe gammon is cooked through. Servewith ketchup, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/all-in-one-gammon-egg-chips-225580', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}