{u'recipes': [{u'sourceName': u'China Sichuan Food', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/610529-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 610529, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chinese Vegan PotStickers', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 27.97, u'creditText': u'China Sichuan Food', u'extendedIngredients': [{u'originalString': u'1/2 cup chopped coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'cup'}, {u'originalString': u'1 middle size eggplants, peeled and cut into small cubes', u'aisle': u'Produce', u'name': u'eggplants', u'metaInformation': [u'small', u'peeled', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'1 teaspoon Chinese five spice powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'five spice powder', u'metaInformation': [u'chinese'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chinese-five-spice-powder.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002002, u'unit': u'teaspoon'}, {u'originalString': u'1 garlic clove, mashed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup chopped green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 tablespoon light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tablespoon'}, {u'originalString': u'1 small bunch of mung bean noodles, soak in warm water for around 15 minutes and then cut into small sections', u'aisle': u'Produce;Ethnic Foods', u'name': u'mung bean sprouts', u'metaInformation': [u'small', u'for around 15 minutes and then cut into  sections'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11043, u'unit': u'bunch'}, {u'originalString': u'1/2 cup chopped shitake mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt or more to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon vegetable cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'1 package of wrappers (around 50)', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'(around 50)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'package'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.chinasichuanfood.com/chinese-vegan-potstickers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Peel the eggplants, cut into small cubes and then soak the cubes in salted water for around 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Transfer out and drain. This will help to reduce the oil absorbed by the eggplants in stir-fry process. In a sauce pan, heat up around 1/2 tablespoon of vegetable cooking oil and then stir fry eggplants with mashed garlic until soft.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer out. In a large bowl, mix stir-fried eggplants, mung bean sections, coriander, green onion and shitake mushroom with salt, light soy sauce and Chinese five spice powder. Assemble the potstickers one by one.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chinese-five-spice-powder.png', u'id': 1002002, u'name': u'chinese five spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10216124, u'name': u'light soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush some oil on a pan; lay the potstickers and saut with medium fire until golden brown. In order to make sure the potstickers are cooked toughly, I would suggest pouring around 1 tablespoon warm water after saut the bottom side to golden brown. The theory is to steam other parts of the potstickers with vapour. Turn the potstickers over from time to time.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Transfer out when the water added are evaporated and potstickers become crispy again.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve immediately or with chili sauce you prefer.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Dry Creek Vineyard Dry Chenin Blanc, Wine with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This beautiful wine is wonderfully consistent vintage after vintage. We receive superior Chenin Blanc fruit from the Wilson Ranch in Clarksburg, allowing us to produce an expressive, nuanced and delicious wine. At first swirl, aromatics of white pear, pineapple and banana spring forward from the glass. On the palate, the wine is refreshing with flavors of ripe tangerine and peaches. The mouthfeel is lively, but rich and has a subtle creaminess. 100% stainless steel fermentation guarantees the fresh fruit character fans of this wine have come to appreciate over the years. This is the quintessential summer sipper and the perfect wine to pair with fresh oysters!', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 359, u'instructions': u'Peel the eggplants, cut into small cubes and then soak the cubes in salted water for around 10 minutes. Transfer out and drain. This will help to reduce the oil absorbed by the eggplants in stir-fry process. In a sauce pan, heat up around 1/2 tablespoon of vegetable cooking oil and then stir fry eggplants with mashed garlic until soft. Transfer out. In a large bowl, mix stir-fried eggplants, mung bean sections, coriander, green onion and shitake mushroom with salt, light soy sauce and Chinese five spice powder. Assemble the potstickers one by one. Brush some oil on a pan; lay the potstickers and saut with medium fire until golden brown. In order to make sure the potstickers are cooked toughly, I would suggest pouring around 1 tablespoon warm water after saut the bottom side to golden brown. The theory is to steam other parts of the potstickers with vapour. Turn the potstickers over from time to time. Transfer out when the water added are evaporated and potstickers become crispy again. Serve immediately or with chili sauce you prefer.', u'spoonacularSourceUrl': u'https://spoonacular.com/chinese-vegan-potstickers-610529', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 50, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}