{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/248566-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 248566, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coconut Chocolate Cheesecake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 126.14, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'3 tablespoons brown sugar or to taste', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 cups crushed coconut cookies (most are dairy free)', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'crushed', u'(most are dairy free)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cups'}, {u'originalString': u'1/2 cup So Delicious French Vanilla Coconut Milk Creamer', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 250 mL tub dairy-free cream cheese alternative', u'aisle': u'Cheese;Health Foods', u'name': u'Dairy Free Cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 250.0, u'consistency': u'solid', u'id': 93701, u'unit': u'mL'}, {u'originalString': u'1 325mL So Delicious Dairy Free Original Culinary Coconut Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 325.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'mL'}, {u'originalString': u'3 ounces dairy-free chocolate, chopped fine', u'aisle': u'Health Foods;Baking', u'name': u'dairy free chocolate chips', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 98848, u'unit': u'ounces'}, {u'originalString': u'1/4 cup shredded desiccated sweetened coconut', u'aisle': u'Baking', u'name': u'desiccated coconut', u'metaInformation': [u'shredded', u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon instant coffee granules', u'aisle': u'Tea and Coffee', u'name': u'instant coffee granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoon'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 420 mL package drained soft tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'soft', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 420.0, u'consistency': u'solid', u'id': 16162, u'unit': u'mL'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup melted non-hydrogenated vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/coconut-chocolate-cheesecake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix together and press 3/4 of the crumbs on to the bottom of a spring form pan, press down using the bottom of a glass. If it sticks dip the glass in sugar. Save the remainder to sprinkle around the top of the cheesecake for decoration.Blend all ingredients in a food processor or blender, except eggs. When very smooth drop in eggs, mix only for a few seconds to incorporate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour into prepared crust. Sprinkle remaining crumbs around the edges for decoration.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake in a preheated 325\xbaF oven for approximately 50 minutes.Cool and refrigerate in the pan until ready to serve. Run the back of a knife around edges to loosen from pan.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Whisk all ingredients in a small sauce pot until smooth, except chopped chocolate. When blended add chocolate to pan. On medium heat simmer all of the ingredients together, whisking regularly to prevent sticking.Reduce the mixture allowing to thicken for 5 minutes.Cool and pour over the cooled cheesecake.This makes quite a bit and can be served on the side as well.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 79, u'instructions': u'Mix together and press 3/4 of the crumbs on to the bottom of a spring form pan, press down using the bottom of a glass. If it sticks dip the glass in sugar. Save the remainder to sprinkle around the top of the cheesecake for decoration.Blend all ingredients in a food processor or blender, except eggs. When very smooth drop in eggs, mix only for a few seconds to incorporate.Pour into prepared crust. Sprinkle remaining crumbs around the edges for decoration.Bake in a preheated 325\xbaF oven for approximately 50 minutes.Cool and refrigerate in the pan until ready to serve. Run the back of a knife around edges to loosen from pan.Whisk all ingredients in a small sauce pot until smooth, except chopped chocolate. When blended add chocolate to pan. On medium heat simmer all of the ingredients together, whisking regularly to prevent sticking.Reduce the mixture allowing to thicken for 5 minutes.Cool and pour over the cooled cheesecake.This makes quite a bit and can be served on the side as well.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-chocolate-cheesecake-248566', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}