{u'recipes': [{u'sourceName': u'Well Plated', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/728905-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 728905, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lemon Shrimp Pasta with Orzo and Asparagus', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 535.39, u'creditText': u'Well Plated', u'extendedIngredients': [{u'originalString': u'1 pound asparagus, trimmed and cut into 2-inch pieces', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed', u'cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons chopped fresh parsley, plus additional for serving', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'Lemon wedges, for serving', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'1 large lemon, zest and juice (about 1/4 cup)', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9156, u'unit': u'cup'}, {u'originalString': u'8 ounces uncooked whole wheat orzo pasta (I like DeLallo)', u'aisle': u'Pasta and Rice', u'name': u'orzo pasta', u'metaInformation': [u'whole wheat', u'uncooked', u'(I like DeLallo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10920420, u'unit': u'ounces'}, {u'originalString': u'1/2 cup freshly grated Parmesan cheese, divided', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'divided', u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 cups reduced sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'reduced sodium chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'1 1/4 pounds large (31 to 35 count) raw shrimp, peeled and deveined (use fresh or frozen, thawed shrimp)', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'raw', u'fresh', u'thawed', u'large', u'deveined', u'peeled', u'(31 to 35 count)', u'(use , shrimp)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}, {u'originalString': u'1 small yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.wellplated.com/lemon-shrimp-pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place a rack in the center of your oven and preheat the oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place theshrimpin a small bowl, sprinkle with pepper and salt, and set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large, oven-proof skillet or Dutch oven with a tight-fitting lid over medium.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u"Add theonion and cook, stirring often, until the onion is soft and translucent, about 3-4 minutes.Stir in the garlic and until fragrant, about 30 seconds, then stir in the orzo. Increase the heat to medium high and cook the orzo until it's lightly browned and smells toasty, about 2 minutes.", u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken broth and 1/2 cup water. Bring the liquid to a boil. Stir with a wooden spoon, scraping the bottom of the pan so that you loosen any stuck pasta. Cover the pan, reduce the heat to a simmer, and let cook 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the lid and stir, scraping the bottom of the pan again.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the asparagus, recover, then continue cooking until the pasta is just becoming tender, about 10minutes. The pasta will look a little liquidy. Stir in the lemon zest, lemon juice, 1/4 cup of the Parmesan, parsley, and the seasonedshrimp. Sprinkle the remaining 1/4 cup Parmesan over the top.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Bake the pasta, uncovered, just until theshrimpare cooked through, about 8 - 10 minutes. Theshrimpwill be pink, fairly firm, and opaquedo not over cook. Sprinkle with additional chopped parsley and garnish with lemon wedges.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Luna Nuda Pinot Grigio. It has 4.4 out of 5 stars and a bottle costs about 14 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste. View More', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 272, u'instructions': u"Place a rack in the center of your oven and preheat the oven to 400 degrees F. Place theshrimpin a small bowl, sprinkle with pepper and salt, and set aside.Heat the olive oil in a large, oven-proof skillet or Dutch oven with a tight-fitting lid over medium. Add theonion and cook, stirring often, until the onion is soft and translucent, about 3-4 minutes.Stir in the garlic and until fragrant, about 30 seconds, then stir in the orzo. Increase the heat to medium high and cook the orzo until it's lightly browned and smells toasty, about 2 minutes.Add the chicken broth and 1/2 cup water. Bring the liquid to a boil. Stir with a wooden spoon, scraping the bottom of the pan so that you loosen any stuck pasta. Cover the pan, reduce the heat to a simmer, and let cook 5 minutes. Remove the lid and stir, scraping the bottom of the pan again. Add the asparagus, recover, then continue cooking until the pasta is just becoming tender, about 10minutes. The pasta will look a little liquidy. Stir in the lemon zest, lemon juice, 1/4 cup of the Parmesan, parsley, and the seasonedshrimp. Sprinkle the remaining 1/4 cup Parmesan over the top.Bake the pasta, uncovered, just until theshrimpare cooked through, about 8 - 10 minutes. Theshrimpwill be pink, fairly firm, and opaquedo not over cook. Sprinkle with additional chopped parsley and garnish with lemon wedges. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-shrimp-pasta-with-orzo-and-asparagus-728905', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}