{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511308-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 511308, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Root Vegetables', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 113.99, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'2 lbs. carrots, peeled, sliced about 1/2"', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u'lbs'}, {u'originalString': u'Optional: Save some sprigs of fennel leaves and sprinkle over the vegetables before serving.', u'aisle': u'Produce', u'name': u'fennel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u'serving'}, {u'originalString': u'3 Fennel bulbs, quartered', u'aisle': u'Produce', u'name': u'fennel bulbs', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'1 tsp. rosemary, fresh or dried', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tsp'}, {u'originalString': u'1 tsp. thyme, fresh or dried', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'3 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1/2 large onion, quartered', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 pound red potatoes, diced into bite size pieces', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'pound'}, {u'originalString': u'salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'5 small turnips, quartered', u'aisle': u'Produce', u'name': u'turnips', u'metaInformation': [u'small', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11564, u'unit': u''}], u'healthScore': 66.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2013/01/09/roasted-root-vegetables/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400FPut all the vegetables in a large baking dish. Season well with salt and black pepper, drizzle with olive oil; toss to coat them evenly. Sprinkle with rosemary and thyme.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the oven and bake for approx. 35 - 45 minutes, stirring every 15 minutes. If the vegetables look dry, add a little more drizzle of vegetable oil.. Cook until fork tender.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 190, u'instructions': u'Preheat the oven to 400FPut all the vegetables in a large baking dish. Season well with salt and black pepper, drizzle with olive oil; toss to coat them evenly. Sprinkle with rosemary and thyme.Place in the oven and bake for approx. 35 - 45 minutes, stirring every 15 minutes. If the vegetables look dry, add a little more drizzle of vegetable oil.. Cook until fork tender.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-root-vegetables-511308', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}