{u'recipes': [{u'sourceName': u'SippitySup', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619373-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619373, u'veryPopular': False, u'lowFodmap': False, u'title': u'Maple Cheesecake with Pears', u'diets': [], u'pricePerServing': 230.52, u'creditText': u'SippitySup', u'extendedIngredients': [{u'originalString': u'\xbc cup cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'24 ounce cream cheese (at room temperature)', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'at room temperature', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'7 ounce Digestive biscuits (see notes)', u'aisle': u'Sweet Snacks', u'name': u'digestive biscuits', u'metaInformation': [u'(see notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/digestive-biscuits.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 18173, u'unit': u'ounce'}, {u'originalString': u'\xbc teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup plus 2 tablespoons real maple syrup (divided)', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'divided', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 teaspoon turbinado sugar (optional)', u'aisle': u'Health Foods;Baking', u'name': u'turbinado sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19908, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoon unsalted butter (melted)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'hot water (as needed)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot', u'as needed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.sippitysup.com/maple-cheesecake-pears/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Prepare the crust: Preheat oven to 350 degrees. In a food processor, pulse digestive biscuits and salt until finely ground (you should have about 1  cups).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/digestive-biscuits.jpg', u'id': 18173, u'name': u'digestive biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}], u'step': u'Add  cup maple syrup and melted butter; pulse until combined.Firmly press crumb mixture into bottom and up sides of a 8 or 9-inch springform pan. The crumbs should come about 3 inches up the sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [], u'step': u'Bake until crust is dry and set, about 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool completely on a wire rack. Once cool wrap exterior of pan (including base) in a double layer of foil; set aside.Prepare the filling: In bowl of a stand mixer fitted with paddle attachment beat cream cheese on low speed, scraping down side of bowl occasionally, until smooth.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add remaining 3/4-cup syrup and eggs, 1 at a time, beating well after each addition.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Add cream and vanilla; beat until just combined. Scrape the filling into the prepared pan.Set the lined and filled springform pan inside a large, shallow roasting pan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to heated 350 degree oven. Carefully add hot water into roasting pan to reach halfway up sides.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Bake until cake is set but still slightly wobbly in center; about 1 hour.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Transfer cake pan to wire rack; let cake cool completely. Refrigerate, from 3 hours to overnight.Prepare the pears: Turn the broiler to high. Lightly coat one or two (depending on size) parchment-lined rimmed baking sheet with cooking spray. Choose 24 of the nicest looking most uniformly sized pear slices. arrange them in a single layer on sheet and brush with remaining 2 tablespoons maple syrup.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place under the broiler and broil until slightly charred on the edges and browned in spots, about 4-6 minutes, rotating sheet frequently. Carefully transfer the pears to a new piece of parchment so as to avoid sticking.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Let cool. If moisture puddles onto the pears during cooling, blot lightly with a paper towel before proceeding.To serve, arrange pear slices, overlapping slightly in a couple of layers, on cheesecake. Sprinkle with turbindo sugar (optional) before releasing the cake from the springform pan. Slice and serve immediately.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Prepare the crust: Preheat oven to 350 degrees. In a food processor, pulse digestive biscuits and salt until finely ground (you should have about 1  cups). Add  cup maple syrup and melted butter; pulse until combined.Firmly press crumb mixture into bottom and up sides of a 8 or 9-inch springform pan. The crumbs should come about 3 inches up the sides. Bake until crust is dry and set, about 12 minutes. Let cool completely on a wire rack. Once cool wrap exterior of pan (including base) in a double layer of foil; set aside.Prepare the filling: In bowl of a stand mixer fitted with paddle attachment beat cream cheese on low speed, scraping down side of bowl occasionally, until smooth. Add remaining 3/4-cup syrup and eggs, 1 at a time, beating well after each addition. Add cream and vanilla; beat until just combined. Scrape the filling into the prepared pan.Set the lined and filled springform pan inside a large, shallow roasting pan. Transfer to heated 350 degree oven. Carefully add hot water into roasting pan to reach halfway up sides. Bake until cake is set but still slightly wobbly in center; about 1 hour.Transfer cake pan to wire rack; let cake cool completely. Refrigerate, from 3 hours to overnight.Prepare the pears: Turn the broiler to high. Lightly coat one or two (depending on size) parchment-lined rimmed baking sheet with cooking spray. Choose 24 of the nicest looking most uniformly sized pear slices. arrange them in a single layer on sheet and brush with remaining 2 tablespoons maple syrup. Place under the broiler and broil until slightly charred on the edges and browned in spots, about 4-6 minutes, rotating sheet frequently. Carefully transfer the pears to a new piece of parchment so as to avoid sticking. Let cool. If moisture puddles onto the pears during cooling, blot lightly with a paper towel before proceeding.To serve, arrange pear slices, overlapping slightly in a couple of layers, on cheesecake. Sprinkle with turbindo sugar (optional) before releasing the cake from the springform pan. Slice and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/maple-cheesecake-with-pears-619373', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}