{u'recipes': [{u'sourceName': u'Healing Tomato', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/848611-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 848611, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rice Pilaf With Brussels Sprouts and Sunflower Seeds', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 163.01, u'creditText': u'Healing Tomato', u'extendedIngredients': [{u'originalString': u'2 Tbsp of sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'Tbsp'}, {u'originalString': u'1/2 tsp of balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2069, u'unit': u'tsp'}, {u'originalString': u'3/4 cup of wild rice and Basmati rice (uncooked)', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [u'wild', u'uncooked', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020444, u'unit': u'cup'}, {u'originalString': u'1 tsp of freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'20 Brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 11098, u'unit': u''}, {u'originalString': u'1/2 tsp of cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'1 tsp of cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'2 cloves of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tsp of freshly squeezed lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tsp'}, {u'originalString': u'1 tsp of whole pistachios.', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12151, u'unit': u'tsp'}, {u'originalString': u'1/4 of a red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 tsp of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tsp of salt (Split into half)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'split', u'( into half)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp of sunflower seeds', u'aisle': u'Savory Snacks', u'name': u'sunflower seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12036, u'unit': u'Tbsp'}, {u'originalString': u'1/4 tsp of turmeric (optional)', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}, {u'originalString': u'2 tsp of vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tsp'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.healingtomato.com/2016/08/17/rice-pilaf/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the rice first.  You should be able to find a mix of Basmati and wild rice in  your grocery store.  Use about 3/4 cup of uncooked mix of wild rice and Basmati rice.  There is no shortcut when it comes to cooking rice. Follow this simple steps to achieve the perfectly cooked rice.Take about 15 Brussels sprouts and cut them in half lengthwise.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'id': 10020444, u'name': u'basmati rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut the halved Brussels sprouts into long shreds.  Keep them a little thick to prevent them from burning during the cooking process.  After shredding them, you will have about 3 cups worth of shredded Brussels sprouts.Take a quarter of a red onion and cut it into julienne style. Do the same for 2 cloves of garlic.In a pan that has a thick bottom, add 2 tsp of vegetable oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"Add the onions and garlic to it.  Stir gently to make sure that the onions don't burn.When the onions are translucent, add 1 tsp of cumin seeds and roast for 30 more seconds", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the shredded Brussels sprouts and mix well.  Keep the heat low to keep them crisp', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [], u'step': u'Add 1 tsp of salt and 1 tsp of freshly ground black pepper', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let the Brussels sprouts cook for about 20 minutes on low heat.  Make sure you are stirring constantly during those 30 minutes', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [], u'step': u'Add 1/2 tsp of cayenne pepper, 2 Tbsp of sliced almonds, 2 Tbsp of sunflower seeds and 1 tsp of whole pistachios.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'id': 12036, u'name': u'sunflower seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Add 1 tsp of freshly squeezed lime juice, 1 tsp of salt, 1/2 tsp of balsamic vinegar and 1/4 tsp of turmeric.  Turmeric is optional, but, it will add a little color to the recipe.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the drained and cooked rice to the Brussels sprouts.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [], u'step': u'Mix well', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Serve this rice pilaf as a meal by itself or as a side meal.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'aggregateLikes': 390, u'instructions': u"Cook the rice first.  You should be able to find a mix of Basmati and wild rice in  your grocery store.  Use about 3/4 cup of uncooked mix of wild rice and Basmati rice.  There is no shortcut when it comes to cooking rice. Follow this simple steps to achieve the perfectly cooked rice.Take about 15 Brussels sprouts and cut them in half lengthwise.  Cut the halved Brussels sprouts into long shreds.  Keep them a little thick to prevent them from burning during the cooking process.  After shredding them, you will have about 3 cups worth of shredded Brussels sprouts.Take a quarter of a red onion and cut it into julienne style. Do the same for 2 cloves of garlic.In a pan that has a thick bottom, add 2 tsp of vegetable oil.  Add the onions and garlic to it.  Stir gently to make sure that the onions don't burn.When the onions are translucent, add 1 tsp of cumin seeds and roast for 30 more secondsAdd the shredded Brussels sprouts and mix well.  Keep the heat low to keep them crispAdd 1 tsp of salt and 1 tsp of freshly ground black pepperLet the Brussels sprouts cook for about 20 minutes on low heat.  Make sure you are stirring constantly during those 30 minutesAdd 1/2 tsp of cayenne pepper, 2 Tbsp of sliced almonds, 2 Tbsp of sunflower seeds and 1 tsp of whole pistachios.Add 1 tsp of freshly squeezed lime juice, 1 tsp of salt, 1/2 tsp of balsamic vinegar and 1/4 tsp of turmeric.  Turmeric is optional, but, it will add a little color to the recipe.Add the drained and cooked rice to the Brussels sprouts.  Mix wellServe this rice pilaf as a meal by itself or as a side meal.", u'spoonacularSourceUrl': u'https://spoonacular.com/rice-pilaf-with-brussels-sprouts-and-sunflower-seeds-848611', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}