{u'recipes': [{u'sourceName': u'The Cookie Rookie', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/573018-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 573018, u'veryPopular': True, u'lowFodmap': True, u'title': u'Spiked Raspberry Sweet Tea', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 163.16, u'creditText': u'The Cookie Rookie', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbd-1 cup granulated sugar (I prefer the tea not too sweet)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'sweet', u'(I prefer the tea not too )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1\xbd cups Chambord Liquor (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'liquor', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14037, u'unit': u'cups'}, {u'originalString': u'mint springs, raspberrys, oranges, etc for garnish', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2064, u'unit': u'servings'}, {u'originalString': u'2 family-sized tea bags (or 6 regular-sized)(I prefer Luzianne)', u'aisle': u'Tea and Coffee', u'name': u'tea bags', u'metaInformation': [u'(or 6 regular-sized)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111111, u'unit': u''}, {u'originalString': u'8 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'png', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.thecookierookie.com/spiked-raspberry-sweet-tea/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Bring water to a boil then remove from the heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the tea bags, cover and let steep (soak) for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}]}, {u'equipment': [], u'step': u'Remove the tea bags then add the sugar and baking soda, stir until sugar dissolves.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in Chambord and Vodka if desired', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let the tea coolpour into ice-filled glasses.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Garnish with a mint sprig, raspberries, oranges, whatever you love.Enjoy!!**NOTE: You can make the sweet tea separate from the liquor and make the spiked part 'by the glass'. Use 1 cup sweet tea and 3-4 tablespoons Chambord. **", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'liquor'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sweet Tea works really well with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Engel Wines Riesling - Kosher. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'crisp , floral , tropical fruit', u'title': u'Engel Wines Riesling - Kosher', u'price': u'$19.99', u'id': 431252, u'link': u'https://www.amazon.com/Engel-Wines-Finger-Lakes-Riesling/dp/B06WRRCM11', u'imageUrl': u'https://spoonacular.com/productImages/431252-312x231.jpg'}]}, u'aggregateLikes': 10875, u'instructions': u"Bring water to a boil then remove from the heat.Add the tea bags, cover and let steep (soak) for 15 minutes.Remove the tea bags then add the sugar and baking soda, stir until sugar dissolves.Add in Chambord and Vodka if desiredLet the tea coolpour into ice-filled glasses.Garnish with a mint sprig, raspberries, oranges, whatever you love.Enjoy!!**NOTE: You can make the sweet tea separate from the liquor and make the spiked part 'by the glass'. Use 1 cup sweet tea and 3-4 tablespoons Chambord. **", u'spoonacularSourceUrl': u'https://spoonacular.com/spiked-raspberry-sweet-tea-573018', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}