{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212479-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 212479, u'veryPopular': True, u'lowFodmap': True, u'title': u'Gluten-free lemon drizzle cake', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 30, u'pricePerServing': 112.39, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp gluten-free baking powder (Supercook does one)', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [u'gluten-free', u'(Supercook does one)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'200g butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'200g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'4 tbsp granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'175g ground almonds (to make it nut free see below)', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'ground almonds', u'metaInformation': [u'(to make it nut free see below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 93740, u'unit': u'g'}, {u'originalString': u'juice 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'zest 3 lemons', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'250g mashed potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/5870/glutenfree-lemon-drizzle-cake', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/fan 160C/gas 4. Butter and line a deep, 20cm round cake tin. Beat the sugar and butter together until light and fluffy, then gradually add the egg,beating after each addition. Fold in the almonds, cold mashed potato, lemon zestand baking powder.Tip into the tin, level the top, then bake for 40-45 mins or until golden and a skewer inserted into the middle of the cake comes out clean. Turn out onto a wire rack after 10 mins cooling.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix the granulated sugar and the lemon juice together, then spoon over the top of the cake, letting it drip down the sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Let the cake coolcompletely before slicing.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 4073, u'instructions': u'Heat oven to 180C/fan 160C/gas 4. Butter and line a deep, 20cm round cake tin. Beat the sugar and butter together until light and fluffy, then gradually add the egg,beating after each addition. Fold in the almonds, cold mashed potato, lemon zestand baking powder.Tip into the tin, level the top, then bake for 40-45 mins or until golden and a skewer inserted into the middle of the cake comes out clean. Turn out onto a wire rack after 10 mins cooling. Mix the granulated sugar and the lemon juice together, then spoon over the top of the cake, letting it drip down the sides. Let the cake coolcompletely before slicing.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-lemon-drizzle-cake-212479', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}