{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/567259-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 567259, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Bruschetta Cod', u'diets': [u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 260.86, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'1 (2.25 ounce) can sliced black olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'sliced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.25, u'consistency': u'solid', u'id': 1059195, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon cold unsalted butter, diced into small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'diced', u'cold', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons non-pareil capers, rinsed', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'1 pound true cod fillets', u'aisle': u'Seafood', u'name': u'cod fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15015, u'unit': u'pound'}, {u'originalString': u'1/3 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 cup diced pitted kalamata olives', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'diced', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup chopped fresh Italian parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh', u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'pinch sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 cup diced tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.lifesambrosia.com/2014/04/baked-bruschetta-cod-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. In a bowl combine tomatoes, kalamata olives, black olives, capers, garlic, olive oil and pinch of sea salt together in a bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'id': 1009195, u'name': u'kalamata olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'id': 1059195, u'name': u'black olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Let stand at room temperature while you prep and cook the cod. Season both sides of the cod lightly with salt and pepper. Dredge in the flour. Lay in a baking dish. Sprinkle butter around the cod.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'id': 15015, u'name': u'cod'}]}, {u'equipment': [], u'step': u'Drizzle olive oil over the top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake cod in the preheated oven for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'id': 15015, u'name': u'cod'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and spoon bruschetta topping over the top. Return to oven and continue baking for another 5 - 10 minutes or until the cod is opaque and flakes easily. Sprinkle fresh parsley over the top and serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'id': 15015, u'name': u'cod'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Miranda Lambert Kerosene Pinot Grigio Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 26 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light yet pleasingly soft with hints of pear and ripe apple. This fruit forward wine comes across as slightly sweet with a finish that is crisp and clean. This versatile white can pair with most any dish or be enjoyed by itself in the shade of your favorite tree.', u'title': u'Miranda Lambert Kerosene Pinot Grigio Wine', u'price': u'$26.0', u'id': 428324, u'link': u'https://www.amazon.com/Miranda-Lambert-Kerosene-Pinot-Grigio/dp/B0184UHJRO', u'imageUrl': u'https://spoonacular.com/productImages/428324-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Preheat oven to 400 degrees. In a bowl combine tomatoes, kalamata olives, black olives, capers, garlic, olive oil and pinch of sea salt together in a bowl. Let stand at room temperature while you prep and cook the cod. Season both sides of the cod lightly with salt and pepper. Dredge in the flour. Lay in a baking dish. Sprinkle butter around the cod. Drizzle olive oil over the top. Bake cod in the preheated oven for 10 minutes. Remove from oven and spoon bruschetta topping over the top. Return to oven and continue baking for another 5 - 10 minutes or until the cod is opaque and flakes easily. Sprinkle fresh parsley over the top and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-bruschetta-cod-567259', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}