{u'recipes': [{u'sourceName': u'London Unattached', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666720-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 666720, u'veryPopular': False, u'lowFodmap': False, u'title': u'A 5:2 Diet To Fill You Up – Spinach and Lentil Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 162.33, u'creditText': u'London Unattached', u'extendedIngredients': [{u'originalString': u'1 Medium Carrot (Finely diced)', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced', u'medium', u'finely', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 teaspoon Coconut Oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Ground Coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Ground Cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'30g Black or Puy Lentils (Dry weight) (Washed)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [u'black', u'dry', u'washed', u'( weight)', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 16069, u'unit': u'g'}, {u'originalString': u'3 teaspoons Zero fat Greek Yoghurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low-fat greek yoghurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 93652, u'unit': u'teaspoons'}, {u'originalString': u'1 Medium Onion (Peeled and finely diced)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium', u'peeled', u'finely', u'( and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt and Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'200g Fresh spinach (Washed)', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'washed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'g'}, {u'originalString': u'750ml Vegetable Stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 750.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.london-unattached.com/2014/01/5-2-diet-recipes-spinach-lentil-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the coconut oil in a heavy based pan and add the spices.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u"Heat through for a minute or two before adding the onion and carrot and stir to coat well.  Turn the heat down to it's lowest and cook for around 8 minutes stirring frequently", u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour in the stock and add the lentils.  Bring to the boil and reduce the heat to a gentle simmer.  Cook for 20 minutes or until the lentils are tender', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add in the spinach and cook for 3-4 minutes.Blitz with a wand mixer or in a blender.  Taste and adjust seasoning as necessary', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Serve with a teaspoon of yoghurt as a garnish', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 153, u'instructions': u"Heat the coconut oil in a heavy based pan and add the spices.  Heat through for a minute or two before adding the onion and carrot and stir to coat well.  Turn the heat down to it's lowest and cook for around 8 minutes stirring frequentlyPour in the stock and add the lentils.  Bring to the boil and reduce the heat to a gentle simmer.  Cook for 20 minutes or until the lentils are tenderAdd in the spinach and cook for 3-4 minutes.Blitz with a wand mixer or in a blender.  Taste and adjust seasoning as necessaryServe with a teaspoon of yoghurt as a garnish", u'spoonacularSourceUrl': u'https://spoonacular.com/a-5-2-diet-to-fill-you-up-spinach-and-lentil-soup-666720', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}