{u'recipes': [{u'sourceName': u'Simply Sugar and Gluten Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/539695-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 539695, u'veryPopular': False, u'lowFodmap': False, u'title': u'Saffron Tomato Sauce with Chicken and Spaghetti Squash', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'pricePerServing': 78.27, u'creditText': u'Simply Sugar and Gluten Free', u'extendedIngredients': [{u'originalString': u'1 (28 ounce) can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'\xbd – \xbe cup good quality chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 6172, u'unit': u''}, {u'originalString': u'2 tablespoons good quality extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon fresh thyme, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves of garlic, minced on a microplane', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'and fresh ground pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'\xbc cup italian parsley, chopped', u'aisle': u'Produce', u'name': u'parsley', u'metaInformation': [u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon saffron threads', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron threads', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2037, u'unit': u'teaspoon'}, {u'originalString': u'1 medium yellow onion, sliced thin', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 35.0, u'imageType': u'png', u'spoonacularScore': 93.0, u'sourceUrl': u'http://simplysugarandglutenfree.com/saffron-tomato-sauce-chicken-spaghetti-squash/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a large saute pan over medium low heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion and cook until soft, about 5 to 8 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic and cook until it begins to color, about a minute.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add tomatoes, thyme, 1/2 cup chicken stock, and saffron.  Bring to a simmer and allow to reduce by about 25 percent, or until desired consistency is reached.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add in remaining stock if sauce is too thick.  Stir in parsley.  Taste and season with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 52, u'instructions': u'Heat olive oil in a large saute pan over medium low heat.  Add onion and cook until soft, about 5 to 8 minutes.  Add garlic and cook until it begins to color, about a minute.Add tomatoes, thyme, 1/2 cup chicken stock, and saffron.  Bring to a simmer and allow to reduce by about 25 percent, or until desired consistency is reached.  Add in remaining stock if sauce is too thick.  Stir in parsley.  Taste and season with salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/saffron-tomato-sauce-with-chicken-and-spaghetti-squash-539695', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}