{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/757872-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 757872, u'veryPopular': True, u'lowFodmap': True, u'title': u'Oven-Fried Truffle “Chips”', u'diets': [u'gluten free', u'fodmap friendly'], u'pricePerServing': 55.53, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbd cup chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'2 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup grated Parmesan cheese, optional', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'3 lb. Idaho or russet potatoes, peeled', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 11353, u'unit': u'lb'}, {u'originalString': u'1 tsp. truffle oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'truffle oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/truffle-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1024053, u'unit': u'tsp'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/oven-fried-truffle-chips/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut potatoes into English-style “chips” by slicing lengthwise into 1/2-inch-thick sticks.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Transfer to large saucepan with enough salted water to cover, and bring to a boil. Boil 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Drain, and cool.2. Preheat oven to 425\xb0F. Line 2 baking sheets with parchment paper. Toss potatoes with oil in large bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread in single layer on prepared baking sheets, and bake 30 minutes, stirring potatoes and switching baking sheets from top to bottom racks every 10 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer potatoes to bowl, and toss with parsley, Parmesan (if using), and truffle oil. Season with salt and pepper, if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/truffle-oil.jpg', u'id': 1024053, u'name': u'truffle oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1542, u'instructions': u'1. Cut potatoes into English-style “chips” by slicing lengthwise into 1/2-inch-thick sticks. Transfer to large saucepan with enough salted water to cover, and bring to a boil. Boil 2 minutes. Drain, and cool.2. Preheat oven to 425\xb0F. Line 2 baking sheets with parchment paper. Toss potatoes with oil in large bowl. Spread in single layer on prepared baking sheets, and bake 30 minutes, stirring potatoes and switching baking sheets from top to bottom racks every 10 minutes. Transfer potatoes to bowl, and toss with parsley, Parmesan (if using), and truffle oil. Season with salt and pepper, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-fried-truffle-chips-757872', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}