{u'recipes': [{u'sourceName': u'Gal on a Mission', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527350-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 600, u'id': 527350, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Buffalo Chicken Sandwiches', u'diets': [u'dairy free'], u'preparationMinutes': 0, u'pricePerServing': 111.99, u'creditText': u'Gal on a Mission', u'extendedIngredients': [{u'originalString': u'2-3 large boneless chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'boneless', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'2 cups of hot sauce, divided*', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'cups'}, {u'originalString': u'sandwich rolls**', u'aisle': u'Bakery/Bread', u'name': u'sandwich rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18353, u'unit': u'servings'}, {u'originalString': u'1 cup of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.galonamission.com/slow-cooker-buffalo-chicken-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the chicken breasts into a slow cooker, add in one cup of hot sauce and water. Allow to cool on low for 8-10 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Pour the liquid out. Shred the chicken and mix in the other cup of hot sauce.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}]}, {u'equipment': [], u'step': u'Place on rolls and add cole slaw mix and either kind of dressing that you like on top.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Place the chicken breasts into a slow cooker, add in one cup of hot sauce and water. Allow to cool on low for 8-10 hours.Pour the liquid out. Shred the chicken and mix in the other cup of hot sauce.Place on rolls and add cole slaw mix and either kind of dressing that you like on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-buffalo-chicken-sandwiches-527350', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 600, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}