{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/513980-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 513980, u'veryPopular': True, u'lowFodmap': False, u'title': u'Healthy Hamburger Stroganoff from Scratch', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 346.31, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'\xbd c. chicken broth (plus up to \xbd c. more if needed)', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'c'}, {u'originalString': u'12 oz. egg noodles (whole wheat if you can find them)', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'whole wheat', u'canned', u'( if you can find them)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20409, u'unit': u'oz'}, {u'originalString': u'2 tbsp. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'\xbd c. Greek yogurt (I used 2% fat yogurt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'2%', u'(I used fat yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'c'}, {u'originalString': u'1.25 pounds ground turkey or beef (a pound is fine, but I usually find turkey in 20 oz. packages)', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [u'fine', u'(a pound is , but I usually find turkey in 20 oz. packages)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 5662, u'unit': u'pounds'}, {u'originalString': u'freshly ground black pepper and kosher salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tsp. reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'tsp'}, {u'originalString': u'\xbd c. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}, {u'originalString': u'8 oz. mushrooms, sliced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'2 tbsp. olive oil, plus 2 tsp. for noodles if desired', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for noodles if desired'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp. dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 tsp. worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://wearychef.com/healthy-hamburger-stroganoff/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of lightly salted water to a boil. Cook noodles according to package directions, drain and set aside. If noodles are done more than a few minutes before your stroganoff is ready, you can toss them with 2 tsp. olive oil to prevent them from sticking together.Meanwhile, heat olive oil in a 12" skillet over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add ground meat, and brown and crumble. About halfway through cooking the meat, stir in soy sauce, worcestershire sauce, and oregano, and mushrooms. Continue cooking until meat is cooked through.Sprinkle flour over the meat mixture, and stir until meat and mushroom are well coated. Slowly stir in chicken broth and then milk, stirring constantly, until smooth. Reduce heat to medium, and bring to a simmer. Stir in yogurt, and return to a simmer. If sauce is thicker than you would like, stir in up to \xbd c. more chicken broth to your desired consistency. Cook 2-3 minutes longer before serving.Taste stroganoff, and add salt and pepper to taste.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Serve over cooked egg noodles.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1584, u'instructions': u'Bring a large pot of lightly salted water to a boil. Cook noodles according to package directions, drain and set aside. If noodles are done more than a few minutes before your stroganoff is ready, you can toss them with 2 tsp. olive oil to prevent them from sticking together.Meanwhile, heat olive oil in a 12" skillet over medium-high heat. Add ground meat, and brown and crumble. About halfway through cooking the meat, stir in soy sauce, worcestershire sauce, and oregano, and mushrooms. Continue cooking until meat is cooked through.Sprinkle flour over the meat mixture, and stir until meat and mushroom are well coated. Slowly stir in chicken broth and then milk, stirring constantly, until smooth. Reduce heat to medium, and bring to a simmer. Stir in yogurt, and return to a simmer. If sauce is thicker than you would like, stir in up to \xbd c. more chicken broth to your desired consistency. Cook 2-3 minutes longer before serving.Taste stroganoff, and add salt and pepper to taste. Serve over cooked egg noodles.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-hamburger-stroganoff-from-scratch-513980', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}