{u'recipes': [{u'sourceName': u'Nutmeg Nanny', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/586487-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 586487, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cinnamon Buttermilk Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 42.65, u'creditText': u'Nutmeg Nanny', u'extendedIngredients': [{u'originalString': u'6 tablespoons butter - melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 teaspoon cinnamon (you can add more if you want)', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'canned', u'(you can add more if you want)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla paste', u'aisle': u'Gourmet', u'name': u'vanilla paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93813, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.nutmegnanny.com/2012/01/09/cinnamon-buttermilk-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'For Pie:Preheat oven 325 degrees', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Beat eggs slightly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add sugar and flour. Then add melted butter and mix well. Next add buttermilk, vanilla paste and cinnamon.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 93813, u'name': u'vanilla paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Mix all together and press into 9 inch pie plate. Pre-bake the crust 15 minutes at 350 degrees.*If you like a firmer crust I would definitely recommend not doing a graham crust and instead using your favorite pie crust.  Also, I made my pies into little tarts instead of one large 9 inch pie.  Reduce cooking time by about 20 minutes if you do the same. The pies are ready when they are set but still a little jiggly. Like a pumpkin pie.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u'Pour into graham shell and cook until custard is set - approximately 1 hour.For Graham Cracker Crust'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Buttermilk Pie. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 425, u'instructions': u'For Pie:Preheat oven 325 degreesBeat eggs slightly. Add sugar and flour. Then add melted butter and mix well. Next add buttermilk, vanilla paste and cinnamon. Pour into graham shell and cook until custard is set - approximately 1 hour.For Graham Cracker Crust:Mix all together and press into 9 inch pie plate. Pre-bake the crust 15 minutes at 350 degrees.*If you like a firmer crust I would definitely recommend not doing a graham crust and instead using your favorite pie crust.  Also, I made my pies into little tarts instead of one large 9 inch pie.  Reduce cooking time by about 20 minutes if you do the same. The pies are ready when they are set but still a little jiggly. Like a pumpkin pie.', u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-buttermilk-pie-586487', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}