{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/525353-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 525353, u'veryPopular': False, u'lowFodmap': False, u'title': u'Toasted Coconut Banana Quinoa Breakfast Pudding', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 101.27, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u'3 tablespoons liquid honey or agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tablespoons'}, {u'originalString': u'1 cup mashed ripe bananas', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'ripe', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2 cups light coconut milk', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'cups'}, {u'originalString': u'1 cup quinoa, rinsed', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'\xbd cup unsweetened flaked coconut, toasted', u'aisle': u'Baking', u'name': u'unsweetened coconut', u'metaInformation': [u'unsweetened', u'flaked', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract, (GF if needed)', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'(GF if needed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://simple-nourished-living.com/2013/04/toasted-coconut-banana-quinoa-breakfast-pudding-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium saucepan, combine the quinoa and water. Bring to a boil over medium-high heat. Reduce heat to low, cover the pot and simmer for 12 to 15 minutes or until the quinoa has absorbed the water.Meanwhile in a blender combine the coconut milk, bananas, honey, ginger and salt and puree until smooth.Stir the banana mixture into the quinoa and cook over medium heat, stirring constantly until thickened, about 10 minutes.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the quinoa mixture to a medium heatproof bowl and let cool to room temperature.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [], u'step': u'Serve at room temperature or cover and refrigerate until cold.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Serve as a healthy breakfast pudding sprinkled with toasted coconut.To toast coconut preheat your oven to 300 degress.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread coconut out in a thin even layer on an ungreased baking sheet.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 15 to 20 minutes, stirring every 5 minutes, until golden brown and fragrant. Immediately transfer to a plate to prevent it from burning and let it cool completely.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 101, u'instructions': u'In a medium saucepan, combine the quinoa and water. Bring to a boil over medium-high heat. Reduce heat to low, cover the pot and simmer for 12 to 15 minutes or until the quinoa has absorbed the water.Meanwhile in a blender combine the coconut milk, bananas, honey, ginger and salt and puree until smooth.Stir the banana mixture into the quinoa and cook over medium heat, stirring constantly until thickened, about 10 minutes. Remove from heat and stir in vanilla.Transfer the quinoa mixture to a medium heatproof bowl and let cool to room temperature. Serve at room temperature or cover and refrigerate until cold. Serve as a healthy breakfast pudding sprinkled with toasted coconut.To toast coconut preheat your oven to 300 degress. Spread coconut out in a thin even layer on an ungreased baking sheet. Bake for 15 to 20 minutes, stirring every 5 minutes, until golden brown and fragrant. Immediately transfer to a plate to prevent it from burning and let it cool completely.', u'spoonacularSourceUrl': u'https://spoonacular.com/toasted-coconut-banana-quinoa-breakfast-pudding-525353', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}