{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/504161-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 504161, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chana masala with spinach', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 323.99, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'220g bag baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 220.0, u'consistency': u'solid', u'id': 11457, u'unit': u'g'}, {u'originalString': u'400g can chickpeas, drained', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 16058, u'unit': u'g'}, {u'originalString': u'400g can whole plum tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'g'}, {u'originalString': u'1 tsp cumin seed', u'aisle': u'Spices and Seasonings', u'name': u'cumin seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'1 tsp garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93663, u'unit': u'tsp'}, {u'originalString': u'1 garlic clove, finely chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1cm piece ginger, peeled and finely chopped or grated', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated', u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'1 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'juice \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 medium onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'75g quick-cook brown basmati rice', u'aisle': u'Pasta and Rice', u'name': u'quick-cooking brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 10020048, u'unit': u'g'}, {u'originalString': u'1 tbsp rapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'rapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'\xbd red chilli, deseeded and finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'deseeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1 tsp turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}], u'healthScore': 96.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/chana-masala-spinach', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Cook the rice following pack instructions. Meanwhile, heat a large non-stick pan or wok and dry-fry the cumin seeds for 1 min, stirring often, while they pop.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and set aside.Using the same pan, heat the oil, add the onion, garlic, ginger and chilli, and saut\xe9 over a medium heat for about 3 mins. Reduce the heat, add all the spices, stir well and cook for a further 2 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the tomatoes, stirring, and use the side of a spoon to break them up into smaller bite-sized chunks.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chickpeas and 200ml water.Bring to the boil, then simmer for 10 mins before stirring in the lemon juice and spinach.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the spinach wilt, then remove the pan from the heat.Divide the rice between 2 bowls, and serve the curry. (The flavours intensify as it cools, so for a fuller flavour, make earlier in the day and reheat slowly prior to serving.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Dry Creek Vineyard Dry Chenin Blanc, Wine with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This beautiful wine is wonderfully consistent vintage after vintage. We receive superior Chenin Blanc fruit from the Wilson Ranch in Clarksburg, allowing us to produce an expressive, nuanced and delicious wine. At first swirl, aromatics of white pear, pineapple and banana spring forward from the glass. On the palate, the wine is refreshing with flavors of ripe tangerine and peaches. The mouthfeel is lively, but rich and has a subtle creaminess. 100% stainless steel fermentation guarantees the fresh fruit character fans of this wine have come to appreciate over the years. This is the quintessential summer sipper and the perfect wine to pair with fresh oysters!', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'Cook the rice following pack instructions. Meanwhile, heat a large non-stick pan or wok and dry-fry the cumin seeds for 1 min, stirring often, while they pop. Remove and set aside.Using the same pan, heat the oil, add the onion, garlic, ginger and chilli, and saut\xe9 over a medium heat for about 3 mins. Reduce the heat, add all the spices, stir well and cook for a further 2 mins. Add the tomatoes, stirring, and use the side of a spoon to break them up into smaller bite-sized chunks. Add the chickpeas and 200ml water.Bring to the boil, then simmer for 10 mins before stirring in the lemon juice and spinach. Let the spinach wilt, then remove the pan from the heat.Divide the rice between 2 bowls, and serve the curry. (The flavours intensify as it cools, so for a fuller flavour, make earlier in the day and reheat slowly prior to serving.)', u'spoonacularSourceUrl': u'https://spoonacular.com/chana-masala-with-spinach-504161', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}