{u'recipes': [{u'sourceName': u'Amandas Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527228-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 527228, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crockpot Java Beef Stew with Mushrooms and Baby Reds', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 2509.73, u'creditText': u'Amandas Cooking', u'extendedIngredients': [{u'originalString': u'11/2 pounds baby reds, quartered', u'aisle': u'Produce', u'name': u'baby peas', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 5.5, u'consistency': u'solid', u'id': 11304, u'unit': u'pounds'}, {u'originalString': u'1 cup beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'2 pounds beef stew meat', u'aisle': u'Meat', u'name': u'beef stew meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'pounds'}, {u'originalString': u'1/4 cup brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cups sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'2 tablespoon olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 cups slivered onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'serving'}, {u'originalString': u'5 cloves garlic, kept whole', u'aisle': u'Produce', u'name': u'whole garlic', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://amandascookin.com/2012/03/crockpot-java-beef-stew-with-mushrooms-and-baby-reds.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 52, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Dry the beef stew meat using paper towels. Dredge the beef in the flour and brown in a large skillet in one tablespoon of the olive oil. When browned, empty the meat into the slow cooker.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 10013411, u'name': u'beef stew meat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the potatoes and toss with the beef. Sprinkle potatoes and beef with the thyme and season with salt and pepper.Do not clean the skillet. There will probably be some brown bits in the pan and thats good!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add the remaining tablespoon of olive oil and saute the slivered onions and sliced mushrooms until the begin to get tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and saute for a minute longer.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer the onion mixture to the slow cooker.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Put the skillet back onto the stove and add the broth and coffee. Use a spatula to deglaze the pan getting all those yummy brown bits mixed into the broth mixture. Simmer for a few minutes just to get it all mixed together, then add the broth mixture to the slow cooker.Cover the slow cooker and cook on low for 6-7 hours or on high for 4-5 hours. 20 minutes before serving, add the peas to the slow cooker and continue cooking until done.``', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'aggregateLikes': 42, u'instructions': u'Dry the beef stew meat using paper towels. Dredge the beef in the flour and brown in a large skillet in one tablespoon of the olive oil. When browned, empty the meat into the slow cooker. Add the potatoes and toss with the beef. Sprinkle potatoes and beef with the thyme and season with salt and pepper.Do not clean the skillet. There will probably be some brown bits in the pan and thats good! Add the remaining tablespoon of olive oil and saute the slivered onions and sliced mushrooms until the begin to get tender. Add the garlic and saute for a minute longer. Transfer the onion mixture to the slow cooker.Put the skillet back onto the stove and add the broth and coffee. Use a spatula to deglaze the pan getting all those yummy brown bits mixed into the broth mixture. Simmer for a few minutes just to get it all mixed together, then add the broth mixture to the slow cooker.Cover the slow cooker and cook on low for 6-7 hours or on high for 4-5 hours. 20 minutes before serving, add the peas to the slow cooker and continue cooking until done.``', u'spoonacularSourceUrl': u'https://spoonacular.com/crockpot-java-beef-stew-with-mushrooms-and-baby-reds-527228', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}