{u'recipes': [{u'sourceName': u'Spicy Southern Kitchen', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/763558-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 763558, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stacked Tortilla Taco Pizzas', u'diets': [], u'pricePerServing': 433.3, u'creditText': u'Spicy Southern Kitchen', u'extendedIngredients': [{u'originalString': u'9 (8-inch) flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 9.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'8-inch'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Toppings: shredded iceberg lettuce, sliced black olives, salsa, sour cream, green onions', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [u'shredded', u'sour', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'1 pound lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'1 (8-ounce) package shredded Mexican cheese', u'aisle': u'Cheese', u'name': u'mexican cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1251, u'unit': u'ounce'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 (16-ounce) can refried beans', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'refried beans', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16202, u'unit': u'ounce'}, {u'originalString': u'1 (1-oz) packet taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'oz'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://spicysouthernkitchen.com/stacked-tortilla-taco-pizzas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place ground beef and onion in a nonstick pan and cook over medium heat, breaking apart with a wooden spoon until no longer pink.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic.Measure out 1 teaspoons taco seasoning and set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add remaining taco seasoning and  cup water to ground beef. Stir well and cook until evenly mixed and thickened.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}]}, {u'equipment': [], u'step': u'Remove from heat.Spray both sides of tortillas with cooking spray.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on baking sheets and bake 3 minutes. Flip over and bake another 3 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the 1 teaspoons taco seasoning into the refried beans.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}]}, {u'equipment': [], u'step': u'Mix in  cup shredded cheese.Divide ground beef mixture on 3 of the tortillas and spread evenly. Sprinkle about 2 tablespoons of cheese on top of each one and top with a second tortilla.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Spread  of refried bean mixture on top of each tortilla that was just stacked.Top with remaining tortillas and sprinkle about  cup shredded cheese on top of each pizza.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in oven and bake until cheese is melted, about 6-8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Place desired toppings on top and cut into wedges to serve.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Story Winery, Sangiovese, Estate, Shenandoah Valley with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Aromas of raspberry, cherry, pie crust, tobacco and oak greet the nose. Dark cherries and raspberry predominate the palate with mild tannins and nice acidity. The finish is gentle and lasting Enjoy!', u'title': u'Story Winery, Sangiovese, Estate, Shenandoah Valley', u'price': u'$19.0', u'id': 469504, u'link': u'https://www.amazon.com/Story-Winery-Sangiovese-California-Shenandoah/dp/B00NMXHFNC', u'imageUrl': u'https://spoonacular.com/productImages/469504-312x231.jpg'}]}, u'aggregateLikes': 138, u'instructions': u'Preheat oven to 400 degrees.Place ground beef and onion in a nonstick pan and cook over medium heat, breaking apart with a wooden spoon until no longer pink. Add garlic.Measure out 1 teaspoons taco seasoning and set aside. Add remaining taco seasoning and  cup water to ground beef. Stir well and cook until evenly mixed and thickened. Remove from heat.Spray both sides of tortillas with cooking spray. Place on baking sheets and bake 3 minutes. Flip over and bake another 3 minutes.Mix the 1 teaspoons taco seasoning into the refried beans. Mix in  cup shredded cheese.Divide ground beef mixture on 3 of the tortillas and spread evenly. Sprinkle about 2 tablespoons of cheese on top of each one and top with a second tortilla. Spread  of refried bean mixture on top of each tortilla that was just stacked.Top with remaining tortillas and sprinkle about  cup shredded cheese on top of each pizza.Place in oven and bake until cheese is melted, about 6-8 minutes.Place desired toppings on top and cut into wedges to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/stacked-tortilla-taco-pizzas-763558', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}