{u'recipes': [{u'sourceName': u'Lovely Little Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/682880-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 682880, u'veryPopular': False, u'lowFodmap': False, u'title': u'One Pot Pasta With Tomato, Basil, and Mozzarella', u'diets': [], u'pricePerServing': 168.98, u'creditText': u'Lovely Little Kitchen', u'extendedIngredients': [{u'originalString': u'14.5 ounce can diced tomatoes in sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon dried basil leaves', u'aisle': u'Spices and Seasonings', u'name': u'dried basil leaves', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'5 leaves fresh basil, torn (optional)', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 5.0, u'consistency': u'solid', u'id': 2044, u'unit': u'leaves'}, {u'originalString': u'3 cups uncooked fusilli pasta', u'aisle': u'Pasta and Rice', u'name': u'fusilli pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11320420, u'unit': u'cups'}, {u'originalString': u'2-3 cloves garlic, pressed through a garlic press', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces Ciliegine* fresh mozzarella, halved', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [u'fresh', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 pound mild Italian sausage', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1017063, u'unit': u'pound'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://lovelylittlekitchen.com/one-pot-pasta-with-tomato-basil-and-mozzarella/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large pan with medium high heat, crumble and brown the sausage until no longer pink.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add pressed garlic into the pan and stir constantly, cooking for one minute.Slowly add the chicken broth, scraping the browned bits off the bottom of the pan. Stir in the tomatoes, salt, sugar, basil leaves, pasta. Bring to a boil, then cover and turn heat down to medium low.Allow pasta to gently simmer for 10-12 minutes, stirring twice.When the pasta is just about done, remove the lid, stir in the heavy cream, and turn the heat up to bring the sauce to a gentle boil. Allow to boil for 2-3 minutes uncovered stirring frequently, or until sauce is slightly thickened. It will continue to thicken as it cools.Dot the top with fresh mozzarella (the heat of the pasta will soften it) and sprinkle with fresh basil if desired. Allow to set for 3-5 minutes before serving.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'fresh mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 111, u'instructions': u'In a large pan with medium high heat, crumble and brown the sausage until no longer pink. Add pressed garlic into the pan and stir constantly, cooking for one minute.Slowly add the chicken broth, scraping the browned bits off the bottom of the pan. Stir in the tomatoes, salt, sugar, basil leaves, pasta. Bring to a boil, then cover and turn heat down to medium low.Allow pasta to gently simmer for 10-12 minutes, stirring twice.When the pasta is just about done, remove the lid, stir in the heavy cream, and turn the heat up to bring the sauce to a gentle boil. Allow to boil for 2-3 minutes uncovered stirring frequently, or until sauce is slightly thickened. It will continue to thicken as it cools.Dot the top with fresh mozzarella (the heat of the pasta will soften it) and sprinkle with fresh basil if desired. Allow to set for 3-5 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-pot-pasta-with-tomato-basil-and-mozzarella-682880', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}