{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/578977-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_6', u'cookingMinutes': 0, u'id': 578977, u'veryPopular': True, u'lowFodmap': False, u'title': u'Paleo Pina Colada: Frosty and Healthy', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 127.13, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'3 large bananas, cut into thirds and frozen', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'frozen', u'large', u'cut into thirds and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 cup coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'2 cups pineapple chunks, frozen', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.foodfanatic.com/2013/03/paleo-pina-colada-frosty-and-healthy/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u"Buzz everything here together in a blender, helping it along, if needed, by pushing things down (with the blender turned off, of course).If it's still too thick, add up to 1/2 cup of water to get things going.", u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert can be paired with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 810, u'instructions': u"Buzz everything here together in a blender, helping it along, if needed, by pushing things down (with the blender turned off, of course).If it's still too thick, add up to 1/2 cup of water to get things going.", u'spoonacularSourceUrl': u'https://spoonacular.com/paleo-pina-colada-frosty-and-healthy-578977', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}