{u'recipes': [{u'sourceName': u'Lemons and Anchovies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/568618-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 568618, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Pork and Beans', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 184.61, u'creditText': u'Lemons and Anchovies', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 14.5 oz can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1 tablespoon fish sauce (optional)', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon dried or fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'3 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1\xbd pound boneless pork cut in stew-size pieces, frozen', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [u'boneless', u'frozen', u'cut in stew-size pieces, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10010219, u'unit': u'pound'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd pound dried Snowcap beans (or northern beans)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'dried', u'(or northern beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 16033, u'unit': u'pound'}, {u'originalString': u'1 tablespoon tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoon'}, {u'originalString': u'2 - 2\xbc cups chicken stock, warmed in microwave or on the stove', u'aisle': u'?', u'name': u'on the stove', u'metaInformation': [u'warmed'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'unit': u'cups'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://lemonsandanchovies.com/2012/04/crockpot-pork-and-beans/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add all the ingredients into the slow cooker from the beans to the bay leaf in the list above. For the chicken stock, use as little or as much as you will need to cover the beans so they cook evenly.Cook on High for 4 hours. You may want to stir everything together once or twice just to make sure the all the beans are cooking properly.After 4 hours, if the beans are tender, add the tomato paste, canned tomatoes, and crushed red pepper. Season with salt and pepper, as needed. I like to add a little fish sauce for an extra savory flavor but you may omit.Turn the power down to Low and cook for another hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'id': 10011693, u'name': u'canned tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [], u'step': u'Serve with rice or with country bread', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 27, u'instructions': u'Add all the ingredients into the slow cooker from the beans to the bay leaf in the list above. For the chicken stock, use as little or as much as you will need to cover the beans so they cook evenly.Cook on High for 4 hours. You may want to stir everything together once or twice just to make sure the all the beans are cooking properly.After 4 hours, if the beans are tender, add the tomato paste, canned tomatoes, and crushed red pepper. Season with salt and pepper, as needed. I like to add a little fish sauce for an extra savory flavor but you may omit.Turn the power down to Low and cook for another hour.Serve with rice or with country bread', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-pork-and-beans-568618', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}