{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599348-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 599348, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pineapple Muffins', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 36.44, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 large eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups plus 2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 tablespoons packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup buttermilk (regular or low-fat)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat buttermilk', u'metaInformation': [u'low-fat', u'(regular or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1088, u'unit': u'cup'}, {u'originalString': u'1 8-ounce can crushed pineapple in heavy syrup, drained', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'crushed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9266, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces unsalted butter, melted and cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://leitesculinaria.com/583/recipes-pineapple-muffins.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position the rack in the center of the oven and preheat the oven to 375\xb0F (190\xb0C). To prepare the muffin tins, spray the indentations and the rims around them with nonstick spray. If using silicon muffin tins, place the tins on a baking sheet after spraying.2. In a small bowl, mix the brown sugar and 2 tablespoons of the melted butter until well combined. Divide this mixture evenly among the 12 muffin tins, placing about 1 teaspoon in the bottom of each. Top the butter mixture in each tin with 1 teaspoon of crushed pineapple. Set aside.3.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the flour, granulated sugar, baking powder, baking soda, and salt until uniform. Set aside.4. In a large bowl, whisk the eggs until frothy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the buttermilk, the almond extract, the remaining 6 tablespoons of melted butter, and the remaining crushed pineapple. Gently stir in the prepared flour mixture with a wooden spoon until moistened.5. Taking care not to disturb the sugar and pineapple in the bottom of the tins, fill the tins three-quarters full with batter. Use additional greased tins or individual, oven-safe, greased ramekins for any leftover batter, or reserve the batter for a second baking.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 22 minutes, or until the muffins are lightly browned with rounded tops. A toothpick inserted into the center of one muffin should come out with a few moist crumbs attached.6. Set the pan on a wire rack to cool for 15 minutes. Gently tip each muffin to one side, taking care to keep the pineapple bottom attached. If it comes loose, simply scrape it out and gently press it back onto the inverted muffin top.', u'length': {u'number': 37, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Remove all the muffins; serve them upside down. Cool completely before sealing them in an airtight container, where they will stay fresh for up to 2 days. These muffins do not freeze well.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 12, u'instructions': u'1. Position the rack in the center of the oven and preheat the oven to 375\xb0F (190\xb0C). To prepare the muffin tins, spray the indentations and the rims around them with nonstick spray. If using silicon muffin tins, place the tins on a baking sheet after spraying.2. In a small bowl, mix the brown sugar and 2 tablespoons of the melted butter until well combined. Divide this mixture evenly among the 12 muffin tins, placing about 1 teaspoon in the bottom of each. Top the butter mixture in each tin with 1 teaspoon of crushed pineapple. Set aside.3. Whisk the flour, granulated sugar, baking powder, baking soda, and salt until uniform. Set aside.4. In a large bowl, whisk the eggs until frothy. Whisk in the buttermilk, the almond extract, the remaining 6 tablespoons of melted butter, and the remaining crushed pineapple. Gently stir in the prepared flour mixture with a wooden spoon until moistened.5. Taking care not to disturb the sugar and pineapple in the bottom of the tins, fill the tins three-quarters full with batter. Use additional greased tins or individual, oven-safe, greased ramekins for any leftover batter, or reserve the batter for a second baking. Bake for 22 minutes, or until the muffins are lightly browned with rounded tops. A toothpick inserted into the center of one muffin should come out with a few moist crumbs attached.6. Set the pan on a wire rack to cool for 15 minutes. Gently tip each muffin to one side, taking care to keep the pineapple bottom attached. If it comes loose, simply scrape it out and gently press it back onto the inverted muffin top. Remove all the muffins; serve them upside down. Cool completely before sealing them in an airtight container, where they will stay fresh for up to 2 days. These muffins do not freeze well.', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-muffins-599348', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}