{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601519-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 601519, u'veryPopular': False, u'lowFodmap': False, u'title': u'Monggo Beans (or Mung Bean Soup)', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 125.41, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'1 bunch chopped or pulled malunggay leaves (or spinach)', u'aisle': u'Health Foods', u'name': u'malunggay leaves', u'metaInformation': [u'chopped', u'(or spinach)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/edible-moringa-leaves.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 99124, u'unit': u'bunch'}, {u'originalString': u'1 cup coconut milk (I used the canned kind)', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'canned', u'(I used the kind)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'cup'}, {u'originalString': u'2 cups dry monggo beans, mung beans, or green lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dried green lentils', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10016069, u'unit': u'cups'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoons freshly grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'6 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://pinchofyum.com/monggo-beans-mung-bean-soup', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Boil: Bring the broth to a boil in a large pot.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Add the rinsed monggo beans and cook, uncovered, for about 40 minutes. I checked on mine every 10 minutes and added more water as needed (mine needed more water every time I checked it). You want the consistency to be like a very thick soup.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Saute the onion, garlic, and ginger in the oil in a large nonstick skillet until soft and fragrant, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add to the monggo pot and allow the mixture to simmer together for a few minutes.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix: Stir in the coconut milk and malunggay leaves.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/edible-moringa-leaves.jpg', u'id': 99124, u'name': u'moringa leaves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the monggo pot from the heat. It just needs to be hot enough to very slightly wilt the leaves.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over rice or plain, like a soup.', u'number': 6, u'ingredients': []}], u'name': u'Saute'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 236, u'instructions': u'Boil: Bring the broth to a boil in a large pot. Add the rinsed monggo beans and cook, uncovered, for about 40 minutes. I checked on mine every 10 minutes and added more water as needed (mine needed more water every time I checked it). You want the consistency to be like a very thick soup.Saute: Heat the oil in a large skillet over medium heat. Saute the onion, garlic, and ginger in the oil in a large nonstick skillet until soft and fragrant, about 3 minutes. Add to the monggo pot and allow the mixture to simmer together for a few minutes.Mix: Stir in the coconut milk and malunggay leaves. Remove the monggo pot from the heat. It just needs to be hot enough to very slightly wilt the leaves. Serve over rice or plain, like a soup.', u'spoonacularSourceUrl': u'https://spoonacular.com/monggo-beans-or-mung-bean-soup-601519', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}