{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/715273-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 715273, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pork Tonkatsu with Shiso', u'diets': [u'dairy free'], u'pricePerServing': 206.57, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'1 pound boneless pork loin with \xbc-inch-thick fat cap', u'aisle': u'Meat', u'name': u'boneless pork loin', u'metaInformation': [u'boneless', u'with \xbc-inch-thick fat cap'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10225, u'unit': u'pound'}, {u'originalString': u'2 large eggs, beaten to blend', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten to blend'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'\xbd cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 cups panko (Japanese breadcrumbs)', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [u'(Japanese breadcrumbs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cups'}, {u'originalString': u'4 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoons'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.bonappetit.com/recipe/pork-tonkatsu-with-shiso', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix ketchup and Worcestershire sauce in a small bowl.Do Ahead: Sauce can be made 1 week ahead. Cover and chill.Freeze pork loin until firm around edges, about 1 hour. Slice pork " thick (or as thinly as you can).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'id': 10225, u'name': u'pork loin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place slices between 2 pieces of plastic wrap and gently pound until as thin as possible without tearing meat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place eggs, panko, and flour in separate shallow bowls. Divide pork into 4 portions (you should have at least 4 slices per portion but may have more depending on how thinly you slice the meat). Working with 1 portion, season pork slices lightly on both sides with salt and stack, placing 2 shiso leaves, if desired, between any 2 slices. Keeping stack intact, dredge in flour, shaking off excess. Dip in eggs, letting excess drip off, then coat in panko, shaking off excess. Set on a wire rack set inside a rimmed baking sheet and repeat with remaining shiso leaves and stacks of pork.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 Tbsp. oil in a large skillet over medium-high. Cook 2 stacks of pork until golden brown and cooked through, about 3 minutes per side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer back to wire rack. Wipe out skillet and repeat with remaining 2 Tbsp. oil and 2 stacks of pork.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve pork with tonkatsu sauce.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2939, u'instructions': u'Mix ketchup and Worcestershire sauce in a small bowl.Do Ahead: Sauce can be made 1 week ahead. Cover and chill.Freeze pork loin until firm around edges, about 1 hour. Slice pork " thick (or as thinly as you can). Place slices between 2 pieces of plastic wrap and gently pound until as thin as possible without tearing meat.Place eggs, panko, and flour in separate shallow bowls. Divide pork into 4 portions (you should have at least 4 slices per portion but may have more depending on how thinly you slice the meat). Working with 1 portion, season pork slices lightly on both sides with salt and stack, placing 2 shiso leaves, if desired, between any 2 slices. Keeping stack intact, dredge in flour, shaking off excess. Dip in eggs, letting excess drip off, then coat in panko, shaking off excess. Set on a wire rack set inside a rimmed baking sheet and repeat with remaining shiso leaves and stacks of pork.Heat 2 Tbsp. oil in a large skillet over medium-high. Cook 2 stacks of pork until golden brown and cooked through, about 3 minutes per side. Transfer back to wire rack. Wipe out skillet and repeat with remaining 2 Tbsp. oil and 2 stacks of pork. Serve pork with tonkatsu sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-tonkatsu-with-shiso-715273', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}