{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/399313-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 399313, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Hot Crab Dip', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 106.27, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (6 ounces) crabmeat, drained, flaked and cartilage removed', u'aisle': u'Canned and Jarred', u'name': u'canned crabmeat', u'metaInformation': [u'flaked', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 15141, u'unit': u'ounces'}, {u'originalString': u'Assorted crackers', u'aisle': u'Savory Snacks', u'name': u'crackers', u'metaInformation': [u'assorted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 18621, u'unit': u'servings'}, {u'originalString': u'1 package (8 ounces) cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup finely chopped sweet onion', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11294, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/slow-cooker-hot-crab-dip', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a 1-1/2-qt. slow cooker, combine the first six ingredients; stir in crab. Cover and cook on low for 2-3 hours or until heated through.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with crackers.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Attems Ramato Pinot Grigio. It has 4.4 out of 5 stars and a bottle costs about 14 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif.', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u"Directions                                                                                In a 1-1/2-qt. slow cooker, combine the first six ingredients; stir in crab. Cover and cook on low for 2-3 hours or until heated through. Serve with crackers.                                        Yield: 2 cups.                                                                                                                         Originally published as Hot Crab Dip in  Taste of Home's Holiday & Celebrations CookbookAnnual 2009, p99                                                                                                                                                                                                        Nutritional Facts                                                                             1/4 cup (calculated without crackers) equals 190 calories, 16 g fat (7 g saturated fat), 55 mg cholesterol, 231 mg sodium, 3 g carbohydrate, trace fiber, 8 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-hot-crab-dip-399313', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}