{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474258-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 474258, u'veryPopular': False, u'lowFodmap': False, u'title': u'Detox Beet and Pink Grapefruit Salad – Betty Fussell – 50 Women Game Changers In Food', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 545.74, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'4 large handfuls of baby spinach, mixed baby greens or arugula', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'mixed', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 4.0, u'consistency': u'solid', u'id': 11457, u'unit': u'handfuls'}, {u'originalString': u'4 small beets, roasted, sliced', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'4 drizzles of avocado oil or extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u''}, {u'originalString': u'4 drizzles of your favorite fruit vinegar', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9431, u'unit': u''}, {u'originalString': u'1 pink grapefruit, peeled and sectioned', u'aisle': u'Produce', u'name': u'grapefruit', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grapefruit.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9112, u'unit': u''}, {u'originalString': u'1/2 red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup walnuts, chopped', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/2012/01/detox-beet-and-pink-grapefruit-salad-recipe-betty-fussell-50-women-game-changers-in-food.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place a handful of greens on each of 4 salad plates. Arrange sliced beets, grapefruit segments, and red onions on top. Sprinkle walnuts on top.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grapefruit.jpg', u'id': 9112, u'name': u'grapefruit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [], u'step': u'Drizzle avocado oil and vinegar on top. Season to taste with a little salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'aggregateLikes': 361, u'instructions': u'Place a handful of greens on each of 4 salad plates. Arrange sliced beets, grapefruit segments, and red onions on top. Sprinkle walnuts on top.Drizzle avocado oil and vinegar on top. Season to taste with a little salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/detox-beet-and-pink-grapefruit-salad-betty-fussell-50-women-game-changers-in-food-474258', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}