{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626254-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 626254, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Pesto Flatbreads', u'diets': [], u'pricePerServing': 167.99, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'4 oz cooked shredded or diced chicken breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'diced', u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 5062, u'unit': u'oz'}, {u'originalString': u'\xbe cup packed fresh basil', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'1 garlic clove', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'A pinch of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tablespoons'}, {u'originalString': u'1 plum tomato, sliced thin or diced', u'aisle': u'Produce', u'name': u'plum tomato', u'metaInformation': [u'diced', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup shredded 2% Mozzarella cheese (4 oz weighed)', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'2%', u'(4 oz weighed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'1 \xbd teaspoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'teaspoons'}, {u'originalString': u'4 Flatout Light Original flatbreads', u'aisle': u'Bakery/Bread', u'name': u'wheat flatbreads', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10018042, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.emilybites.com/2015/01/chicken-pesto-flatbreads-giveaway.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Combine the basil, pine nuts, Parmesan, garlic, oil, water, lemon juice, nutmeg, salt and pepper in a food processor and process until ingredients form a paste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the flatbreads directly onto the middle rack of the oven and bake for about 3  minutes until they stand firm when lifted.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the pesto evenly in a thin layer across the flatbreads, leaving a bit of space around the edges for a crust. Each flatbread will get about 1  tablespoons of pesto. Sprinkle the cheese over the pesto and then the chicken over the cheese.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the tomatoes over the top and return the flatbreads to the oven, directly on the rack (make sure no ingredients are hanging over the edge).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}], u'step': u'Bake for another 4-5 minutes until the flatbread is browned and cheese is melted. Slice with a pizza cutter and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 271, u'instructions': u'Preheat the oven to 350.Combine the basil, pine nuts, Parmesan, garlic, oil, water, lemon juice, nutmeg, salt and pepper in a food processor and process until ingredients form a paste.Place the flatbreads directly onto the middle rack of the oven and bake for about 3  minutes until they stand firm when lifted. Spread the pesto evenly in a thin layer across the flatbreads, leaving a bit of space around the edges for a crust. Each flatbread will get about 1  tablespoons of pesto. Sprinkle the cheese over the pesto and then the chicken over the cheese. Add the tomatoes over the top and return the flatbreads to the oven, directly on the rack (make sure no ingredients are hanging over the edge). Bake for another 4-5 minutes until the flatbread is browned and cheese is melted. Slice with a pizza cutter and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-pesto-flatbreads-626254', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}