{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598562-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 598562, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fried Goat Cheese with Onion Confit', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 187.09, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Dried bread crumbs, preferably mixed with Japanese-style panko crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'mixed', u'dried', u'with japanese-style panko crumbs'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18079, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon dried parsley flakes', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley flakes', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'tablespoon'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 4-ounce log goat cheese, cut in 1/2-inch slices', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'cut in 1/2-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'Mild olive oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/8 teaspoon crumbled thread saffron', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2037, u'unit': u'teaspoon'}, {u'originalString': u'Kosher or sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 large onions, such as Vidalia or other sweet onion, (1 1/4-1 1/2 pounds), slivered', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u' such as vidalia or other  onion, (1 1/4-1 1/2 pounds), slivered', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://leitesculinaria.com/893/recipes-fried-goat-cheese-with-onion-confit.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the onion confit1.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the oil, onions, garlic, saffron, and bay leaf in a shallow saute pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat over the lowest possible heat until the mixture begins to sizzle. Cover and cook 40 minutes. Season well with salt and pepper, add the wine, and cook until evaporated. (May be prepared ahead).Make the fried goat cheese2. In a shallow bowl, beat the egg and parsley together with a fork. Dip the cheese in the egg, then coat with the crumbs.3.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/deep-fryer.jpg', u'id': 404759, u'name': u'deep fryer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 360.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oil to 360\xb0F (182\xb0C), preferably in a deep fryer. Otherwise pour oil into a skillet to a depth of at least 1 inch, and heat the oil until it quickly browns a cube of bread. Fry the cheese until golden brown and drain on paper towels. (May be kept warm in a 200\xb0F (93\xb0C) oven for up to 30 minutes).4. Warm the confit and place a tablespoon or so on 4 to 8 individual plates.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place one or two of the fried cheese pieces on top and serve right away.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 46, u'instructions': u'Make the onion confit1. Put the oil, onions, garlic, saffron, and bay leaf in a shallow saute pan. Heat over the lowest possible heat until the mixture begins to sizzle. Cover and cook 40 minutes. Season well with salt and pepper, add the wine, and cook until evaporated. (May be prepared ahead).Make the fried goat cheese2. In a shallow bowl, beat the egg and parsley together with a fork. Dip the cheese in the egg, then coat with the crumbs.3. Heat the oil to 360\xb0F (182\xb0C), preferably in a deep fryer. Otherwise pour oil into a skillet to a depth of at least 1 inch, and heat the oil until it quickly browns a cube of bread. Fry the cheese until golden brown and drain on paper towels. (May be kept warm in a 200\xb0F (93\xb0C) oven for up to 30 minutes).4. Warm the confit and place a tablespoon or so on 4 to 8 individual plates. Place one or two of the fried cheese pieces on top and serve right away.', u'spoonacularSourceUrl': u'https://spoonacular.com/fried-goat-cheese-with-onion-confit-598562', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}