{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/565169-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 565169, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Caesar Wrap', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 185.65, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'20 grams anchovies fillets including olive oil', u'aisle': u'Canned and Jarred', u'name': u'anchovies in olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 15002, u'unit': u'grams'}, {u'originalString': u'A Caesar Salad Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar salad dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 43015, u'unit': u'servings'}, {u'originalString': u'8 cherry tomatoes halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'200 grams chicken fillet boneless and skinless', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'grams'}, {u'originalString': u'1 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'2 garlic cloves peeled', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4-6 hard boiled quail eggs halved; or use one hard-boiled egg, sliced', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled egg', u'metaInformation': [u'hard', u'boiled', u'halved', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'1/2 lemon juice and zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tbsp mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tbsp'}, {u'originalString': u'1/2 tbsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'150 grams romaine lettuce leaves torn to bite-sized pieces; washed and spinned dry', u'aisle': u'Produce', u'name': u'romaine lettuce leaves', u'metaInformation': [u'dry', u'washed and spinned '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'grams'}, {u'originalString': u'salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 tortilla wraps normal or wholemeal', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortilla wraps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'1 tbsp Worcestershire sauce (worchester sauce)', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [u'(worchester sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tbsp'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.noobcook.com/chicken-caesar-wrap/2/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Drizzle chicken with olive oil and season with salt, pepper and oregano. Arrange one layer (do not stack chicken) in the center of a piece of a piece of parchment paper measuring roughly 10” (25cm) by 14“ (35cm). Wrap to form a neat parcel.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Place parcel on a baking tray and bake at preheated oven of 200\xb0C for about 15 minutes. Carefully unwrap chicken parcel (beware of steam coming out of package). Discard liquid collected. Alternatively, you may pan-fry or grill the chicken on the stove top.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut chicken to even slices and set aside.Blend ingredients for salad dressing (A) to a fine consistency in a blender. If you don’t have a blender, you can use a fork to mash up the anchovies and then use a mortar and pestle to pound the dressing by hand.Warm tortilla wraps in an un-oiled, heated pan for about 1 minute on each side.To make the wrap, arrange sauce and fillings (chicken, lettuce, eggs and tomatoes) in center. Fold three sides toward the center and roll up the wrap.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [], u'step': u'Cut into two. Click here for step-by-step wrapping photos.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u'Drizzle chicken with olive oil and season with salt, pepper and oregano. Arrange one layer (do not stack chicken) in the center of a piece of a piece of parchment paper measuring roughly 10” (25cm) by 14“ (35cm). Wrap to form a neat parcel.Place parcel on a baking tray and bake at preheated oven of 200\xb0C for about 15 minutes. Carefully unwrap chicken parcel (beware of steam coming out of package). Discard liquid collected. Alternatively, you may pan-fry or grill the chicken on the stove top. Cut chicken to even slices and set aside.Blend ingredients for salad dressing (A) to a fine consistency in a blender. If you don’t have a blender, you can use a fork to mash up the anchovies and then use a mortar and pestle to pound the dressing by hand.Warm tortilla wraps in an un-oiled, heated pan for about 1 minute on each side.To make the wrap, arrange sauce and fillings (chicken, lettuce, eggs and tomatoes) in center. Fold three sides toward the center and roll up the wrap. Cut into two. Click here for step-by-step wrapping photos.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-caesar-wrap-565169', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}