{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/687359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 687359, u'veryPopular': False, u'lowFodmap': True, u'title': u'Addictive Chocolate Granola Clusters + Behind-the-Scenes Secrets', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 70.61, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1\xbd cups dairy-free granola (homemade or store-bought; see what I use in the post above)', u'aisle': u'Cheese;Health Foods', u'name': u'Dairy Free Cheese', u'metaInformation': [u'homemade', u'store-bought', u'( or ; see what I use in the post above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 93701, u'unit': u'cups'}, {u'originalString': u'\xbd cup dairy-free chocolate chips (semi-sweet or dark)', u'aisle': u'Health Foods;Baking', u'name': u'dairy-free chocolate chips', u'metaInformation': [u'dark', u'(semi-sweet or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 98848, u'unit': u'cup'}, {u'originalString': u"\xbc cup peanut, almond, or sunflower seed butter (creamy or chunky - I've tried them all)", u'aisle': u'Nut butters, Jams, and Honey', u'name': u'sunflower seed butter', u'metaInformation': [u"(creamy or chunky - I've tried them all)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 98928, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.godairyfree.org/news/chocolate-granola-clusters', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chocolate chips in a medium microwave-safe bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Heat on HIGH for 30 seconds.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Heat on HIGH for 30 seconds more.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/silicone-cupcake-molds.jpg', u'id': 408726, u'name': u'silicone muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk very well. If needed, heat on HIGH another 15 to 30 seconds, until just melted, and whisk. Do not overheat - the chocolate should be nice and smooth.Stir in the peanut, nut or seed butter until well combined. Gently stir in the granola until every piece is well coated.Press the mixture into molds or drop into clumps onto parchment paper. I use silicone muffin cups, so they just pop right out without any prep.Chill the chocolate granola clusters in the refrigerator for 30 minutes or or the freezer for 15 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the molds, serve with unsweetened almond milk, and try not to eat them all in one sitting. I prefer to store any leftovers in the freezer for maximum crunch, but they do stay firm at room temperature.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 150, u'instructions': u'Place the chocolate chips in a medium microwave-safe bowl. Heat on HIGH for 30 seconds. Whisk. Heat on HIGH for 30 seconds more. Whisk very well. If needed, heat on HIGH another 15 to 30 seconds, until just melted, and whisk. Do not overheat - the chocolate should be nice and smooth.Stir in the peanut, nut or seed butter until well combined. Gently stir in the granola until every piece is well coated.Press the mixture into molds or drop into clumps onto parchment paper. I use silicone muffin cups, so they just pop right out without any prep.Chill the chocolate granola clusters in the refrigerator for 30 minutes or or the freezer for 15 minutes. Remove from the molds, serve with unsweetened almond milk, and try not to eat them all in one sitting. I prefer to store any leftovers in the freezer for maximum crunch, but they do stay firm at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/addictive-chocolate-granola-clusters-+-behind-the-scenes-secrets-687359', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 7, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}