{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/211181-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 211181, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken, squash & pesto lasagne', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 365.26, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'bunch basil, leaves picked and chopped, save 3 small whole leaves to serve', u'aisle': u'Produce', u'name': u'basil', u'metaInformation': [u'whole', u'leaves picked', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'bunch'}, {u'originalString': u'1 butternut squash, peeled, deseeded and cut into chunks', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'peeled', u'deseeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'4 skinless chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 5062, u'unit': u''}, {u'originalString': u'600ml chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 600.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'12 lasagne sheets', u'aisle': u'Pasta and Rice', u'name': u'lasagne sheets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 10620420, u'unit': u''}, {u'originalString': u'500g tub mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 93820, u'unit': u'g'}, {u'originalString': u'1 tablespoon milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoon'}, {u'originalString': u'good grating of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'85g Parmesan, grated', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'190g jar pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 190.0, u'consistency': u'solid', u'id': 93698, u'unit': u'g'}, {u'originalString': u'50g pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12147, u'unit': u'g'}, {u'originalString': u'1 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipe/chicken-squash-pesto-lasagne', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Heat the oil in a large casserole dish.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onions and cook until softened,then add the garlic and cook for a fewmins more. Push the onions and garlicto the edge of the pan, add the chickenbreasts and cook for a few mins eachside to brown. Sprinkle over the flourand stir it into the onion mixture. Tipin the stock and season. Cover and simmer for 10 mins – or until the chickenis cooked through. Using 2 forks, shredthe chicken into bite-sized chunks.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Addhalf the mascarpone and the pesto,stirring until the mascarpone has meltedinto the sauce, bubble for a few minsto thicken a little, then remove from theheat and stir in the basil.Meanwhile, place the squash in a largebowl with 2tbsp of water, cover with clingfilm and microwave on High for 12-15 mins,until really soft. Season the squash witha little of the nutmeg and some salt andpepper, and mash lightly with a fork.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Spoon half the chicken mixture into thebottom of a 20 x 30cm ovenproof dish.Cover with 4 lasagne sheets, then thebutternut squash and half the Parmesan.Top with another 4 lasagne sheets, theremaining chicken mixture, then a finallayer of lasagne.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [], u'step': u'Mix enough milk intothe remaining mascarpone to make asmooth sauce – you need to aim fora consistency similar to white sauce.Season with remaining nutmeg, salt andpepper, then pour over the lasagne.Scatter over the remaining Parmesan andthe pine nuts.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Bake for 40 mins untilpiping hot in the centre and crunchy andgolden on top. Scatter with a few extrabasil leaves before serving.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 330, u'instructions': u'Heat the oil in a large casserole dish.Add the onions and cook until softened,then add the garlic and cook for a fewmins more. Push the onions and garlicto the edge of the pan, add the chickenbreasts and cook for a few mins eachside to brown. Sprinkle over the flourand stir it into the onion mixture. Tipin the stock and season. Cover and simmer for 10 mins – or until the chickenis cooked through. Using 2 forks, shredthe chicken into bite-sized chunks. Addhalf the mascarpone and the pesto,stirring until the mascarpone has meltedinto the sauce, bubble for a few minsto thicken a little, then remove from theheat and stir in the basil.Meanwhile, place the squash in a largebowl with 2tbsp of water, cover with clingfilm and microwave on High for 12-15 mins,until really soft. Season the squash witha little of the nutmeg and some salt andpepper, and mash lightly with a fork.Heat oven to 180C/160C fan/gas 4.Spoon half the chicken mixture into thebottom of a 20 x 30cm ovenproof dish.Cover with 4 lasagne sheets, then thebutternut squash and half the Parmesan.Top with another 4 lasagne sheets, theremaining chicken mixture, then a finallayer of lasagne. Mix enough milk intothe remaining mascarpone to make asmooth sauce – you need to aim fora consistency similar to white sauce.Season with remaining nutmeg, salt andpepper, then pour over the lasagne.Scatter over the remaining Parmesan andthe pine nuts. Bake for 40 mins untilpiping hot in the centre and crunchy andgolden on top. Scatter with a few extrabasil leaves before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-squash-pesto-lasagne-211181', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}