{u'recipes': [{u'sourceName': u'Comfy in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587956-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 587956, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Poke Hole Cake (Finding God in the Kitchen)', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 29.28, u'creditText': u'Comfy in the Kitchen', u'extendedIngredients': [{u'originalString': u'18 oz Devils Food Cake mix', u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 18087, u'unit': u'oz'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 pkg. instant pudding any kind', u'aisle': u'Baking', u'name': u'instant lemon pudding', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 19332, u'unit': u'pkg'}, {u'originalString': u'3 oz. pkg Instant Pudding mix', u'aisle': u'Baking', u'name': u'instant lemon pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 19332, u'unit': u'oz'}, {u'originalString': u'1\xbd c. cold milk Blend at high speed 4 to 6 minutes. Store in refrigerator.', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}, {u'originalString': u'2 cups cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 pkg. Dream Whip', u'aisle': u'Condiments', u'name': u'miracle whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 4014, u'unit': u'pkg'}, {u'originalString': u'\xbd cup oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://comfyinthekitchen.com/2012/02/chocolate-poke-hole-cake-finding-god-in-the-kitchen/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 350 degrees.Make cake according to package directions and bake in a 13 x 9-inch cake pan or 24 cupcake liners in muffin pans.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake according to package directions.Poke holes every \xbd inch apart with a wooden spoon handle in the cake or 3 or 4 holes in the cupcakes.Set aside.Beat pudding mix and milk with a whisk for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour evenly over cake or equally over cupcakes.Run a knife around edges of cake to loosen.Chill 2 hours.Store covered in refrigerator.Instant Pudding Frosting 1 pkg. Dream Whip 1 pkg. instant pudding any kind 1\xbd c. cold milk Blend at high speed 4 to 6 minutes. Store in refrigerator.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 240, u'instructions': u'Heat oven to 350 degrees.Make cake according to package directions and bake in a 13 x 9-inch cake pan or 24 cupcake liners in muffin pans.Bake according to package directions.Poke holes every \xbd inch apart with a wooden spoon handle in the cake or 3 or 4 holes in the cupcakes.Set aside.Beat pudding mix and milk with a whisk for 2 minutes.Pour evenly over cake or equally over cupcakes.Run a knife around edges of cake to loosen.Chill 2 hours.Store covered in refrigerator.Instant Pudding Frosting 1 pkg. Dream Whip 1 pkg. instant pudding any kind 1\xbd c. cold milk Blend at high speed 4 to 6 minutes. Store in refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-poke-hole-cake-finding-god-in-the-kitchen-587956', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}