{u'recipes': [{u'sourceName': u'Lemons and Anchovies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/622646-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 622646, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spelt Dinner Rolls', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 150, u'pricePerServing': 46.99, u'creditText': u'Lemons and Anchovies', u'extendedIngredients': [{u'originalString': u'2 teaspoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'Olive oil (for brushing the top of the dough; optional)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'(for brushing the top of the dough; optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'3\xbd - 4 cups whole spelt flour', u'aisle': u'Health Foods;Baking', u'name': u'spelt flour', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'solid', u'id': 93823, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://lemonsandanchovies.com/2014/12/spelt-dinner-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Dissolve the yeast in water in the bowl of your stand mixer fitted with dough hook.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Let stand until creamy, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sugar, salt, butter and beaten egg to the yeast mixture, stirring until combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the flour in -cup increments with the mixer turned on to Speed 2. After you've added 3 cups of the flour, check the consistency of the dough. The dough should be turning into a ball and coming off the the sides of the bowl. Sprinkle a bit more of the remaining  cup flour until your dough comes together. Note: spelt flour works a bit differently than other flours. I added all but 1 tablespoon of the remaining  cup of flour and while the dough came off the sides of the bowl and formed a ball around the dough hook, it wasn't sturdy as a ball on its own. This is fine. The total kneading time from turning the mixer on to Speed 2 until the dough comes off the sides of the bowl was about six minutes.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'id': 93823, u'name': u'spelt flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place the dough ball into a bowl sprayed with olive oil, roll the ball of dough around so that it is covered with oil. Cover the bowl with a damp towel and place in a warm area to rise until doubled, about one hour (don't worry if it takes a bit longer). Punch the dough down and leave it to rise again for another 30 minutes. After the second rise, turn the dough out on a lightly floured counter, punch it down and lightly knead it into a round.Divide the dough into 12 equal portions and roll each one into a small ball. Arrange the balls in a 10-inch cast iron skillet (or a cookie sheet lined with parchment paper).Preheat your oven to 400*. Cover the small balls with a damp towel and let them rest for the third time in a warm area until the oven has preheated, about 15 minutes. If you like, brush the tops of the dough balls with a little olive oil before baking.", u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the rolls for 15 minutes, give or take 3 minutes. (In my oven the rolls were done in 18 minutes). Prep time includes rise time.', u'length': {u'number': 36, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 26, u'instructions': u"Dissolve the yeast in water in the bowl of your stand mixer fitted with dough hook. Let stand until creamy, about 10 minutes. Add the sugar, salt, butter and beaten egg to the yeast mixture, stirring until combined. Add the flour in -cup increments with the mixer turned on to Speed 2. After you've added 3 cups of the flour, check the consistency of the dough. The dough should be turning into a ball and coming off the the sides of the bowl. Sprinkle a bit more of the remaining  cup flour until your dough comes together. Note: spelt flour works a bit differently than other flours. I added all but 1 tablespoon of the remaining  cup of flour and while the dough came off the sides of the bowl and formed a ball around the dough hook, it wasn't sturdy as a ball on its own. This is fine. The total kneading time from turning the mixer on to Speed 2 until the dough comes off the sides of the bowl was about six minutes.Place the dough ball into a bowl sprayed with olive oil, roll the ball of dough around so that it is covered with oil. Cover the bowl with a damp towel and place in a warm area to rise until doubled, about one hour (don't worry if it takes a bit longer). Punch the dough down and leave it to rise again for another 30 minutes. After the second rise, turn the dough out on a lightly floured counter, punch it down and lightly knead it into a round.Divide the dough into 12 equal portions and roll each one into a small ball. Arrange the balls in a 10-inch cast iron skillet (or a cookie sheet lined with parchment paper).Preheat your oven to 400*. Cover the small balls with a damp towel and let them rest for the third time in a warm area until the oven has preheated, about 15 minutes. If you like, brush the tops of the dough balls with a little olive oil before baking. Bake the rolls for 15 minutes, give or take 3 minutes. (In my oven the rolls were done in 18 minutes). Prep time includes rise time.", u'spoonacularSourceUrl': u'https://spoonacular.com/spelt-dinner-rolls-622646', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 168, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}