{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577327-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 577327, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Cacciatore', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'ketogenic'], u'pricePerServing': 168.8, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'6 Anchovy Fillets', u'aisle': u'Canned and Jarred;Seafood', u'name': u'anchovy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 6.0, u'consistency': u'solid', u'id': 15001, u'unit': u'fillet'}, {u'originalString': u'4 pounds of Marinated Chicken Pieces', u'aisle': u'Meat', u'name': u'chicken pieces', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'liquid', u'id': 1005006, u'unit': u'pounds'}, {u'originalString': u'2 clove of Garlic, peeled and sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'An 8 ounce bag of Cipolline Onions, blanched and peeled', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11282, u'unit': u'ounce'}, {u'originalString': u'A 28 ounce can of Whole Peeled Plum Tomatoes', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'whole', u'peeled', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10411529, u'unit': u'ounce'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.simplyscratch.com/2011/02/chicken-cacciatore-part-2-the-meal.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove chicken from marinade and reserve liquids. Pat dry, and dredge in all purpose flour and shake off any excess, place on a clean plate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u"Heat an ovenproof dutch oven over medium-medium high heat, and add two tablespoons of olive oil. When oil is hot {working in batches} brown the chicken on all sides, adjusting the heat so you don't burn the chicken, set aside.Reduce the heat to medium and add in the sliced garlic, blanched cipolline onions and anchovies. Break up the anchovies with a wooden spoon. When the garlic is toasty add in the whole can of tomatoes, breaking up those as well.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in the reserved marinade and bring to a boil. Nestle in the chicken pieces and cover.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in a preheated oven for 11/2 hours.When finished in the oven; skim off any fat or oil that accumulates on the top, taste the sauce and add any salt and pepper you think it needs.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the bay and rosemary stems and serve chicken with a spoonful of the sauce over top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'aggregateLikes': 57, u'instructions': u"Preheat your oven to 350 degrees. Remove chicken from marinade and reserve liquids. Pat dry, and dredge in all purpose flour and shake off any excess, place on a clean plate. Heat an ovenproof dutch oven over medium-medium high heat, and add two tablespoons of olive oil. When oil is hot {working in batches} brown the chicken on all sides, adjusting the heat so you don't burn the chicken, set aside.Reduce the heat to medium and add in the sliced garlic, blanched cipolline onions and anchovies. Break up the anchovies with a wooden spoon. When the garlic is toasty add in the whole can of tomatoes, breaking up those as well. Add in the reserved marinade and bring to a boil. Nestle in the chicken pieces and cover. Bake in a preheated oven for 11/2 hours.When finished in the oven; skim off any fat or oil that accumulates on the top, taste the sauce and add any salt and pepper you think it needs. Remove the bay and rosemary stems and serve chicken with a spoonful of the sauce over top.", u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-cacciatore-577327', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}