{u'recipes': [{u'sourceName': u'Barbara Bakes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/477684-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 477684, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Coconut Chocolate Chip Skillet Cookie', u'diets': [u'dairy free'], u'pricePerServing': 239.29, u'creditText': u'Barbara Bakes', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'8 tablespoons coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Hot Fudge, optional', u'aisle': u'Sweet Snacks', u'name': u'fudge', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fudge-isolated.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 19100, u'unit': u'servings'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'Vanilla ice cream, optional', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.barbarabakes.com/2014/05/mini-coconut-chocolate-chip-skillet-cookie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 97, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350\xb0 and generously grease the bottom and sides of a 5-inch cast-iron skillet with coconut oil.In a large bowl, whisk together the flour, baking soda, and salt. Set aside.In a large mixing bowl, beat coconut oil, sugar, and brown sugar on medium speed for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the egg and vanilla, beating until well combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the dry ingredients to the wet ingredients, mix on low speed just until combine.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix in the coconut and chocolate chips on low speed. Divide the dough in half. (Freeze half the dough for another day or use two mini skillets.) Press half the cookie dough into the prepared skillet and bake for 18 to 20 minutes, until the edges are crisp and the cookie is golden and cooked through.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven. If desired, serve warm topped with vanilla ice cream and hot fudge.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'vanilla ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fudge-isolated.jpg', u'id': 19100, u'name': u'fudge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 47, u'instructions': u'Preheat the oven to 350\xb0 and generously grease the bottom and sides of a 5-inch cast-iron skillet with coconut oil.In a large bowl, whisk together the flour, baking soda, and salt. Set aside.In a large mixing bowl, beat coconut oil, sugar, and brown sugar on medium speed for 2 minutes. Add the egg and vanilla, beating until well combine.Add the dry ingredients to the wet ingredients, mix on low speed just until combine. Mix in the coconut and chocolate chips on low speed. Divide the dough in half. (Freeze half the dough for another day or use two mini skillets.) Press half the cookie dough into the prepared skillet and bake for 18 to 20 minutes, until the edges are crisp and the cookie is golden and cooked through. Remove from oven. If desired, serve warm topped with vanilla ice cream and hot fudge.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-coconut-chocolate-chip-skillet-cookie-477684', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}