{u'recipes': [{u'sourceName': u'A Zesty Bite', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/607247-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 607247, u'veryPopular': False, u'lowFodmap': False, u'title': u'Burrata pizza', u'diets': [], u'preparationMinutes': 4, u'pricePerServing': 1171.95, u'creditText': u'A Zesty Bite', u'extendedIngredients': [{u'originalString': u'1 cup arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'6 ounces burrata cheese', u'aisle': u'Cheese', u'name': u'burrata cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/burrata.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 93617, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93698, u'unit': u'cup'}, {u'originalString': u'1 pizza dough (I bought mine at local grocer)', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [u'bought', u'(I mine at local grocer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u''}, {u'originalString': u'5 prosciutto slices, sliced in half', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 5.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://www.azestybite.com/burrata-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 64, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour olive oil into an iron skillet and spread out coating the bottom and sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place dough in the skillet and spread it out creating a circular shape covering the bottom of the pan. Pierce with a fork and then place in the oven for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and top with pesto covering the whole surface. Then top with burrata chunks and place back in the oven for 12 minutes. Broil for 1 minute and then remove.Top with prosciutto slices and arugula before serving.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/burrata.jpg', u'id': 93617, u'name': u'burrata'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizzan on the menu? Try pairing with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Di Majo Norante Sangiovese. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Vivid ruby red in color with a fresh bouquet of violets and woodland berries. Smooth and refreshing with loads of ripe fruit. An excellent accompaniment to antipasti, first courses and grilled white meats View More', u'title': u'Di Majo Norante Sangiovese', u'price': u'$8.99', u'id': 434381, u'link': u'https://www.wine.com/product/di-majo-norante-sangiovese-2000/38435', u'imageUrl': u'https://spoonacular.com/productImages/434381-312x231.jpg'}]}, u'aggregateLikes': 67, u'instructions': u'Preheat oven to 450 degrees F.Pour olive oil into an iron skillet and spread out coating the bottom and sides. Place dough in the skillet and spread it out creating a circular shape covering the bottom of the pan. Pierce with a fork and then place in the oven for 5 minutes. Remove from oven and top with pesto covering the whole surface. Then top with burrata chunks and place back in the oven for 12 minutes. Broil for 1 minute and then remove.Top with prosciutto slices and arugula before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/burrata-pizza-607247', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 22, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}