{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/627616-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 627616, u'veryPopular': False, u'lowFodmap': False, u'title': u'Overnight Cinnamon Rolls', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 50.54, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u"1 1/4 cups (150g) confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'Cream Cheese Icing', u'aisle': u'Baking', u'name': u'cream cheese icing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19228, u'unit': u'servings'}, {u'originalString': u'2 large eggs, room temperature preferred', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Dough', u'aisle': u'Refrigerated;Frozen', u'name': u'filo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 18338, u'unit': u'servings'}, {u'originalString': u'4 1/2 cups (558g) all-purpose flour, plus more for dusting/rolling', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'plus more for dusting/rolling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 558.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1/2 cup (100g) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1 1/2 Tablespoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'Tablespoons'}, {u'originalString': u'3 Tablespoons (45ml) milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 45.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'6 Tablespoons (90g) unsalted butter, softened to room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 90.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tablespoons Red Start Platinum yeast (2 standard size packets)*', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'red', u'(2 standard size packets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18375, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2014/12/24/overnight-cinnamon-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Make The Dough:In a small saucepan, warm the milk over low heat until lukewarm (no need to use a thermometer, but to be precise: about 95 degrees F).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pour the warm milk into the bowl of a stand electric mixer fitted with the dough hook attachment (OR you can use a handheld mixer OR no mixer, but a stand mixer is ideal). With a spoon, manually stir in the sugar and yeast. Cover with a towel and let sit until the yeast is foamy, about 5-10 minutes. This is called proofing your yeast. If the yeast does not dissolve and foam, start over with fresh active yeast. On low speed, beat inthe softened butter until it is slightly broken up. Next add the eggs, one at a time, and then the salt. The butter won't really be mixing into the mixture, so don't be alarmed if it stays in pieces. On low speed, gradually add the flour.Once it is all added, beat onmedium speed until a soft dough forms. Increase speed to medium-high and beat until the dough is soft and supple, about 6 minutes longer. *If you do not have a stand-mixer with a hook attachment, knead the dough by hand in this step.", u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast-granules.jpg', u'id': 18375, u'name': u'active dry yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Spread the softened butter all over the dough. Don't skimp-- you want it all on there. In a small bowl, toss the cinnamon and sugar together until combined and then sprinkle evenly over the dough.Tightly roll up the dough to form an18-inch-long log. If some filling spills out, that's ok just sprinkle it on top of the rolls.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Cut into 12 even rolls (about 1.5 inches in width each). Arrange them in the prepared baking pan, cut sides up. Cover the rolls very tightly with aluminum foil (no rolls exposed, please-- thisdries out your dough) and stick in the refrigerator for 8-12 hours.*', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove rolls from the refrigerator andlet rise in a warm place just as you did in step 2 until they are puffy, about 1-2 hours. Mine usually take 1 and 1/2 hours.After the rolls have risen, preheat the oven to375Fdegrees.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Bake for about 25 minutes, until they are golden brown. About halfway through the bake time, I like to cover the rolls loosely with aluminum foil so the tops don't brown too much.", u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from the oven and allow to cool on a wire rack for about 10minutes as you make the icing.Make The Icing:In a medium bowl using a handheld or stand mixer fitted with a paddle attachment, beat the cream cheese on medium speed until smooth and creamy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u"Add the confectioners' sugar, milk, and vanilla. Beat on low speed for 30 seconds, then switch to high speed and beat for 2 minutes.Using a knife, spread the icingover the warm rolls and serve immediately.Cover leftover frosted or unfrosted rolls tightly and store at room temperature for up to 3 days-- I prefer this over storing in the refrigerator. I find that dries them out, but do what you like best.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Baked rolls can be frozen up to 2 months. Thaw overnight in the refrigerator and warm up before enjoying.', u'number': 7, u'ingredients': []}], u'name': u"Transfer the dough to a lightly floured surface and knead it with your hands for 1 minute. Form the dough into a ball and transfer it to a lightly greased bowl. Cover the dough loosely with plastic wrap, a paper towel, or aluminum foil and let sit in a warm place until doubled in size, about 1 to 2 hours.Here's what I doturn the oven on to 250F degrees. Turn the oven off. Stick the covered dough inside the oven and allow it to rise in this warm environment.Butter/grease/spray with nonstick spray thebottom of a 9x13 inch baking dish, then line with parchment paper. Turn the dough out onto a lightly floured work surface and, using a rolling pin, roll into a 13x18 inch rectangle. I used a ruler for accuracy. Make sure the dough is smooth and evenly thick, even at the corners.ForThe Filling"}], u'aggregateLikes': 306, u'instructions': u"Make The Dough:In a small saucepan, warm the milk over low heat until lukewarm (no need to use a thermometer, but to be precise: about 95 degrees F). Pour the warm milk into the bowl of a stand electric mixer fitted with the dough hook attachment (OR you can use a handheld mixer OR no mixer, but a stand mixer is ideal). With a spoon, manually stir in the sugar and yeast. Cover with a towel and let sit until the yeast is foamy, about 5-10 minutes. This is called proofing your yeast. If the yeast does not dissolve and foam, start over with fresh active yeast. On low speed, beat inthe softened butter until it is slightly broken up. Next add the eggs, one at a time, and then the salt. The butter won't really be mixing into the mixture, so don't be alarmed if it stays in pieces. On low speed, gradually add the flour.Once it is all added, beat onmedium speed until a soft dough forms. Increase speed to medium-high and beat until the dough is soft and supple, about 6 minutes longer. *If you do not have a stand-mixer with a hook attachment, knead the dough by hand in this step.Transfer the dough to a lightly floured surface and knead it with your hands for 1 minute. Form the dough into a ball and transfer it to a lightly greased bowl. Cover the dough loosely with plastic wrap, a paper towel, or aluminum foil and let sit in a warm place until doubled in size, about 1 to 2 hours.Here's what I do:turn the oven on to 250F degrees. Turn the oven off. Stick the covered dough inside the oven and allow it to rise in this warm environment.Butter/grease/spray with nonstick spray thebottom of a 9x13 inch baking dish, then line with parchment paper. Turn the dough out onto a lightly floured work surface and, using a rolling pin, roll into a 13x18 inch rectangle. I used a ruler for accuracy. Make sure the dough is smooth and evenly thick, even at the corners.ForThe Filling: Spread the softened butter all over the dough. Don't skimp-- you want it all on there. In a small bowl, toss the cinnamon and sugar together until combined and then sprinkle evenly over the dough.Tightly roll up the dough to form an18-inch-long log. If some filling spills out, that's ok just sprinkle it on top of the rolls. Cut into 12 even rolls (about 1.5 inches in width each). Arrange them in the prepared baking pan, cut sides up. Cover the rolls very tightly with aluminum foil (no rolls exposed, please-- thisdries out your dough) and stick in the refrigerator for 8-12 hours.*Remove rolls from the refrigerator andlet rise in a warm place just as you did in step 2 until they are puffy, about 1-2 hours. Mine usually take 1 and 1/2 hours.After the rolls have risen, preheat the oven to375Fdegrees. Bake for about 25 minutes, until they are golden brown. About halfway through the bake time, I like to cover the rolls loosely with aluminum foil so the tops don't brown too much. Remove pan from the oven and allow to cool on a wire rack for about 10minutes as you make the icing.Make The Icing:In a medium bowl using a handheld or stand mixer fitted with a paddle attachment, beat the cream cheese on medium speed until smooth and creamy. Add the confectioners' sugar, milk, and vanilla. Beat on low speed for 30 seconds, then switch to high speed and beat for 2 minutes.Using a knife, spread the icingover the warm rolls and serve immediately.Cover leftover frosted or unfrosted rolls tightly and store at room temperature for up to 3 days-- I prefer this over storing in the refrigerator. I find that dries them out, but do what you like best. Baked rolls can be frozen up to 2 months. Thaw overnight in the refrigerator and warm up before enjoying.", u'spoonacularSourceUrl': u'https://spoonacular.com/overnight-cinnamon-rolls-627616', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 900, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}