{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/603294-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 603294, u'veryPopular': False, u'lowFodmap': False, u'title': u'BBQ Chili Shepherd’s Pie', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 153.35, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'2 cups barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cups'}, {u'originalString': u'2-3 tbsp brown sugar, optional and to taste', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 546ml can kidney beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 546.0, u'consistency': u'solid', u'id': 16034, u'unit': u'ml'}, {u'originalString': u'1 cup very finely diced carrots (or shredded)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'shredded', u'finely', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 stalk celery, very finely diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 tsp chicken bouillon', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6480, u'unit': u'tsp'}, {u'originalString': u'1 1/2 tbsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2009, u'unit': u'tbsp'}, {u'originalString': u'1 cup frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'1/2 tsp minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1 lb ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1/2-3/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 medium onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'a pinch of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'6 large potatoes, diced small', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'diced', u'small', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/2 -1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.thereciperebel.com/bbq-chili-shepherds-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Start potatoes boiling in a large pot of salted water. Meanwhile, combine beef, onion, carrots, celery, salt, garlic, pepper, chili powder in a large pan and brown over medium-high heat. Once browned, cover and cook over medium heat (stirring occasionally), for 10-15 minutes until veg are cooked.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain potatoes and mash with milk through bouillon (I use the food processor for this so they\'re nice and smooth). Set aside.Preheat oven to 350 degrees F. (*if baking right away)To the beef, add peas, corn kidney beans, barbecue sauce and brown sugar (optional). Cook another 5 minutes until vegetables are warmed through.To a 3qt casserole dish or a 9x13" pan, add the beef mixture. Top with mashed potatoes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Bake 20 minutes or until heated through. Top with cheese and broil 2-3 minutes, watching closely, until cheese is melted and lightly browned.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Vineyards Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 157, u'instructions': u'Start potatoes boiling in a large pot of salted water. Meanwhile, combine beef, onion, carrots, celery, salt, garlic, pepper, chili powder in a large pan and brown over medium-high heat. Once browned, cover and cook over medium heat (stirring occasionally), for 10-15 minutes until veg are cooked.Drain potatoes and mash with milk through bouillon (I use the food processor for this so they\'re nice and smooth). Set aside.Preheat oven to 350 degrees F. (*if baking right away)To the beef, add peas, corn kidney beans, barbecue sauce and brown sugar (optional). Cook another 5 minutes until vegetables are warmed through.To a 3qt casserole dish or a 9x13" pan, add the beef mixture. Top with mashed potatoes. Bake 20 minutes or until heated through. Top with cheese and broil 2-3 minutes, watching closely, until cheese is melted and lightly browned.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-chili-shepherds-pie-603294', u'dishTypes': [], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}