{u'recipes': [{u'sourceName': u'Tori Avey', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615639-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615639, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baby Lox Potatoes Appetizer', u'diets': [u'pescatarian', u'ketogenic'], u'pricePerServing': 35.25, u'creditText': u'Tori Avey', u'extendedIngredients': [{u'originalString': u'2 pounds small red new potatoes or baby potatoes (2 inches each)', u'aisle': u'Produce', u'name': u'baby potatoes', u'metaInformation': [u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'inches', u'unitShort': u'inches', u'amount': 4.0, u'consistency': u'solid', u'id': 11352, u'unit': u'inches'}, {u'originalString': u'Baking sheet, food processor', u'aisle': u'Baking', u'name': u'baking mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18010, u'unit': u'sheet'}, {u'originalString': u'Capers for garnish', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 40.0, u'consistency': u'solid', u'id': 2054, u'unit': u'servings'}, {u'originalString': u'1/4 cup cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1017, u'unit': u'cup'}, {u'originalString': u'2 1/2 tbsp extra virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tbsp'}, {u'originalString': u'8 oz. Nova lox or smoked salmon', u'aisle': u'Seafood', u'name': u'lox', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 15077, u'unit': u'oz'}, {u'originalString': u'3/4 cup nonfat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://toriavey.com/toris-kitchen/2014/10/baby-lox-potatoes-appetizer/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/melon-baller.jpg', u'id': 404680, u'name': u'melon baller'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Scrub the potatoes clean, leaving the skin intact. Slice the potatoes in half horizontally. Use a vegetable corer or melon baller to scoop out a teaspoon-sized hole in the center of the cut side of each potato half.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place halved potatoes into a large bowl and discard the cored pieces. Toss the potato halves with 1  tbsp olive oil till evenly coated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush the baking sheet with the remaining 1 tbsp of olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Put the potatoes onto the baking sheet, cut side down, skin side up. Roast the potatoes for about 30 minutes till tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Let the potatoes cool to room temperature.Meanwhile put Greek yogurt, cream cheese, lox, and dill into the food processor. Process ingredients until they are blended together.When potatoes are cool, use a small spoon to fill the hollowed out potato halves with the lox mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'id': 15077, u'name': u'smoked salmon'}]}, {u'equipment': [], u'step': u'Garnish each potato half with 2-3 capers.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}, {u'equipment': [], u'step': u"Serve.Make Ahead: I'm not a huge fan of refrigerating potatoes (they can sometimes turn mealy), so if you want to make this ahead I recommend making the spread in advance and spreading it on crackers or bagel chips. Still delish, and your prep time will be cut down considerably. Enjoy!", u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Vampire Pinot Grigio Wine with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This dry, zestful combination is reminiscent of ripe pears and roses', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u"Preheat the oven to 400 degrees F. Scrub the potatoes clean, leaving the skin intact. Slice the potatoes in half horizontally. Use a vegetable corer or melon baller to scoop out a teaspoon-sized hole in the center of the cut side of each potato half. Place halved potatoes into a large bowl and discard the cored pieces. Toss the potato halves with 1  tbsp olive oil till evenly coated. Brush the baking sheet with the remaining 1 tbsp of olive oil. Put the potatoes onto the baking sheet, cut side down, skin side up. Roast the potatoes for about 30 minutes till tender. Let the potatoes cool to room temperature.Meanwhile put Greek yogurt, cream cheese, lox, and dill into the food processor. Process ingredients until they are blended together.When potatoes are cool, use a small spoon to fill the hollowed out potato halves with the lox mixture. Garnish each potato half with 2-3 capers. Serve.Make Ahead: I'm not a huge fan of refrigerating potatoes (they can sometimes turn mealy), so if you want to make this ahead I recommend making the spread in advance and spreading it on crackers or bagel chips. Still delish, and your prep time will be cut down considerably. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/baby-lox-potatoes-appetizer-615639', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 40, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}