{u'recipes': [{u'sourceName': u'Thirty Handmade Days', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719971-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 719971, u'veryPopular': True, u'lowFodmap': False, u'title': u'Frozen Mint Chocolate Chip Pie – only 3 ingredients', u'diets': [], u'pricePerServing': 94.45, u'creditText': u'Thirty Handmade Days', u'extendedIngredients': [{u'originalString': u'2 pre-made Oreo cookie pie crust', u'aisle': u'Baking', u'name': u'oreo pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 28111, u'unit': u''}, {u'originalString': u'1 (1.5 quart) container Mint Chocolate Chip Ice Cream', u'aisle': u'Frozen', u'name': u'chocolate ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-ice-cream.png', u'unitLong': u'quarts', u'unitShort': u'quart', u'amount': 1.5, u'consistency': u'liquid', u'id': 19270, u'unit': u'quart'}, {u'originalString': u'1 8 oz. container Cool Whip (whipped cream)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'(whipped cream)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}], u'healthScore': 3.0, u'imageType': u'png', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.thirtyhandmadedays.com/2014/03/frozen-mint-chocolate-chip-pie-3-ingredients/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Soften ice cream until easy to mix with cool whip.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread into cookie pie crust.Freeze for several hours.Optional: Top with crumbled oreos or chocolate sauce.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 89953, u'instructions': u'Soften ice cream until easy to mix with cool whip.Spread into cookie pie crust.Freeze for several hours.Optional: Top with crumbled oreos or chocolate sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-mint-chocolate-chip-pie-only-3-ingredients-719971', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 7, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}