{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219926-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 219926, u'veryPopular': False, u'lowFodmap': False, u'title': u'Harissa-spiked houmous', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 32.95, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 x 400g cans chickpeas, rinsed and drained', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 16057, u'unit': u''}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tbsp harissa paste (see TIP below)', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [u'(see TIP below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'tbsp'}, {u'originalString': u'lemon juice, to taste', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'servings'}, {u'originalString': u'5 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp tomato pur\xe9e', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11547, u'unit': u'tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/10960/harissaspiked-houmous', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Put three-quarters of the chickpeas in afood processor with 3 tbsp olive oil, garlicand half a cupful of water. Blitz until smooth,adding a little more water if necessary tomake a thick cream consistency.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add therest of the chickpeas, then whizz againfor a few secs until nobbly. Season withsalt and a good squeeze of lemon juice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [], u'step': u'Mix together the harissa and tomatopur\xe9e with the rest of the olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'id': 1006972, u'name': u'harissa'}]}, {u'equipment': [], u'step': u'Drizzleover the houmous to serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 34, u'instructions': u'Put three-quarters of the chickpeas in afood processor with 3 tbsp olive oil, garlicand half a cupful of water. Blitz until smooth,adding a little more water if necessary tomake a thick cream consistency. Add therest of the chickpeas, then whizz againfor a few secs until nobbly. Season withsalt and a good squeeze of lemon juice.Mix together the harissa and tomatopur\xe9e with the rest of the olive oil. Drizzleover the houmous to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/harissa-spiked-houmous-219926', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}