{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220332-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 220332, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana & rum tatins', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 201.93, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 large, firm, just ripe bananas', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'firm', u'ripe', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'150g butter, chopped into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'4 tbsp dark rum', u'aisle': u'Alcoholic Beverages', u'name': u'dark rum', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'tbsp'}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'a little sifted icing sugar and cr\xe8me fra\xeeche, to serve, optional', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'700g rough puff pastry or re-rolled trimmings, or you can use ready-bought puff pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 700.0, u'consistency': u'solid', u'id': 18337, u'unit': u'g'}, {u'originalString': u'150g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1 vanilla pod', u'aisle': u'Baking', u'name': u'vanilla pod', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2401/banana-and-rum-tatins', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Put the sugar and 2 tbsps water in a heavy-based frying pan and allow to stand for 10 mins so that the sugar becomes saturated.Flatten the vanilla pod with the back of a large knife. Slit it open and scrape out the sticky seeds inside.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add these to the sugar pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the pan over a low heat until the sugar dissolves, swirling the pan occasionally to stop the sugar catching. Raise the heat and cook it to a dark golden brown.Cool for 30 secs and stir in about a third of the butter, then mix in the rum and the remaining butter, stirring the mixture to a smooth caramel.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u'Pour into a heatproof jug,but don’t chill or allow the caramel to set.On a lightly floured board roll out the pastry to a rectangle approximately 50 x 30 cm and the thickness of a \xa31 coin.Slice each banana lengthways keeping the halves as even as possible.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place each half rounded side up on the pastry and cut round the fruit, leaving a good 1cm border all the way round.Lift the bananas up, paint them with the egg yolk mixed together with 1 tsp water, then drape the pastry cut-outs over them, pressing the dough around the sides. Leave to rest in the fridge for 30 mins. Divide caramel between 2 ovenproof frying pans or a shallow baking tin and swirl around the pan as you would a pancake. If the caramel is too thick, re-heat it slightly.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan180C /gas 6. Put tatins in the frying pans or baking tin, leaving a little space between each one. Cook the tatins for about 12-15 mins until the pastry is light golden brown and crisp.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/palette-knife.jpg', u'id': 406915, u'name': u'palette knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the pans or tin from the oven and stand for a minute or so. Slide a long palette knife under each banana and carefully lift it up, then flip over onto a waiting dessert plate so the banana is showing.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush over any caramelised pan juices and serve with a dusting of icing sugar and a dollop of cr\xe8me fra\xeeche, if using.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'aggregateLikes': 6, u'instructions': u'Put the sugar and 2 tbsps water in a heavy-based frying pan and allow to stand for 10 mins so that the sugar becomes saturated.Flatten the vanilla pod with the back of a large knife. Slit it open and scrape out the sticky seeds inside. Add these to the sugar pan. Heat the pan over a low heat until the sugar dissolves, swirling the pan occasionally to stop the sugar catching. Raise the heat and cook it to a dark golden brown.Cool for 30 secs and stir in about a third of the butter, then mix in the rum and the remaining butter, stirring the mixture to a smooth caramel. Pour into a heatproof jug,but don’t chill or allow the caramel to set.On a lightly floured board roll out the pastry to a rectangle approximately 50 x 30 cm and the thickness of a \xa31 coin.Slice each banana lengthways keeping the halves as even as possible. Place each half rounded side up on the pastry and cut round the fruit, leaving a good 1cm border all the way round.Lift the bananas up, paint them with the egg yolk mixed together with 1 tsp water, then drape the pastry cut-outs over them, pressing the dough around the sides. Leave to rest in the fridge for 30 mins. Divide caramel between 2 ovenproof frying pans or a shallow baking tin and swirl around the pan as you would a pancake. If the caramel is too thick, re-heat it slightly. Heat oven to 200C/fan180C /gas 6. Put tatins in the frying pans or baking tin, leaving a little space between each one. Cook the tatins for about 12-15 mins until the pastry is light golden brown and crisp. Remove the pans or tin from the oven and stand for a minute or so. Slide a long palette knife under each banana and carefully lift it up, then flip over onto a waiting dessert plate so the banana is showing.Brush over any caramelised pan juices and serve with a dusting of icing sugar and a dollop of cr\xe8me fra\xeeche, if using.', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-rum-tatins-220332', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}