{u'recipes': [{u'sourceName': u'Baked by Rachel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/578660-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 578660, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheese and Herb Monkey Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 36.0, u'creditText': u'Baked by Rachel', u'extendedIngredients': [{u'originalString': u'4C bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'C'}, {u'originalString': u'3 tbsp butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2029, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 tbsp granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1/4C milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'C'}, {u'originalString': u'2/3C shredded Monterey Jack cheese (or a cheddar blend)', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded', u'(or a cheddar blend)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1001025, u'unit': u'C'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 1/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1C and 2 tbsp warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'C'}, {u'originalString': u'1 pkg rapid rise yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'pkg'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.bakedbyrachel.com/cheese-and-herb-monkey-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of a stand mixer fitted with a dough attachment, combine dry ingredients (not including the cheese). With mixer on low, slowly drizzle in water, olive oil and milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix until dough pulls cleanly away from sides and bottom of bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a lightly greased bowl. Cover and set aside in a warm location to rise for one hour or doubled in size.Lightly grease a 10" bundt pan.\xa0Divide dough in half.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}], u'step': u'Add slightly larger than tablespoon size balls of dough to the greased bundt pan. Cover with shredded cheese. Form remaining dough into balls, place on top of cheese. Lightly brush exposed dough with melted butter, pour remaining butter along edge of pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let pan sit for an additional 20-30 minutes.Preheat oven to 350 degrees.\xa0', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake for 35 minutes. Immediately loosen sides with a rubber spatula and a small spatula or knife on the inside if necessary. Invert onto a wire rack, platter or cutting board to enjoy immediately.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with optional dipping sauces if desired (but totally not necessary).', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Monkey Bread. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'In the bowl of a stand mixer fitted with a dough attachment, combine dry ingredients (not including the cheese). With mixer on low, slowly drizzle in water, olive oil and milk. Mix until dough pulls cleanly away from sides and bottom of bowl. Transfer to a lightly greased bowl. Cover and set aside in a warm location to rise for one hour or doubled in size.Lightly grease a 10" bundt pan.\xa0Divide dough in half. Add slightly larger than tablespoon size balls of dough to the greased bundt pan. Cover with shredded cheese. Form remaining dough into balls, place on top of cheese. Lightly brush exposed dough with melted butter, pour remaining butter along edge of pan. Let pan sit for an additional 20-30 minutes.Preheat oven to 350 degrees.\xa0Bake for 35 minutes. Immediately loosen sides with a rubber spatula and a small spatula or knife on the inside if necessary. Invert onto a wire rack, platter or cutting board to enjoy immediately. Serve with optional dipping sauces if desired (but totally not necessary).', u'spoonacularSourceUrl': u'https://spoonacular.com/cheese-and-herb-monkey-bread-578660', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}