{u'recipes': [{u'sourceName': u'Eclectic Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542864-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 542864, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana Bread Waffles', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 51.13, u'creditText': u'Eclectic Recipes', u'extendedIngredients': [{u'originalString': u'2 over ripe bananas', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 teaspoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'2 cups pancake and waffle mix', u'aisle': u'Cereal', u'name': u'pancake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancakes-isolated.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18292, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://eclecticrecipes.com/banana-bread-waffles-with-nutella', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Pre-heat waffle iron.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine all ingredients and mix until just combined with a  fork or whisk.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Pour batter into pre-heated waffle iron. Cook until done.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve waffles with Nutella and fresh fruit.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 6, u'instructions': u'Pre-heat waffle iron. Combine all ingredients and mix until just combined with a  fork or whisk.Pour batter into pre-heated waffle iron. Cook until done. Serve waffles with Nutella and fresh fruit.', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-bread-waffles-542864', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}