{u'recipes': [{u'sourceName': u'Merry Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587347-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 587347, u'veryPopular': False, u'lowFodmap': False, u'title': u'Malted Milk Cookie Tart', u'diets': [], u'pricePerServing': 29.72, u'creditText': u'Merry Gourmet', u'extendedIngredients': [{u'originalString': u'1 1/2 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 scant teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u''}, {u'originalString': u'1/2 cup malted milk balls, coarsely chopped', u'aisle': u'Sweet Snacks', u'name': u'malted milk balls', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whoppers.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 98864, u'unit': u'cup'}, {u'originalString': u'1 cup malted milk powder', u'aisle': u'Tea and Coffee', u'name': u'malted milk powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14311, u'unit': u'cup'}, {u'originalString': u'1/2 cup semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'8 ounces (2 sticks) unsalted butter, cut into 1-inch pieces, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into 1-inch pieces, at room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.merrygourmet.com/2010/07/malted-milk-chocolate-cookie-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F.    In food processor, pulse flour, malted milk powder, sugar, and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'id': 14311, u'name': u'malted milk powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add butter; pulse until moist clumps form.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}], u'step': u'Transfer dough to work surface; gather into ball; and press evenly into the bottom of a 9-inch diameter tart pan with removable bottom.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake crust until evenly golden brown, about 45 minutes.    Scatter chocolate chips over crust; let stand 5 minutes to soften, then spread melted chocolate over hot crust in well that forms as center sinks. Sprinkle chopped malted milk balls all over. Cool completely.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whoppers.png', u'id': 98864, u'name': u'malted milk balls'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove tart from pan; cut into wedges.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 40, u'instructions': u'Preheat oven to 325 degrees F.    In food processor, pulse flour, malted milk powder, sugar, and salt. Add butter; pulse until moist clumps form. Transfer dough to work surface; gather into ball; and press evenly into the bottom of a 9-inch diameter tart pan with removable bottom.    Bake crust until evenly golden brown, about 45 minutes.    Scatter chocolate chips over crust; let stand 5 minutes to soften, then spread melted chocolate over hot crust in well that forms as center sinks. Sprinkle chopped malted milk balls all over. Cool completely. Remove tart from pan; cut into wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/malted-milk-cookie-tart-587347', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}