{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/610017-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 610017, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gaeng om: Thai herbed pork and vegetables', u'diets': [u'gluten free', u'dairy free', u'whole 30', u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 505.25, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u"3 bird's eye chilies, chopped", u'aisle': u'Produce;Ethnic Foods', u'name': u"bird's eye chile", u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11670, u'unit': u''}, {u'originalString': u'2 tbsps. of cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsps'}, {u'originalString': u'3 c. of eggplant wedges', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11209, u'unit': u'c'}, {u'originalString': u'4 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'a knob of ginger, minced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11216, u'unit': u'servings'}, {u'originalString': u'2 stalks of lemongrass, finely sliced', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemongrass', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11972, u'unit': u'stalks'}, {u'originalString': u'4 to 6 c. of meat broth', u'name': u'meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1065062, u'unit': u'c'}, {u'originalString': u'patis (fish sauce), to taste', u'aisle': u'Ethnic Foods', u'name': u'patis', u'metaInformation': [u'to taste', u'(fish sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'servings'}, {u'originalString': u'\xbd kg. of cooked pork belly, cut into 2-inch pieces', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'cooked', u'cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 0.5, u'consistency': u'liquid', u'id': 10005, u'unit': u'kg'}, {u'originalString': u'sliced scallions, to garnish', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'2 shallots, finely sliced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3 c. of cubed squash', u'aisle': u'Produce', u'name': u'squash', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10011485, u'unit': u'c'}, {u'originalString': u'a handful of Thai basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thai basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'handful'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://casaveneracion.com/gaeng-om-thai-herbed-pork-vegetables/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make a spice paste by pounding the lemongrass, chilies, garlic and ginger together. You can make the spice paste as smooth or as coarse as you like.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'id': 11972, u'name': u'lemon grass'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Heat the cooking oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Saute the spice paste over medium-low heat with a splash of fish sauce.When the color of the paste deepens, add the sliced shallots. Continue sauteeing for a minute.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pork to the pan. Stir to coat the meat with the spice paste.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [], u'step': u'Pour in the broth. Season with more fish sauce. Bring to the boil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}, {u'equipment': [], u'step': u'Add the squash. Allow the liquid to boil. Lower the heat, cover and simmer for five minutes.Throw in the eggplant wedges and the Thai basil leaves. Taste the broth and add more fish sauce, if needed. Simmer for another seven to ten minutes until both the eggplants and squash are tender.Sprinkle in the scallions.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Thai. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try Dry Creek Vineyard Dry Chenin Blanc, Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This beautiful wine is wonderfully consistent vintage after vintage. We receive superior Chenin Blanc fruit from the Wilson Ranch in Clarksburg, allowing us to produce an expressive, nuanced and delicious wine. At first swirl, aromatics of white pear, pineapple and banana spring forward from the glass. On the palate, the wine is refreshing with flavors of ripe tangerine and peaches. The mouthfeel is lively, but rich and has a subtle creaminess. 100% stainless steel fermentation guarantees the fresh fruit character fans of this wine have come to appreciate over the years. This is the quintessential summer sipper and the perfect wine to pair with fresh oysters!', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 48, u'instructions': u'Make a spice paste by pounding the lemongrass, chilies, garlic and ginger together. You can make the spice paste as smooth or as coarse as you like.Heat the cooking oil. Saute the spice paste over medium-low heat with a splash of fish sauce.When the color of the paste deepens, add the sliced shallots. Continue sauteeing for a minute.Add the pork to the pan. Stir to coat the meat with the spice paste.Pour in the broth. Season with more fish sauce. Bring to the boil.Add the squash. Allow the liquid to boil. Lower the heat, cover and simmer for five minutes.Throw in the eggplant wedges and the Thai basil leaves. Taste the broth and add more fish sauce, if needed. Simmer for another seven to ten minutes until both the eggplants and squash are tender.Sprinkle in the scallions. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/gaeng-om-thai-herbed-pork-and-vegetables-610017', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}