{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/594914-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 594914, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baked Brie', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 77.68, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'4 tablespoons preserves or jam such as peach, strawberry, or apricot – we used Stonewall Kitchen Strawberry Champagne Jam.', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19719, u'unit': u'tablespoons'}, {u'originalString': u'1 lb. round brie', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1006, u'unit': u'lb'}, {u'originalString': u'1 stick butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'Crackers for serving', u'aisle': u'Savory Snacks', u'name': u'crackers', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 15.0, u'consistency': u'solid', u'id': 18621, u'unit': u'servings'}, {u'originalString': u'6 sheets phyllo dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 6.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.afamilyfeast.com/baked-brie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}], u'step': u'Before opening the phyllo dough package, have a clean, dry cloth such as a dishtowel on hand.   In order to prevent the phyllo dough from drying out, you will use this dish cloth to cover the phyllo that you are not working with.Unroll the phyllo dough and lay one sheet of dough onto a large cutting board. With a pastry brush, brush the dough with melted butter.  It’s OK if it tears a bit – as you use more layers of phyllo dough, the tears will be covered.    Wrap phyllo around the brie (you can use more butter to get the folds to stick to the round of brie like I did.)Take the next sheet of phyllo dough and brush it with melted butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Place the wrapped brie fold side down in the center of the phyllo sheet and wrap around the brie.  Repeat until you have wrapped 5 sheets of phyllo around the cheese, always turning the cheese over each time so that the folds are on the bottom.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Brush a generous amount of butter on your 6th sheet of phyllo dough.  Then spread the jam across the top of the cheese.   Gently place the phyllo over the jam, being careful not to tear the dough.  Finish wrapping the brie with the dough, folding the edges underneath the brie and using additional butter as needed to smooth the phyllo folds around the cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place in a round baking pan or on a cookie sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake 15 minutes in a 425 degree oven or until lightly brown.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let sit for 5 minutes before serving with crackers.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Ricasoli Castello di Brolio Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 46 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage. View More', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 1923, u'instructions': u'Before opening the phyllo dough package, have a clean, dry cloth such as a dishtowel on hand.   In order to prevent the phyllo dough from drying out, you will use this dish cloth to cover the phyllo that you are not working with.Unroll the phyllo dough and lay one sheet of dough onto a large cutting board. With a pastry brush, brush the dough with melted butter.  It’s OK if it tears a bit – as you use more layers of phyllo dough, the tears will be covered.    Wrap phyllo around the brie (you can use more butter to get the folds to stick to the round of brie like I did.)Take the next sheet of phyllo dough and brush it with melted butter.   Place the wrapped brie fold side down in the center of the phyllo sheet and wrap around the brie.  Repeat until you have wrapped 5 sheets of phyllo around the cheese, always turning the cheese over each time so that the folds are on the bottom.    Brush a generous amount of butter on your 6th sheet of phyllo dough.  Then spread the jam across the top of the cheese.   Gently place the phyllo over the jam, being careful not to tear the dough.  Finish wrapping the brie with the dough, folding the edges underneath the brie and using additional butter as needed to smooth the phyllo folds around the cheese.Place in a round baking pan or on a cookie sheet.   Bake 15 minutes in a 425 degree oven or until lightly brown.   Let sit for 5 minutes before serving with crackers.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-brie-594914', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}