{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205446-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205446, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chocolate Thin Mint Ice Cream', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'pricePerServing': 401.48, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'28 Thin Mints (1 box), divided', u'aisle': u'Sweet Snacks', u'name': u'andes mints', u'metaInformation': [u'divided', u'thin', u'(1 box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 28.0, u'consistency': u'solid', u'id': 98917, u'unit': u''}, {u'originalString': u'3 tablespoons cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'5 ounces dark chocolate (about 70% cacao), chopped fine', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'70%', u'chopped', u'fine', u'( cacao)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'6 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 cups half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/03/chocolate-thin-mint-ice-cream-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 61, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a medium saucepan off heat, whisk together egg yolks and sugar until light in color and slightly thickened, 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in cocoa powder until no lumps remain. Slowly add half and half, whisking constantly. Finely chop 10 Thin Mints (crumbs should be no larger than a pea) and stir into dairy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Put saucepan on medium-low heat and cook, whisking frequently, until custard reaches 180\xb0F on an instant read thermometer (custard should coat the back of a spoon but a swiped finger should leave a clean line).', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove custard from heat and stir in chocolate, then salt to taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'When chocolate is fully melted and incorporated, transfer to an airtight container and chill overnight in refrigerator.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u"The next day, churn in an ice cream maker according to manufacturer's instructions. Roughly chop remaining Thin Mints; chunks should range from pea to nickle-sized.  In the last minute of churn, add chopped Thin Mints. Return ice cream to container and chill in freezer for at least two hours before serving.", u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 129, u'instructions': u"Procedures                                                                              1                                                                            In a medium saucepan off heat, whisk together egg yolks and sugar until light in color and slightly thickened, 3 to 5 minutes. Whisk in cocoa powder until no lumps remain. Slowly add half and half, whisking constantly. Finely chop 10 Thin Mints (crumbs should be no larger than a pea) and stir into dairy.                                                                                                                            2                                                                            Put saucepan on medium-low heat and cook, whisking frequently, until custard reaches 180\xb0F on an instant read thermometer (custard should coat the back of a spoon but a swiped finger should leave a clean line). Remove custard from heat and stir in chocolate, then salt to taste.                                                                                                                             3                                                                            When chocolate is fully melted and incorporated, transfer to an airtight container and chill overnight in refrigerator.                                                                                                                            4                                                                            The next day, churn in an ice cream maker according to manufacturer's instructions. Roughly chop remaining Thin Mints; chunks should range from pea to nickle-sized.  In the last minute of churn, add chopped Thin Mints. Return ice cream to container and chill in freezer for at least two hours before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-thin-mint-ice-cream-205446', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}