{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/760740-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760740, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potato-Pepper-Spinach Frittata', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 144.15, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp. minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'4 oz. Monterey Jack cheese, grated', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'oz'}, {u'originalString': u'3 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'Pepper slices for garnish, optional', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'slices'}, {u'originalString': u'10 oz. peppers, such as Cubanelle and Hungarian wax peppers, and poblano and jalape\xf1o chiles', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u' such as cubanelle and hungarian wax peppers, and poblano and jalape\xf1o chiles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10111333, u'unit': u'oz'}, {u'originalString': u'Salt and freshly ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 bunch spinach, rinsed, trimmed and chopped', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'rinsed', u'trimmed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'bunch'}, {u'originalString': u'1 large sweet onion, cubed', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'10 oz. baby Yukon gold potatoes, quartered', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'oz'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/potato-pepper-spinach-frittata/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large ovenproof or cast-iron skillet over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the potatoes, and saut\xe9 until they begin to brown, for about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Add the peppers, onion and garlic, and saut\xe9 for about 7 minutes more, or until the peppers wilt and the onion softens.2.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the spinach, reduce the heat to medium-low and cover the skillet. Cook for about 3 minutes, or until the spinach wilts.3. Beat the eggs well, seasoning with salt and pepper. Stir in shredded cheese.4. Preheat the broiler.5. Uncover the skillet, and stir potato mixture.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in the eggs, increase the heat to medium-high, tilt the pan and lift the mixture to allow uncooked eggs to run underneath. Stir, and continue cooking for about 5 minutes more.6. Broil the frittata for about 1 minute, or until the top browns.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Garnish with pepper slices, if desired, and serve at once.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frittata works really well with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. You could try Piper-Heidsieck Brut Cuvee. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 40 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance.', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'1. Heat the oil in a large ovenproof or cast-iron skillet over medium-high heat. Add the potatoes, and saut\xe9 until they begin to brown, for about 10 minutes. Add the peppers, onion and garlic, and saut\xe9 for about 7 minutes more, or until the peppers wilt and the onion softens.2. Add the spinach, reduce the heat to medium-low and cover the skillet. Cook for about 3 minutes, or until the spinach wilts.3. Beat the eggs well, seasoning with salt and pepper. Stir in shredded cheese.4. Preheat the broiler.5. Uncover the skillet, and stir potato mixture. Pour in the eggs, increase the heat to medium-high, tilt the pan and lift the mixture to allow uncooked eggs to run underneath. Stir, and continue cooking for about 5 minutes more.6. Broil the frittata for about 1 minute, or until the top browns. Garnish with pepper slices, if desired, and serve at once.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-pepper-spinach-frittata-760740', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}