{u'recipes': [{u'sourceName': u'This Gal Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/606145-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 606145, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Potato Ham and Leek Soup', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 199.45, u'creditText': u'This Gal Cooks', u'extendedIngredients': [{u'originalString': u'3 tbsp all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'3 C chicken stock (no salt added)', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'no salt added', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'C'}, {u'originalString': u'1\xbd C diced cooked ham', u'aisle': u'Meat', u'name': u'diced ham', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/diced-ham.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 99186, u'unit': u'C'}, {u'originalString': u'2 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbe C half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1049, u'unit': u'C'}, {u'originalString': u'1 leek, thin sliced and chopped (thin slice only the white and very light green parts)', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'light', u'white', u'green', u'sliced', u'chopped', u'thin', u'( slice only the and very parts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u"4 C diced potatoes (I didn't peel my potatoes but you can peel yours, if you prefer them that way)", u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'diced', u'canned', u"(I didn't peel my potatoes but you can peel yours, if you prefer them that way)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11362, u'unit': u'C'}, {u'originalString': u'1 tsp seasoned salt', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042047, u'unit': u'tsp'}, {u'originalString': u'3 tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.thisgalcooks.com/2014/07/19/slow-cooker-potato-ham-leek-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the potatoes and ham in a slow cooker. Sprinkle with the seasoned salt.In a skillet over medium heat, melt the butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Add the leeks and saute until tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add the minced garlic and saute for one more minute.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add everything from the skillet to the slow cooker (including the butter drippings) and mix well.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Pour the stock over the mixture and mix well. Cover and cook on low for 6 hours.After the soup is done cooking, remove half of it and place it in a blender. Blend until smooth. Return to the slow cooker.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the half and half and the flour. Microwave in 15 second increments until thickened, whisking between each heating session. It is important that you do not overheat the flour/half and half mixture. If you overheat it, it will start to cook and you will need to discard and start this method over. Once the mixture is thickened, pour into the slow cooker and mix well.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve the soup in bowls and top with your favorite toppings.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 54, u'instructions': u'Place the potatoes and ham in a slow cooker. Sprinkle with the seasoned salt.In a skillet over medium heat, melt the butter. Add the leeks and saute until tender. Add the minced garlic and saute for one more minute. Add everything from the skillet to the slow cooker (including the butter drippings) and mix well. Pour the stock over the mixture and mix well. Cover and cook on low for 6 hours.After the soup is done cooking, remove half of it and place it in a blender. Blend until smooth. Return to the slow cooker.Whisk together the half and half and the flour. Microwave in 15 second increments until thickened, whisking between each heating session. It is important that you do not overheat the flour/half and half mixture. If you overheat it, it will start to cook and you will need to discard and start this method over. Once the mixture is thickened, pour into the slow cooker and mix well.Serve the soup in bowls and top with your favorite toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-potato-ham-and-leek-soup-606145', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}