{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/222264-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 222264, u'veryPopular': False, u'lowFodmap': False, u'title': u'Warm choc-orange tarts with orange ice cream', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 75, u'pricePerServing': 176.69, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'little cocoa, to serve', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19165, u'unit': u'servings'}, {u'originalString': u'250g dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'300ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'1 egg yolk, mixed with 2 tbsp water', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'mixed', u'with 2 tbsp water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'5 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 eggs, plus 1 white (leftover from pastry)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'white', u'leftover', u'( from pastry)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100g icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'zest 2 oranges, plus juice of 1', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u''}, {u'originalString': u'350g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'140g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'500ml whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1161640/warm-chocorange-tarts-with-orange-ice-cream', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the ice cream first.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the milkand cream in a pan to just below boilingpoint. Stir together yolks and sugar, thengradually whisk in the hot milk mixture.Return to pan, heating gently and stirringuntil thickened. Stir in the zest and juice,and cool. Churn, then freeze until solid.Can be made up to a month ahead.To make the pastry, whizz flour andbutter in a food processor, then pulse inicing sugar. Pulse in zest with enoughyolk mixture to bring the pastry together.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Roll out and line 8 deep, individual tarttins. Chill for 30 mins.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 190.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 190C/170C fan/gas 5. Filltarts with baking parchment and bakingbeans, and bake blind for 15 mins.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove beans and paper and bake for10 mins more.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven. Whencool enough to handle, remove from tinsand sit on a baking sheet. Turn ovendown to 160C/140C fan/gas 3.For the filling, melt chocolate in a bowlover a pan of barely simmering water.Beat the 2 whole eggs, extra white andsugar until thick and pale – about 5 mins.Fold in the chocolate, melted butter andflour, then divide between the tarts.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Let the mixture settle for a few mins,then bake for 25 mins. Leave to cool for10 mins while scooping ice cream intoballs. Dust the tarts with a little cocoa,top each with a scoop of ice cream.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Tart can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Make the ice cream first. Heat the milkand cream in a pan to just below boilingpoint. Stir together yolks and sugar, thengradually whisk in the hot milk mixture.Return to pan, heating gently and stirringuntil thickened. Stir in the zest and juice,and cool. Churn, then freeze until solid.Can be made up to a month ahead.To make the pastry, whizz flour andbutter in a food processor, then pulse inicing sugar. Pulse in zest with enoughyolk mixture to bring the pastry together.Roll out and line 8 deep, individual tarttins. Chill for 30 mins.Heat oven to 190C/170C fan/gas 5. Filltarts with baking parchment and bakingbeans, and bake blind for 15 mins.Remove beans and paper and bake for10 mins more. Remove from oven. Whencool enough to handle, remove from tinsand sit on a baking sheet. Turn ovendown to 160C/140C fan/gas 3.For the filling, melt chocolate in a bowlover a pan of barely simmering water.Beat the 2 whole eggs, extra white andsugar until thick and pale – about 5 mins.Fold in the chocolate, melted butter andflour, then divide between the tarts.Let the mixture settle for a few mins,then bake for 25 mins. Leave to cool for10 mins while scooping ice cream intoballs. Dust the tarts with a little cocoa,top each with a scoop of ice cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/warm-choc-orange-tarts-with-orange-ice-cream-222264', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}