{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/553081-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 553081, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gluten Free Dark Chocolate “Hummus” Cake', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 29.03, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'3/4 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup dark cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tablespoons'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 (15 oz can) garbanzo beans (aka chick peas), drained', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'garbanzo beans', u'metaInformation': [u'drained', u'(aka chick peas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16057, u'unit': u'oz'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/gluten-free-dark-chocolate-hummus-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees and spray a 9 inch round spring form pan (or three smaller 4-inch springform pans) with cooking spray. I used my little heart-shaped spring form pans.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put the chickpeas, vanilla and eggs in a food processor or handi chopper and blend until the beans are finely pureed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sifter.jpg', u'id': 404708, u'name': u'sifter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the dry ingredients in a medium bowl and mix them until all the lumps are gone (Carol suggests a sifter for this ... I used a spoon.)', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the dry ingredients to the food processor and process for about a minute or until completely blended. (If your handi chopper doesn't fit all the ingredients, just keep the sugar out when you mix the dry ingredients and process, then dump the batter into a bowl and mix in the sugar by hand.)", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the batter into your prepared pan.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake approx 40-55 minutes or until a toothpick inserted into the center of the cake comes out not quite clean.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove your cake(s) from the oven and let set for 10 minutes before transferring onto the serving platter. At serving time, dust the cake with powdered sugar and serve with berries or pomegranate seeds.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 784, u'instructions': u"Preheat the oven to 350 degrees and spray a 9 inch round spring form pan (or three smaller 4-inch springform pans) with cooking spray. I used my little heart-shaped spring form pans. Put the chickpeas, vanilla and eggs in a food processor or handi chopper and blend until the beans are finely pureed.Combine the dry ingredients in a medium bowl and mix them until all the lumps are gone (Carol suggests a sifter for this ... I used a spoon.) Add the dry ingredients to the food processor and process for about a minute or until completely blended. (If your handi chopper doesn't fit all the ingredients, just keep the sugar out when you mix the dry ingredients and process, then dump the batter into a bowl and mix in the sugar by hand.)Pour the batter into your prepared pan. Bake approx 40-55 minutes or until a toothpick inserted into the center of the cake comes out not quite clean.Remove your cake(s) from the oven and let set for 10 minutes before transferring onto the serving platter. At serving time, dust the cake with powdered sugar and serve with berries or pomegranate seeds.", u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-dark-chocolate-hummus-cake-553081', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}