{u'recipes': [{u'sourceName': u'Boulder Locavore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521986-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 521986, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Spicy Crust Bourbon Pecan Pies & homemade Cinnamon Ice Cream', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 113.21, u'creditText': u'Boulder Locavore', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon Ancho Chili Powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'ancho chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022009, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons Apple Cider Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'teaspoons'}, {u'originalString': u'\xbc cup Arrowroot Starch', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20003, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup Sweet Brown Rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'brown rice flour', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20090, u'unit': u'cup'}, {u'originalString': u'1 cup Brown Rice Flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'brown rice flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20090, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup Light Corn Syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'2/3 cup Cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'\xbe cup Dark Corn Syrup', u'aisle': u'Baking', u'name': u'dark corn syrup', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19349, u'unit': u'cup'}, {u'originalString': u'1 Egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 large Eggs, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbe cup granulated Sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 \xbd cups Pecans (half of quantity chopped, remaining half of pecan halves)', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped', u'(half of quantity , remaining half of pecan halves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'Pinch of Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup sorghum Flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'sorghum flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20648, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Tapioca Flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93696, u'unit': u'tablespoons'}, {u'originalString': u'6 tablespoons unsalted Butter, cut into tablespoons', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into tablespoons'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 stick unsalted Butter (8 tablespoons), cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup cold Water (plus \xbc cup cold water in reserve)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold', u'(plus \xbc cup water in reserve)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 \xbd teaspoon Xanthan Gum', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'xanthan gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 93626, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://boulderlocavore.com/2012/11/mini-spicy-crust-bourbon-pecan-pies-homemade-cinnamon-ice-cream.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Mix the dry ingredients either using the dough attachment in a food processor or by hand.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}], u'step': u'Cut the stick of butter into small pieces (into tablespoons, then cut those into fourths) and incorporate into the dry ingredients using a food processor with dough attachment or a pastry cutter if doing it by hand. The end result should be crumbly.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a separate small bowl, mix together the egg, and vinegar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add to the dry mixture in the food processor, along with 1/3 cup of water and pulse until it has fully combined. Note:  If the mixture seems overly dry you may add additional water in tablespoon increments until is stays together lightly (this may also be added when removing the crust from the refrigerator before rolling out instead if unsure).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Remove from the food processor, form into a ball, wrap in plastic wrap and place in the refrigerator until chilled (about 30 minutes).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350.  Prepare muffin tin by spraying with no stick cooking spray.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Cut one inch wide strips of parchment paper, enough for the number of pies you are baking.  These will be installed before baking to ease removal of mini pies after baking.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Over low heat, combine the dark and light corn syrup with granulated sugar in a medium saucepan.  Stir to combine.  Bring to a boil without stirring mixture (note: it may take a bit of time; when you see small bubbles you can proceed to the next step).', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}]}, {u'equipment': [], u'step': u'Remove from heat and add the butter.  Stir until butter is fully melted into the sugar mixture.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a separate mixing bowl, whisk together the eggs, salt and bourbon until fully combined.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add egg mixture to the sugar-butter mixture.  Using a whisk in an S pattern until all ingredients are combine; do not over mix.  Allow to cool.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Roll out chilled pie crust so it is approximately 1/8 inch thick.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut out a round of dough about 5 inches in diameter.  Using a small bowl turned over as a guide works well.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Take the strips of parchment paper and place one in each muffin cup so there are a few inches extending on either side of a given cup (see not-so-fabulous iPhone pic below as example).', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Place a round of crust on top of the muffin tin and form it into place with your hands.  You can repair holes with more dough and just smooth is out with your fingers.   Leave about  inch outside the top of the muffin cavity as you would with a full size pie.  Repeat for all muffin cavities.', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Spoon 1 -2 tablespoons of the pecan mixture into each muffin cup.  Briefly whisk the filling (is can separate as it sits) and pour in each muffin cup to fill to the top.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place muffin tins on a baking sheet and place in the heated oven for 25 minutes.  At this point the crust should be done and the tops of the mini pies dome-shaped.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove for the oven and allow the muffin tin to sit on a cooling rack for about 20 minutes until close to room temperature.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the mini pies by gently grasping either side of the parchment strip for a given pie and lifting it out of the tin.', u'number': 19, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are my top picks for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 215, u'instructions': u'Mix the dry ingredients either using the dough attachment in a food processor or by hand.                    Cut the stick of butter into small pieces (into tablespoons, then cut those into fourths) and incorporate into the dry ingredients using a food processor with dough attachment or a pastry cutter if doing it by hand. The end result should be crumbly.                    In a separate small bowl, mix together the egg, and vinegar. Add to the dry mixture in the food processor, along with 1/3 cup of water and pulse until it has fully combined. Note:  If the mixture seems overly dry you may add additional water in tablespoon increments until is stays together lightly (this may also be added when removing the crust from the refrigerator before rolling out instead if unsure).  Remove from the food processor, form into a ball, wrap in plastic wrap and place in the refrigerator until chilled (about 30 minutes).                    Preheat oven to 350.  Prepare muffin tin by spraying with no stick cooking spray.  Cut one inch wide strips of parchment paper, enough for the number of pies you are baking.  These will be installed before baking to ease removal of mini pies after baking.                    Over low heat, combine the dark and light corn syrup with granulated sugar in a medium saucepan.  Stir to combine.  Bring to a boil without stirring mixture (note: it may take a bit of time; when you see small bubbles you can proceed to the next step).                    Remove from heat and add the butter.  Stir until butter is fully melted into the sugar mixture.                    In a separate mixing bowl, whisk together the eggs, salt and bourbon until fully combined.                    Add egg mixture to the sugar-butter mixture.  Using a whisk in an S pattern until all ingredients are combine; do not over mix.  Allow to cool.                    Roll out chilled pie crust so it is approximately 1/8 inch thick.  Cut out a round of dough about 5 inches in diameter.  Using a small bowl turned over as a guide works well.                    Take the strips of parchment paper and place one in each muffin cup so there are a few inches extending on either side of a given cup (see not-so-fabulous iPhone pic below as example).                    Place a round of crust on top of the muffin tin and form it into place with your hands.  You can repair holes with more dough and just smooth is out with your fingers.   Leave about  inch outside the top of the muffin cavity as you would with a full size pie.  Repeat for all muffin cavities.                    Spoon 1 -2 tablespoons of the pecan mixture into each muffin cup.  Briefly whisk the filling (is can separate as it sits) and pour in each muffin cup to fill to the top.                    Place muffin tins on a baking sheet and place in the heated oven for 25 minutes.  At this point the crust should be done and the tops of the mini pies dome-shaped.  Remove for the oven and allow the muffin tin to sit on a cooling rack for about 20 minutes until close to room temperature.  Remove the mini pies by gently grasping either side of the parchment strip for a given pie and lifting it out of the tin.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-spicy-crust-bourbon-pecan-pies-homemade-cinnamon-ice-cream-521986', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}