{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528512-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 528512, u'veryPopular': False, u'lowFodmap': False, u'title': u'20 Minute Cinnamon Twists with Cream Cheese Dipping Sauce', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 74.55, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'\xbc cup Butter, melted and cooled slightly', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'4 ounces Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 Tbsp Ground Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tbsp'}, {u'originalString': u'5-6 tsp Milk or Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tsp'}, {u'originalString': u'1 cup Powdered Sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'2 Sheets Puff Pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'Sheets', u'unitShort': u'Sheets', u'amount': 2.0, u'consistency': u'solid', u'id': 18337, u'unit': u'Sheets'}, {u'originalString': u'\xbd tsp Vanilla Extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.countrycleaver.com/2014/02/20-minute-cinnamon-sugar-twists.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. In a small dish, mix together sugar and cinnamon. Set aside. On a floured surface, sprinkle each sheet of puff pastry with flour, and roll each into 10 inch by 10 inch squares.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}], u'step': u'Brush each side of sheets with butter and sprinkle lightly with cinnamon sugar mixture. Turn sheets over and repeat butter and sugar sprinkling. With a pizza cutter, cut both sheets into strips one inch wide, about 20 strips. Gather two strips on top of each other, pinching ends together and twist to form well, twists.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on a parchment lined baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place baking sheet into oven and bake 20-23 minutes, or until golden brown and crispy. While baking, mix together softened cream cheese and powdered sugar until smooth. If the cream cheese is not entirely softened it will look clumpy.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add in vanilla extract and 5 teaspoons of milk, stirring until incorporated and smooth. If the mixture is too thick, add an additional teaspoon or two of milk, until the dip reaches your desired consistency.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 117, u'instructions': u'Preheat oven to 400 degrees. In a small dish, mix together sugar and cinnamon. Set aside. On a floured surface, sprinkle each sheet of puff pastry with flour, and roll each into 10 inch by 10 inch squares.Brush each side of sheets with butter and sprinkle lightly with cinnamon sugar mixture. Turn sheets over and repeat butter and sugar sprinkling. With a pizza cutter, cut both sheets into strips one inch wide, about 20 strips. Gather two strips on top of each other, pinching ends together and twist to form well, twists. Place on a parchment lined baking sheet.Place baking sheet into oven and bake 20-23 minutes, or until golden brown and crispy. While baking, mix together softened cream cheese and powdered sugar until smooth. If the cream cheese is not entirely softened it will look clumpy. Add in vanilla extract and 5 teaspoons of milk, stirring until incorporated and smooth. If the mixture is too thick, add an additional teaspoon or two of milk, until the dip reaches your desired consistency.Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/20-minute-cinnamon-twists-with-cream-cheese-dipping-sauce-528512', u'dishTypes': [u'side dish'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}