{u'recipes': [{u'sourceName': u'The Corner Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/555440-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 555440, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fennel Leek Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 130.05, u'creditText': u'The Corner Kitchen', u'extendedIngredients': [{u'originalString': u'2 cups chicken/vegetable stock*', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'2 fennel bulbs, diced', u'aisle': u'Produce', u'name': u'fennel bulbs', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 leeks, white part only, halved & thinly sliced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'white', u'halved', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 starchy potatoes (Idaho, Yukon Gold), cubed & very thinly sliced', u'aisle': u'Produce', u'name': u'starchy potatoes', u'metaInformation': [u'cubed', u'very thinly sliced', u'(Idaho, Yukon Gold)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://thecornerkitchenblog.com/fennel-leek-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Prepare all vegetables.Melt butter & heat olive oil, together, in a medium stock pot.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add leeks and fennel to the pot, and season with salt and pepper.  Stir to mix with the butter and olive, and sweat the vegetables over low heat for about 20 minutes, or until very soft, and stirring occasionally.  Keep the heat low to avoid obtaining any color on the leeks or fennel.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the stock and water to the pot.  Gradually raise the heat and bring the soup to a boil.  When the soup reaches a boil add the potatoes, season again and stir to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u"Let the soup boil for 30 minutes, stirring occasionally.  You'll notice the potatoes will break down and the soup will thicken.  Lower the heat and simmer for 45-60 minutes.  Taste, and season as needed.* This soup can also be made with all water and no stock.  Keep in mind, if you forgo the stock you will need to use more seasoning (salt & pepper) for added flavor.", u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 34, u'instructions': u"Prepare all vegetables.Melt butter & heat olive oil, together, in a medium stock pot.  Add leeks and fennel to the pot, and season with salt and pepper.  Stir to mix with the butter and olive, and sweat the vegetables over low heat for about 20 minutes, or until very soft, and stirring occasionally.  Keep the heat low to avoid obtaining any color on the leeks or fennel.Add the stock and water to the pot.  Gradually raise the heat and bring the soup to a boil.  When the soup reaches a boil add the potatoes, season again and stir to combine.  Let the soup boil for 30 minutes, stirring occasionally.  You'll notice the potatoes will break down and the soup will thicken.  Lower the heat and simmer for 45-60 minutes.  Taste, and season as needed.* This soup can also be made with all water and no stock.  Keep in mind, if you forgo the stock you will need to use more seasoning (salt & pepper) for added flavor.", u'spoonacularSourceUrl': u'https://spoonacular.com/fennel-leek-soup-555440', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}