{u'recipes': [{u'sourceName': u'Pale Omg', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/509302-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 509302, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Coffee Caramel Bars', u'diets': [u'caveman', u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 415.72, u'creditText': u'Pale Omg', u'extendedIngredients': [{u'originalString': u'\xbd cup almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'5-6 tablespoons canned coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'tablespoons'}, {u'originalString': u'1 cup Enjoy Life Chocolate Chips or dark chocolate, melted', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'dark', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'coarse sea salt, to top', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [u'to top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'\xbc cup Unsweetended Shredded Coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'12 dried figs (or dates, if you prefer), stems removed', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried', u'(or dates, if you prefer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 9094, u'unit': u''}, {u'originalString': u'2 teaspoons ground coffee', u'aisle': u'Tea and Coffee', u'name': u'ground coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10093715, u'unit': u'teaspoons'}, {u'originalString': u'12-14 medjool dates, pitted and soaked in water for an hour', u'aisle': u'Dried Fruits;Produce', u'name': u'medjool dates', u'metaInformation': [u'pitted', u'for an hour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 9421, u'unit': u''}, {u'originalString': u'2 tablespoons Raw Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://paleomg.com/chocolate-coffee-caramel-bars/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'First make your crust.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add all of your crust ingredients into a food processor and mix until well combined.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Add the crust mixture to a bread pan and push down until the mixture is flat. Like a crust. Duh.Now add your dates and pulse until dates have broken down (less than a minute) then add your coconut milk tablespoon by tablespoon to the dates while the food processor is still running. Then add your water as well.And add your vanilla extract and pinch of salt.Process until you get a caramel. BOOM. May take 3-5 minutes, tops.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Pour caramel over your crust and spread evenly.Now you will want to melt your chocolate. You could do this in a double boiler or just the microwave. I chose the latter.Melt chocolate and coconut milk together in the microwave.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Heating for 30 seconds then mixing well and reheating when necessary.Once your chocolate is completely melted, add your ground coffee and mix well.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10093715, u'name': u'ground coffee'}]}, {u'equipment': [], u'step': u'Pour melted chocolate over your caramel and spread evenly.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add coarse sea salt on top of the chocolate.Put in freezer to let chocolate harden. Around 10+ minutes.Eat!!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'coarse sea salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 28387, u'instructions': u'First make your crust. Add all of your crust ingredients into a food processor and mix until well combined. Add the crust mixture to a bread pan and push down until the mixture is flat. Like a crust. Duh.Now add your dates and pulse until dates have broken down (less than a minute) then add your coconut milk tablespoon by tablespoon to the dates while the food processor is still running. Then add your water as well.And add your vanilla extract and pinch of salt.Process until you get a caramel. BOOM. May take 3-5 minutes, tops.Pour caramel over your crust and spread evenly.Now you will want to melt your chocolate. You could do this in a double boiler or just the microwave. I chose the latter.Melt chocolate and coconut milk together in the microwave. Heating for 30 seconds then mixing well and reheating when necessary.Once your chocolate is completely melted, add your ground coffee and mix well.Pour melted chocolate over your caramel and spread evenly.Add coarse sea salt on top of the chocolate.Put in freezer to let chocolate harden. Around 10+ minutes.Eat!!', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-coffee-caramel-bars-509302', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}