{u'recipes': [{u'sourceName': u'Food52', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/198-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 198, u'veryPopular': False, u'lowFodmap': False, u'title': u'Montbrun Melange: Olive Bread With Basil, Marinated Tomatoes, A', u'diets': [u'pescatarian'], u'pricePerServing': 85.88, u'creditText': u'Food52', u'extendedIngredients': [{u'originalString': u'4 anchovies thathave been packed in olive oil, drained', u'aisle': u'Seafood', u'name': u'anchovies', u'metaInformation': [u'packed in olive oil, drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 15001, u'unit': u''}, {u'originalString': u'1 Tbsp balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'Tbsp'}, {u'originalString': u'6 to 8 good-sized basil leaves, otrn in 3 pieces', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 pinch of coarse sea alt a grind of black pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2 slices good, dark olive bread or other crusty bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'dark', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'1 Tbsp good olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 large tomato, cut in thick slices', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'thick', u'large', u'cut in  slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 Tbsp good, unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.food52.com/recipes/5645_montbrun_melange_olive_bread_with_basil_marinated_tomatoes_and_anchovies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the olive oil, vinegar, garlic, salt and pepper in a shallow bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Cut the tomato slices in half, and mix with the oil and vinegar mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-tomato.jpg', u'id': 10511529, u'name': u'tomato slices'}]}, {u'equipment': [], u'step': u'Let stand for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Toast the bread and spread with butter. Top each silce with two criss-crossed anchovy fillets. Divide the torn basilleaves  and place on top of the anchovies on each slice.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovy fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Drain the tomatoes and mound them on top of the ahcovies.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Take a bite of your Montbrun Melange, close your eyes, and imagine you are in Provence!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 9, u'instructions': u'Mix the olive oil, vinegar, garlic, salt and pepper in a shallow bowl.                                  Cut the tomato slices in half, and mix with the oil and vinegar mixture. Let stand for 30 minutes.                                  Toast the bread and spread with butter. Top each silce with two criss-crossed anchovy fillets. Divide the torn basilleaves  and place on top of the anchovies on each slice.                                  Drain the tomatoes and mound them on top of the ahcovies.                                    Take a bite of your Montbrun Melange, close your eyes, and imagine you are in Provence!', u'spoonacularSourceUrl': u'https://spoonacular.com/montbrun-melange-olive-bread-with-basil-marinated-tomatoes-a-198', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}