{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611447-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 611447, u'veryPopular': True, u'lowFodmap': False, u'title': u'Honey Nut Cheerios & Banana Marshmallow Cereal Treats', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 234.35, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 banana, mashed', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'8 cups Honey Nut Cheerios', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'cups'}, {u'originalString': u'8 cups miniature marshmallows (about 1\xbd 10-ounce packages)', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'miniature', u'( 1\xbd 10-ounce packages)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'5 tablespoons salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.browneyedbaker.com/honey-nut-cheerios-banana-marshmallow-cereal-treats/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 40, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Line a 9-inch square baking pan with foil and grease with non-stick cooking spray; set aside.2. In a large pot over low heat, melt the butter. 3.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the marshmallows and mashed banana and stir constantly until the marshmallows have all melted. 4.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the pot from the stove and stir in the cereal until evenly coated with the marshmallow cream. Turn the mixture into the prepared pan and press it into a compact, even layer. Refrigerate until set, about 30 minutes. Store leftovers in an airtight container in the refrigerator for up to 4 days.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Treat works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 654, u'instructions': u'1. Line a 9-inch square baking pan with foil and grease with non-stick cooking spray; set aside.2. In a large pot over low heat, melt the butter. 3. Add the marshmallows and mashed banana and stir constantly until the marshmallows have all melted. 4. Remove the pot from the stove and stir in the cereal until evenly coated with the marshmallow cream. Turn the mixture into the prepared pan and press it into a compact, even layer. Refrigerate until set, about 30 minutes. Store leftovers in an airtight container in the refrigerator for up to 4 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-nut-cheerios-banana-marshmallow-cereal-treats-611447', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}