{u'recipes': [{u'sourceName': u'Ambitious Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/809847-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 809847, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gluten Free, Protein-Packed Quinoa Flour Banana Pancakes', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 48.18, u'creditText': u'Ambitious Kitchen', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup unsweetened almond milk, plus more if necessary', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened', u'plus more if necessary'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 large ripe banana, mashed', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'ripe', u'large', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'Optional: blueberries or chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'servings'}, {u'originalString': u'1 egg, slightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'slightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup nonfat plain greek yogurt (vanilla is fine)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain', u'fine', u'(vanilla is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'1 cup quinoa flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'quinoa flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93773, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.ambitiouskitchen.com/2015/05/gluten-free-protein-packed-quinoa-flour-banana-pancakes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In large bowl whisk together quinoa flour, baking powder, and baking soda; set aside. In a separate medium bowl beat banana, greek yogurt, eggs, honey, vanilla and almond extract and almond milk until smooth and well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93773, u'name': u'quinoa flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add wet ingredients to flour mixture and mix together. The batter will be very thick; consistency will vary based on which yogurt you used. Note: If you find that it is WAY too thick (almost paste like), you can add in a tablespoon or two more milk until it is smooth, but still thick.Lightly coat a large nonstick skillet or griddle with butter or cooking spray and place over medium heat. Drop batter by 1/4 cup onto skillet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add toppings of choice. You may need to use a spoon to spread out the batter just a tiny bit, as pancake batter will be thick and you'll want them to cook thoroughly. It's very important to cook until bubbles appear on top and the edges are well cooked; this is thick batter so you want to ensure even cooking. Flip cakes and cook until golden brown on underside, 2 minutes. Wipe skillet clean and repeat with more melted butter or cooking spray and remaining batter. You may need to reduce heat to medium low. Makes 8 pancakes total.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serves: 4 people, 2 pancakes each.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1760, u'instructions': u"In large bowl whisk together quinoa flour, baking powder, and baking soda; set aside. In a separate medium bowl beat banana, greek yogurt, eggs, honey, vanilla and almond extract and almond milk until smooth and well combined. Add wet ingredients to flour mixture and mix together. The batter will be very thick; consistency will vary based on which yogurt you used. Note: If you find that it is WAY too thick (almost paste like), you can add in a tablespoon or two more milk until it is smooth, but still thick.Lightly coat a large nonstick skillet or griddle with butter or cooking spray and place over medium heat. Drop batter by 1/4 cup onto skillet. Add toppings of choice. You may need to use a spoon to spread out the batter just a tiny bit, as pancake batter will be thick and you'll want them to cook thoroughly. It's very important to cook until bubbles appear on top and the edges are well cooked; this is thick batter so you want to ensure even cooking. Flip cakes and cook until golden brown on underside, 2 minutes. Wipe skillet clean and repeat with more melted butter or cooking spray and remaining batter. You may need to reduce heat to medium low. Makes 8 pancakes total. Serves: 4 people, 2 pancakes each.", u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-protein-packed-quinoa-flour-banana-pancakes-809847', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}