{u'recipes': [{u'sourceName': u'Perrys Plate', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/556826-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 556826, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tropical Fish Tacos with Pinapple Salsa', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 575.93, u'creditText': u'Perrys Plate', u'extendedIngredients': [{u'originalString': u'6 T coconut milk, divided', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'T'}, {u'originalString': u'2-3 T coconut oil or other heat-safe cooking oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'T'}, {u'originalString': u'8-12 corn tortillas, depending on the size', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1 cup diced cucumber', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2-3 limes, divided', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/2 cup Mexican crema or sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican crema', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93772, u'unit': u'cup'}, {u'originalString': u'2 T minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'T'}, {u'originalString': u'2 cups diced fresh pineapple chunks (about 1/2 of a medium pineapple)', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'fresh', u'diced', u'medium', u'( 1/2 of a pineapple)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'cups'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 medium tomato, diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'2/3 cup unsweetened coconut', u'aisle': u'Baking', u'name': u'unsweetened coconut', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds wild-caught white fish fillets (cod, halibut, dover sole)', u'aisle': u'Seafood', u'name': u'white fish fillets', u'metaInformation': [u'wild-caught', u'white', u'(cod, halibut, dover sole)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10015261, u'unit': u'pounds'}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.perrysplate.com/2012/02/tropical-fish-tacos-with-pineapple-salsa.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Pat the fish dry and place on a plate or rimmed baking pan. You may want to cut the fish into manageable pieces or you can leave the fillets whole. Sprinkle both sides of fish with salt and pepper, then drizzle 3 tablespoons of the coconut milk and juice from 1/2 a lime over the fish. Turn fish a couple of times to make sure they're coated.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Let the fish sit for 15-20 minutes while you prepare the salsa.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the pineapple salsa ingredients in a medium bowl and squirt the juice from 1/2 a lime over the top. Stir to combine and set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place sour cream in a small bowl and add the other 3 tablespoons of coconut milk, a squirt of lime juice, and a pinch of salt and pepper, to taste. Set both aside until you're ready to assemble the tacos.When you're ready to cook the fish, heat about 2 T oil in a pan over medium heat.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Place the unsweetened coconut in a shallow dish, large enough to fit the fillets, and add a few pinches of salt and pepper. Toss to combine. Lift each piece of fish, letting the excess coconut milk drain off, and coat in the dry coconut.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'id': 12108, u'name': u'unsweetened coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place the coated fillets in the hot pan. To ensure that you don't lose all of the coating, make sure your pan is sufficiently hot. The fish should sizzle like crazy when you add it to the pan.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Let the fish cook for a few minutes per side, flipping once.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Let it form a good crust before you flip. Don't move the fish around or fiddle with it too much. When it forms a golden brown crust, it should come off the pan easily with most of the coating. You will lose a bit of the coating in the pan, just spoon out what you can between batches, adding more oil if necessary. I recommend covering the fish while it's cooking if the fillets are thick so the coconut doesn't burn before the fish cooks through. The fish should start to separate into layers and flake easily with a fork when done.Assemble tacos by putting a couple forkfuls of fish into the center of a tortilla and topping it with some pineapple salsa and a drizzle of coconut sour cream.", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Serve with lime wedges.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Casa Catelli Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 8 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food. View More', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 1057, u'instructions': u"Pat the fish dry and place on a plate or rimmed baking pan. You may want to cut the fish into manageable pieces or you can leave the fillets whole. Sprinkle both sides of fish with salt and pepper, then drizzle 3 tablespoons of the coconut milk and juice from 1/2 a lime over the fish. Turn fish a couple of times to make sure they're coated. Let the fish sit for 15-20 minutes while you prepare the salsa.Combine the pineapple salsa ingredients in a medium bowl and squirt the juice from 1/2 a lime over the top. Stir to combine and set aside. Place sour cream in a small bowl and add the other 3 tablespoons of coconut milk, a squirt of lime juice, and a pinch of salt and pepper, to taste. Set both aside until you're ready to assemble the tacos.When you're ready to cook the fish, heat about 2 T oil in a pan over medium heat. Place the unsweetened coconut in a shallow dish, large enough to fit the fillets, and add a few pinches of salt and pepper. Toss to combine. Lift each piece of fish, letting the excess coconut milk drain off, and coat in the dry coconut. Place the coated fillets in the hot pan. To ensure that you don't lose all of the coating, make sure your pan is sufficiently hot. The fish should sizzle like crazy when you add it to the pan. Let the fish cook for a few minutes per side, flipping once. Let it form a good crust before you flip. Don't move the fish around or fiddle with it too much. When it forms a golden brown crust, it should come off the pan easily with most of the coating. You will lose a bit of the coating in the pan, just spoon out what you can between batches, adding more oil if necessary. I recommend covering the fish while it's cooking if the fillets are thick so the coconut doesn't burn before the fish cooks through. The fish should start to separate into layers and flake easily with a fork when done.Assemble tacos by putting a couple forkfuls of fish into the center of a tortilla and topping it with some pineapple salsa and a drizzle of coconut sour cream. Serve with lime wedges.", u'spoonacularSourceUrl': u'https://spoonacular.com/tropical-fish-tacos-with-pinapple-salsa-556826', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}