{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/831447-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 831447, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry and Brie Turkey Quesadillas with Avocado and Candied Jalapenos', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 306.44, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'1/4 avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'2 ounces brie, sliced thinly', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1006, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons candied jalapenos', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces roast turkey, sliced or shredded', u'aisle': u'Meat', u'name': u'roast turkey breast', u'metaInformation': [u'shredded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/deli-turkey.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 7259, u'unit': u'ounces'}, {u'originalString': u'2 tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'1 tablespoon jalapeno cranberry sauce or cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9081, u'unit': u'tablespoon'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.closetcooking.com/2016/11/cranberry-and-brie-turkey-quesadillas.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place one tortilla in a pan, sprinkle half of the cheese over half of the tortilla, top with the turkey, cranberry sauce, bacon, avocado and the remaining cheese and tortilla.Cook until the quesadilla is golden brown on both sides and the cheese is melted, about 2-4 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Quesadilla works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Garnet Monterey Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine.", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 116, u'instructions': u'Place one tortilla in a pan, sprinkle half of the cheese over half of the tortilla, top with the turkey, cranberry sauce, bacon, avocado and the remaining cheese and tortilla.Cook until the quesadilla is golden brown on both sides and the cheese is melted, about 2-4 minutes per side.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-and-brie-turkey-quesadillas-with-avocado-and-candied-jalapenos-831447', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}