{u'recipes': [{u'sourceName': u'Eat Drink Love', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/680977-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 680977, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spanish Salsa', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 103.7, u'creditText': u'Eat Drink Love', u'extendedIngredients': [{u'originalString': u'approx. 10 ounces cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'ounces'}, {u'originalString': u'2 green onions, roughly chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'pita chips or sliced baguette', u'aisle': u'Savory Snacks', u'name': u'pita chips', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 25037, u'unit': u'servings'}, {u'originalString': u"1/2 cup STAR Tomato and Peppers Green Olives (see note if you can't find these olives)", u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'green', u"(see note if you can't find these olives)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://eat-drink-love.com/2015/10/spanish-salsa/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the cherry tomatoes and green onions to a food processor followed by the olives. Then, spoon out about 1 tablespoon of the liquid from the jar along with some of the marinated pieces of garlic, tomato, and peppers in the jar.Process until desired consistency is reached.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Serve with pita chips or bread.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-chips.jpg', u'id': 25037, u'name': u'pita chips'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Salsa. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Garnet Monterey Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine.", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Add the cherry tomatoes and green onions to a food processor followed by the olives. Then, spoon out about 1 tablespoon of the liquid from the jar along with some of the marinated pieces of garlic, tomato, and peppers in the jar.Process until desired consistency is reached. Serve with pita chips or bread.', u'spoonacularSourceUrl': u'https://spoonacular.com/spanish-salsa-680977', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}