{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/761835-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 761835, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoky Red Pepper Dip', u'diets': [], u'pricePerServing': 31.83, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbc cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'\xbc cup dry, plain bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'dry bread crumbs', u'metaInformation': [u'plain', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'2 medium red bell peppers', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 large red onion, sliced \xbc-inch thick', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thick', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 Tbs. red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup plain soy yogurt or plain low-fat yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy yogurt', u'metaInformation': [u'plain', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16252, u'unit': u'cup'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/smoky-red-pepper-dip/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut bell peppers in half lengthwise; discard seeds and membranes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place pepper halves, skin sides up, on foil-lined baking sheet. Arrange onion slices and garlic around peppers. Broil 6 to 8 inches from heat source, until vegetables are blackened, 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place vegetables in paper bag, seal and let stand 15 minutes.In food processor, combine peppers, onion and garlic and process until finely chopped.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add remaining ingredients and process until smooth.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer mixture to bowl. Fold in cilantro. Season with salt and pepper to taste and serve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 175, u'instructions': u'Cut bell peppers in half lengthwise; discard seeds and membranes. Place pepper halves, skin sides up, on foil-lined baking sheet. Arrange onion slices and garlic around peppers. Broil 6 to 8 inches from heat source, until vegetables are blackened, 10 minutes. Place vegetables in paper bag, seal and let stand 15 minutes.In food processor, combine peppers, onion and garlic and process until finely chopped. Add remaining ingredients and process until smooth. Transfer mixture to bowl. Fold in cilantro. Season with salt and pepper to taste and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoky-red-pepper-dip-761835', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}