{u'recipes': [{u'sourceName': u'Completely Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/591544-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 591544, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vanilla Layer Cake with Easy Fudge Frosting (+ a First Birthday Party!)', u'diets': [], u'pricePerServing': 167.2, u'creditText': u'Completely Delicious', u'extendedIngredients': [{u'originalString': u'4 1/2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1 1/4 cups (297 ml, 10 fl oz) buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'(297 ml, 10 fl oz)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'3 cups (360 g) cake flour, sifted', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 360.0, u'consistency': u'solid', u'id': 10020129, u'unit': u'g'}, {u'originalString': u'2 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'6 tablespoons (90 ml) whole milk or half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 90.0, u'consistency': u'solid', u'id': 1049, u'unit': u'ml'}, {u'originalString': u'4 1/2 cups (563 g) powdered sugar (no need to sift)', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'(no need to sift)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 563.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (400 g) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1 1/2 cups (340 g) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 340.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'6 oz (180 g) unsweetened chocolate, melted and cooled', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 180.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'g'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'4 whole eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.completelydelicious.com/2013/04/yellow-cake-with-chocolate-buttercream.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 56, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Butter and flour 2 (or 3) 8 or 9-inch cake pans and line with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the eggs, egg yolks, 1/4 cup of the buttermilk, and the vanilla extract in a bowl. Set aside.In the bowl of a stand mixer fitted with a paddle attachment, combine the cake flour, sugar, baking powder, salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10020129, u'name': u'cake flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the butter and remaining 1 cup of buttermilk.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix on low speed until moistened, then increase the speed to medium high and beat until light and creamy, about 4 minutes, scraping the bowl down as necessary.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the egg mixture to the mixer in 3 additions, mixing only until incorporated and scraping the bowl down between each addition. Divide the batter between the 2 (or 3) prepared pans.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake until tops are golden and a toothpick inserted into the center comes out with a few dry crumbs, about 25-30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool in the pan for 5 minutes, then turn out onto a wire rack to cool completely.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place all ingredients in a food processor and pulse to incorporate. Process until smooth, about 1 minute.To assemble the cake, place one layer (flat side up) on a plate or cake stand. Cover with the fudge frosting. Repeat with the remaining layers. Cover and frost the top and sides of the cake with the frosting.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Place cake in the fridge for at least 30 minutes to firm up.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Let come to room temperature before serving.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 4218, u'instructions': u'Preheat oven to 350 degrees. Butter and flour 2 (or 3) 8 or 9-inch cake pans and line with parchment paper.Whisk together the eggs, egg yolks, 1/4 cup of the buttermilk, and the vanilla extract in a bowl. Set aside.In the bowl of a stand mixer fitted with a paddle attachment, combine the cake flour, sugar, baking powder, salt. Add the butter and remaining 1 cup of buttermilk. Mix on low speed until moistened, then increase the speed to medium high and beat until light and creamy, about 4 minutes, scraping the bowl down as necessary.Add the egg mixture to the mixer in 3 additions, mixing only until incorporated and scraping the bowl down between each addition. Divide the batter between the 2 (or 3) prepared pans. Bake until tops are golden and a toothpick inserted into the center comes out with a few dry crumbs, about 25-30 minutes. Let cool in the pan for 5 minutes, then turn out onto a wire rack to cool completely.Place all ingredients in a food processor and pulse to incorporate. Process until smooth, about 1 minute.To assemble the cake, place one layer (flat side up) on a plate or cake stand. Cover with the fudge frosting. Repeat with the remaining layers. Cover and frost the top and sides of the cake with the frosting.Place cake in the fridge for at least 30 minutes to firm up. Let come to room temperature before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/vanilla-layer-cake-with-easy-fudge-frosting-+-a-first-birthday-party-591544', u'dishTypes': [u'dessert'], u'occasions': [u'birthday'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}