{u'recipes': [{u'sourceName': u'Memorie Di Angelina', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612039-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 612039, u'veryPopular': True, u'lowFodmap': False, u'title': u'Frittata di zucchine al forno (Baked Frittata with Zucchini)', u'diets': [u'gluten free', u'primal', u'ketogenic'], u'pricePerServing': 156.86, u'creditText': u'Memorie Di Angelina', u'extendedIngredients': [{u'originalString': u'A few fresh basil leaves, torn', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 3.0, u'consistency': u'solid', u'id': 2044, u'unit': u'leaves'}, {u'originalString': u'6-8 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-2 cloves of garlic, peeled and slightly crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'100g (3-1/2 oz) grated Parmesan cheese, or more to taste', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'oz'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4-6 medium zucchini, trimmed and sliced into rounds', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'trimmed', u'sliced into rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://memoriediangelina.com/2014/09/11/frittata-di-zucchine-al-forno-baked-frittata-with-zucchini/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a skillet large enough to contain all the zucchini rounds in one layer, lightly brown the garlic cloves in olive oil. Discard the garlic and add the zucchini. Fry the zucchini until lightly golden brown on both sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Transfer to a plate lined with paper towels or a cooling rack and allow the excess oil to drain off.In a large mixing bowl, lightly beat the eggs and grated cheese together.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Add the fried zucchini rounds and basil leaves then season with salt and pepper to taste.Take a non-stick pie plate or baking sheet with edges at least 2.5cm/1 inch tall, grease the bottom with a bit of olive oil, then add all of the egg mixture, making sure that the zucchini rounds are evenly distributed.Gingerly transfer the baking dish to a hot oven (200C/400F), taking care not to spill the egg and zucchini mixture, and bake for 15-20 minutes, or until the eggs are cooked through and lightly browned on top. If the eggs are cooked but the top is not brown enough to your liking, you can run them under a broiler for a minute or two.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Let your baked frittata cool, then cut it into serving pieces. For serving as part of a buffet or antipasto, let the frittata reach room temperature, then cut into bite-sized squares.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frittatan on the menu? Try pairing with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. You could try Bollinger Brut Special Cuvee. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 60 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'A golden color, distinctive of black grape varieties. Very fine bubbles. On the nose, it has a beautiful aromatic complexity, ripe fruit and spicy aromas, with hints of roasted apples, apple compote and peaches. On the palate, there is a subtle combination of structure, length and vivacity. The bubbles are like velvet. Flavors of pear, brioche and spicy aromas, notes of fresh walnut.Pair with all fish, especially sushi and sashimi, shellfish such as shrimp, prawns, crayfish and grilled lobster, poultry and white meat, cashews, parmesan or prosciutto.', u'title': u'Bollinger Brut Special Cuvee', u'price': u'$59.99', u'id': 433020, u'link': u'https://www.wine.com/product/bollinger-brut-special-cuvee/513', u'imageUrl': u'https://spoonacular.com/productImages/433020-312x231.jpg'}]}, u'aggregateLikes': 1047, u'instructions': u'In a skillet large enough to contain all the zucchini rounds in one layer, lightly brown the garlic cloves in olive oil. Discard the garlic and add the zucchini. Fry the zucchini until lightly golden brown on both sides. Transfer to a plate lined with paper towels or a cooling rack and allow the excess oil to drain off.In a large mixing bowl, lightly beat the eggs and grated cheese together. Add the fried zucchini rounds and basil leaves then season with salt and pepper to taste.Take a non-stick pie plate or baking sheet with edges at least 2.5cm/1 inch tall, grease the bottom with a bit of olive oil, then add all of the egg mixture, making sure that the zucchini rounds are evenly distributed.Gingerly transfer the baking dish to a hot oven (200C/400F), taking care not to spill the egg and zucchini mixture, and bake for 15-20 minutes, or until the eggs are cooked through and lightly browned on top. If the eggs are cooked but the top is not brown enough to your liking, you can run them under a broiler for a minute or two.Let your baked frittata cool, then cut it into serving pieces. For serving as part of a buffet or antipasto, let the frittata reach room temperature, then cut into bite-sized squares.', u'spoonacularSourceUrl': u'https://spoonacular.com/frittata-di-zucchine-al-forno-baked-frittata-with-zucchini-612039', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}