{u'recipes': [{u'sourceName': u'Food.com', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/685246-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 685246, u'veryPopular': True, u'lowFodmap': False, u'title': u'Taco Bell Quesadillas', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 163.26, u'creditText': u'Food.com', u'extendedIngredients': [{u'originalString': u'1⁄8 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'4 chicken tenderloins', u'aisle': u'Meat', u'name': u'chicken tenderloins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1015062, u'unit': u''}, {u'originalString': u'1⁄2 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'4 flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'1⁄8 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons minced jalapenos, slices', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons jalapeno juice, from minced jalepenos', u'aisle': u'Beverages', u'name': u'juice', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1019016, u'unit': u'teaspoons'}, {u'originalString': u'1⁄4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 cup shredded monterey jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1⁄2 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'2 slices process American cheese', u'aisle': u'Cheese', u'name': u'process american cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slices'}, {u'originalString': u'1 dash salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dash'}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'3⁄4 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.food.com/recipe/taco-bell-quesadillas-78194', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine sauce ingredients and stir until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill chicken in vegetable oil and cut into thin slices.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat skillet over medium heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'One at a time, lay tortilla into hot skillet and sprinkle with 1/4 cup of each shredded cheese and 1/2 cheese slice on one side of the tortilla.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Arrange about 1/4 cup chicken slices over tortilla on the same half covered with cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'On the empty side, spread about one tablespoon of sauce.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Fold over, and press gently with spatula.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Cook until cheese is melted and slice each into 4 pieces.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Quesadilla works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Bernardus Rosella's Vineyard Pinot Noir with a 4.7 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come.", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 31018, u'instructions': u'Combine sauce ingredients and stir until smooth.                                        Grill chicken in vegetable oil and cut into thin slices.                                        Preheat skillet over medium heat.                                        One at a time, lay tortilla into hot skillet and sprinkle with 1/4 cup of each shredded cheese and 1/2 cheese slice on one side of the tortilla.                                        Arrange about 1/4 cup chicken slices over tortilla on the same half covered with cheese.                                        On the empty side, spread about one tablespoon of sauce.                                        Fold over, and press gently with spatula.                                        Cook until cheese is melted and slice each into 4 pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/taco-bell-quesadillas-685246', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}