{u'recipes': [{u'sourceName': u'A Zesty Bite', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/568399-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 568399, u'veryPopular': False, u'lowFodmap': False, u'title': u'Backyard Brick Oven Pizza Burgers', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 208.42, u'creditText': u'A Zesty Bite', u'extendedIngredients': [{u'originalString': u'6 ciabatta rolls', u'aisle': u'Bakery/Bread', u'name': u'ciabatta rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 93699, u'unit': u''}, {u'originalString': u'1 Tbsp McCormick Grill Mates Backyard Brick Oven Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'grill seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022034, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 lbs. lean ground beef 80/20', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lbs'}, {u'originalString': u'1/2 cup pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'1 cup mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'2 tomatoes, sliced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.azestybite.com/backyard-brick-oven-pizza-burgers-with-mccormicks/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Preheat the grill to medium heat. Oil down the grates to prevent sticking.In a medium size bowl add the meat, 1/2 the cheese, seasoning and mix until well blended. Shape into 6 patties.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place on the grill and cook each pattie 4-6 minutes on each side. Before removing the patties top with pizza sauce and the rest of the cheese.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from grill and place on ciabatta rolls.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta.jpg', u'id': 93699, u'name': u'ciabatta roll'}]}, {u'equipment': [], u'step': u'Add tomato slices and sprinkle with additional seasoning.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-tomato.jpg', u'id': 10511529, u'name': u'tomato slices'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Belasco de Baquedano Llama Malbec with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'As its namesake, this wine embodies the distinctive spirit of our vineyards, spanning the foothills of the Andes. Llama is a rich ruby-purple color, and boasts elegant flavors of black berries, ripe plum and robust spices with good balance and structure.', u'title': u'Belasco de Baquedano Llama Malbec', u'price': u'$16.99', u'id': 449922, u'link': u'https://www.wine.com/product/belasco-de-baquedano-llama-malbec-2013/132727', u'imageUrl': u'https://spoonacular.com/productImages/449922-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Preheat the grill to medium heat. Oil down the grates to prevent sticking.In a medium size bowl add the meat, 1/2 the cheese, seasoning and mix until well blended. Shape into 6 patties.Place on the grill and cook each pattie 4-6 minutes on each side. Before removing the patties top with pizza sauce and the rest of the cheese.Remove from grill and place on ciabatta rolls. Add tomato slices and sprinkle with additional seasoning.', u'spoonacularSourceUrl': u'https://spoonacular.com/backyard-brick-oven-pizza-burgers-568399', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}