{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536504-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 536504, u'veryPopular': False, u'lowFodmap': False, u'title': u'Buffalo Dip', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 94.65, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'1/4 cup crumbled blue cheese, plus extra for garnish', u'aisle': u'Cheese', u'name': u'blue cheese', u'metaInformation': [u'blue', u'crumbled', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1004, u'unit': u'cup'}, {u'originalString': u'1 tsp. hot sauce (I used Franks Hot Sauce-use whatever you prefer)', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'(I used Franks Hot Sauce-use whatever you prefer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'tsp'}, {u'originalString': u'Vegetables, chicken fingers, popcorn shrimp or wings for dipping.', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'for dipping.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11583, u'unit': u'servings'}, {u'originalString': u'2 Tbsp. parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'1 cup of Greek Yogurt, 0% Plain', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain', u'0%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.acedarspoon.com/buffalo/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a medium sized mixing bowl combine all ingredients and mix well.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place in serving dish and garnish with extra blue cheese crumbles.Please dip in a serving dish and garnish with blue cheese crumbles.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'id': 1001004, u'name': u'blue cheese crumbles'}]}, {u'equipment': [], u'step': u'Serve dip with vegetables (I love it with celery), chicken fingers, chicken wings or popcorn shrimp.Refrigerate leftovers in a sealed container.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip can be paired with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 163, u'instructions': u'In a medium sized mixing bowl combine all ingredients and mix well.Place in serving dish and garnish with extra blue cheese crumbles.Please dip in a serving dish and garnish with blue cheese crumbles.Serve dip with vegetables (I love it with celery), chicken fingers, chicken wings or popcorn shrimp.Refrigerate leftovers in a sealed container.', u'spoonacularSourceUrl': u'https://spoonacular.com/buffalo-dip-536504', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}