{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570015-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 570015, u'veryPopular': False, u'lowFodmap': False, u'title': u'Foil Packet Chicken with Peas and Carrots', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 76.94, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u'18-24 baby carrots', u'aisle': u'Produce', u'name': u'baby carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 11960, u'unit': u''}, {u'originalString': u'1 (1-inch) piece of fresh gingerroot, peeled and grated (I grated mine on my microplane)', u'aisle': u'Produce', u'name': u'fresh gingerroot', u'metaInformation': [u'fresh', u'grated', u'peeled', u'(I mine on my microplane)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'3 garlic cloves, finely chopped or pressed through a garlic press', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6175, u'unit': u'tablespoons'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 cups sugar snap peas', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011300, u'unit': u'cups'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.melskitchencafe.com/foil-packet-chicken-with-snow-peas-and-carrots/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut 4 pieces of aluminum foil (heavy duty) about 12 inches square (if you don’t have heavy-duty aluminum foil, use two pieces of regular aluminum foil for each packet). In a small bowl, combine garlic and ginger (I used my fingers to gently mash them together).Arrange the carrots and peas on the aluminum foil. Sprinkle with the ginger/garlic mixture (this doesn’t sprinkle like salt and pepper so don’t worry if you get a clump here and there – the flavors will absorb while baking), and salt and pepper to taste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Brush the chicken on both sides with the hoisin sauce. Top each portion of vegetables with a piece of chicken. Salt lightly.Bring opposite sides of the foil up to meet over the chicken. Fold the edges together in a \xbc-inch fold, and then fold over 3 more times. Fold the open edges at either end of the packet together in a \xbc-inch fold, and then fold over twice again to seal.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Put the foil packets on a baking sheet and bake for 30-35 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the contents of each packet to a dinner plate and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Preheat the oven to 450 degrees. Cut 4 pieces of aluminum foil (heavy duty) about 12 inches square (if you don’t have heavy-duty aluminum foil, use two pieces of regular aluminum foil for each packet). In a small bowl, combine garlic and ginger (I used my fingers to gently mash them together).Arrange the carrots and peas on the aluminum foil. Sprinkle with the ginger/garlic mixture (this doesn’t sprinkle like salt and pepper so don’t worry if you get a clump here and there – the flavors will absorb while baking), and salt and pepper to taste. Brush the chicken on both sides with the hoisin sauce. Top each portion of vegetables with a piece of chicken. Salt lightly.Bring opposite sides of the foil up to meet over the chicken. Fold the edges together in a \xbc-inch fold, and then fold over 3 more times. Fold the open edges at either end of the packet together in a \xbc-inch fold, and then fold over twice again to seal.Put the foil packets on a baking sheet and bake for 30-35 minutes. Transfer the contents of each packet to a dinner plate and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/foil-packet-chicken-with-peas-and-carrots-570015', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}