{u'recipes': [{u'sourceName': u'Life, Love, and Sugar', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/608637-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 608637, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brownie Brittle Birthday Cake Icebox Cupcakes', u'diets': [], u'pricePerServing': 69.43, u'creditText': u'Life, Love, and Sugar', u'extendedIngredients': [{u'originalString': u'3/4 tsp almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 1002050, u'unit': u'tsp'}, {u'originalString': u'1 1/2 tsp butter extract', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tsp'}, {u'originalString': u'2-3 bags Chocolate Chip Brownie Brittle (4 oz bags)', u'aisle': u'Sweet Snacks', u'name': u'chocolate chip cookie', u'metaInformation': [u'(4 oz bags)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chip-cookie.png', u'unitLong': u'bags', u'unitShort': u'bags', u'amount': 2.0, u'consistency': u'solid', u'id': 28027, u'unit': u'bags'}, {u'originalString': u'2 cups heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.lifeloveandsugar.com/2014/08/18/brownie-brittle-birthday-cake-icebox-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Freeze metal bowl and whisk for 15-20 minutes to get them good and cold.2.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove bowl from freezer and add whipping cream.3. Whip on medium-high speed for a few minutes. Cream will initially bubble a little bit, then start to thicken.4. As the cream starts to thicken, add the powdered sugar and extracts.5. Whip until stiff peaks form, for a total whipping time of about 5-7 minutes. Make sure not to over mix. It quickly goes from smooth whipped cream to curdled whipped cream, so watch it closely.6. To make each cupcake, place one brownie brittle square on a plate, or whatever surface your using. 7. Pipe, or scoop, a layer of whipped cream onto the brownie brittle.8. Top with another brownie brittle square, followed by another layer of whipped cream.9. Repeat step 8, then top with sprinkles.10. Repeat steps 6-9, until you have all the icebox cupcakes.11.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Place cupcakes in fridge for at least 3-4 hours, or until ready to serve. Cupcakes should be good for about 5 days.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1616, u'instructions': u'1. Freeze metal bowl and whisk for 15-20 minutes to get them good and cold.2. Remove bowl from freezer and add whipping cream.3. Whip on medium-high speed for a few minutes. Cream will initially bubble a little bit, then start to thicken.4. As the cream starts to thicken, add the powdered sugar and extracts.5. Whip until stiff peaks form, for a total whipping time of about 5-7 minutes. Make sure not to over mix. It quickly goes from smooth whipped cream to curdled whipped cream, so watch it closely.6. To make each cupcake, place one brownie brittle square on a plate, or whatever surface your using. 7. Pipe, or scoop, a layer of whipped cream onto the brownie brittle.8. Top with another brownie brittle square, followed by another layer of whipped cream.9. Repeat step 8, then top with sprinkles.10. Repeat steps 6-9, until you have all the icebox cupcakes.11. Place cupcakes in fridge for at least 3-4 hours, or until ready to serve. Cupcakes should be good for about 5 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/brownie-brittle-birthday-cake-icebox-cupcakes-608637', u'dishTypes': [u'dessert'], u'occasions': [u'birthday'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}