{u'recipes': [{u'sourceName': u'Fountain Venue Kitchen', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/628494-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 628494, u'veryPopular': False, u'lowFodmap': True, u'title': u'Three Ingredient Mexican Cheese Bites', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'pricePerServing': 20.41, u'creditText': u'Fountain Venue Kitchen', u'extendedIngredients': [{u'originalString': u'3 eggs, well beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'well beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups grated reduced fat cheddar cheese (see notes)', u'aisle': u'Cheese', u'name': u'reduced fat shredded cheddar cheese', u'metaInformation': [u'grated', u'(see notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1001168, u'unit': u'cups'}, {u'originalString': u"4 ounces (1/2 cup plus 1 tablespoon) Mrs. Renfro's Green Salsa", u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'green', u'(1/2 cup plus 1 tablespoon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'ounces'}, {u'originalString': u'1 1/2 cups grated sharp cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1031009, u'unit': u'cups'}, {u'originalString': u'Optional for serving: tortilla chips', u'aisle': u'?', u'name': u'optional', u'metaInformation': [u'for serving: tortilla chips'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://fountainavenuekitchen.com/3-ingredient-mexican-cheese-bites/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.Sprinkle 3/4 cup (half) of eachcheese over the bottom of a 99 or 117 baking dish. (There is no need to grease the dish.) Beat or whisk the eggs in a small bowl, and then thoroughly mix in the salsa.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Drizzle the egg/salsa mixture evenly over cheese. Layer the remaining cheese on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for approximately 25 minutes or until the mixture is just set in the middle and the edges are a little crispy. Cool for 5-10 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Cut in small squares and serve on tortilla chips. Gently reheat leftovers in the oven or toaster oven, if desired.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Argyle Reserve Pinot Noir. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 24, u'instructions': u'Preheat the oven to 350 degrees F.Sprinkle 3/4 cup (half) of eachcheese over the bottom of a 99 or 117 baking dish. (There is no need to grease the dish.) Beat or whisk the eggs in a small bowl, and then thoroughly mix in the salsa.Drizzle the egg/salsa mixture evenly over cheese. Layer the remaining cheese on top.Bake for approximately 25 minutes or until the mixture is just set in the middle and the edges are a little crispy. Cool for 5-10 minutes. Cut in small squares and serve on tortilla chips. Gently reheat leftovers in the oven or toaster oven, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/three-ingredient-mexican-cheese-bites-628494', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}