{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/415255-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 415255, u'veryPopular': False, u'lowFodmap': False, u'title': u'Garlic-Onion Pizza Wedges', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 81.96, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup minced fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/2 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 prebaked 12-inch thin pizza crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'1/2 cup chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/garlic-onion-pizza-wedges', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine the cheese, onion, mayonnaise, basil, garlic and pepper; spread over crust.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place on an ungreased baking sheet or pizza pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 450\xb0 for 8-10 minutes or until lightly browned.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into wedges.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Di Majo Norante Sangiovese with a 4.1 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Vivid ruby red in color with a fresh bouquet of violets and woodland berries. Smooth and refreshing with loads of ripe fruit. An excellent accompaniment to antipasti, first courses and grilled white meats', u'title': u'Di Majo Norante Sangiovese', u'price': u'$8.99', u'id': 434381, u'link': u'https://www.wine.com/product/di-majo-norante-sangiovese-2000/38435', u'imageUrl': u'https://spoonacular.com/productImages/434381-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Directions                                                                                In a small bowl, combine the cheese, onion, mayonnaise, basil, garlic and pepper; spread over crust.                                                                                            Place on an ungreased baking sheet or pizza pan. Bake at 450\xb0 for 8-10 minutes or until lightly browned. Cut into wedges.                                        Yield: 8 servings.                                                                                                                         Originally published as Garlic-Onion Pizza Wedges in  Country Woman ChristmasAnnual 2008, p111                                                                                                                                                                                                       Nutritional Facts                                                                             1 slice equals 234 calories, 15 g fat (3 g saturated fat), 9 mg cholesterol, 357 mg sodium, 19 g carbohydrate, 1 g fiber, 6 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-onion-pizza-wedges-415255', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}