{u'recipes': [{u'sourceName': u'Eggless Cooking', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/246861-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 246861, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Chip Banana Muffins', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 54.23, u'creditText': u'Eggless Cooking', u'extendedIngredients': [{u'originalString': u'2 cups All purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'3 Ripe Mashed Small Bananas', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'ripe', u'small', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1/4 cup Buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'3/4 cup Granulated Sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 tablespoons Low fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'tablespoons'}, {u'originalString': u'1 cup (optional) Chopped Pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'a pinch Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3/4 cup Semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'10 tablespoons (1 1/4 sticks) Unsalted, Melted Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'(1 1/4 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 10.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.egglesscooking.com/2009/04/15/banana-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400F for 15 minutes.  Line the muffin tin with paper liners or grease the tin.In a medium size bowl combine together the milk, butter and buttermilk.In another large bowl sift together the flour, salt and baking powder.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the sugar, chocolate chips and nuts to the flour mixture and stir well.Slowly stir in the wet ingredients to the dry ingredients, but do not overdo it.Fold in the mashed bananas.Fill each muffin cup with 3 tablespoons of batter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 20 minutes or until a toothpick inserted in the center of the muffin comes out clean.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern works really well with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Concrete Old Vine Zinfandel. It has 4.5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'This Zinfandel is a luscious, smooth, full-bodied wine with aromas of blackberry, bramble berry and Allspice. Deliciously mouth-filling, the wine opens up to sweet vanilla and toasty oak flavors, then follows with a concentrated core of well-balanced acidity, soft, but firm tannins and a lingering finish on the palate.Concrete Old Vine Zinfandel is an excellent partner to spicy BBQ, zesty pasta and pizza, or juicy burgers.  View More', u'title': u'Concrete Old Vine Zinfandel', u'price': u'$17.99', u'id': 439670, u'link': u'https://www.wine.com/product/concrete-old-vine-zinfandel-2013/304339', u'imageUrl': u'https://spoonacular.com/productImages/439670-312x231.jpg'}]}, u'aggregateLikes': 88, u'instructions': u'Preheat the oven to 400F for 15 minutes.  Line the muffin tin with paper liners or grease the tin.In a medium size bowl combine together the milk, butter and buttermilk.In another large bowl sift together the flour, salt and baking powder.Add the sugar, chocolate chips and nuts to the flour mixture and stir well.Slowly stir in the wet ingredients to the dry ingredients, but do not overdo it.Fold in the mashed bananas.Fill each muffin cup with 3 tablespoons of batter.Bake for 20 minutes or until a toothpick inserted in the center of the muffin comes out clean.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chip-banana-muffins-246861', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}