{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523138-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 523138, u'veryPopular': True, u'lowFodmap': False, u'title': u'Healthy Homemade Oreo Milkshake (vegan and gluten free!)', u'diets': [], u'pricePerServing': 149.96, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'3/4 cup Unsweetened Vanilla Almond Milk (or "milk")', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened', u'(or "milk")'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'3 Homemade Oreos, broken up (do not use storebought!)', u'aisle': u'Sweet Snacks', u'name': u'oreos', u'metaInformation': [u'homemade', u'(do not use storebought!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1 scoop Vanilla Brown Rice Protein Powder (I used SunWarrior; or protein powder)', u'aisle': u'Health Foods', u'name': u'rice protein powder', u'metaInformation': [u'(I used SunWarrior; or protein powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 93707, u'unit': u'scoop'}, {u'originalString': u'3 packets Truvia (or sweetener)', u'aisle': u'Baking', u'name': u'truvia', u'metaInformation': [u'(or sweetener)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'packets', u'unitShort': u'packets', u'amount': 3.0, u'consistency': u'solid', u'id': 93628, u'unit': u'packets'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://dessertswithbenefits.com/oreo-milkshake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add all the ingredients to a blender and blend until the texture you like (I like mine a tad bit chunky)Drink!', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 542, u'instructions': u'Add all the ingredients to a blender and blend until the texture you like (I like mine a tad bit chunky)Drink!', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-homemade-oreo-milkshake-vegan-and-gluten-free-523138', u'dishTypes': [u'dessert', u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}