{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549165-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 549165, u'veryPopular': True, u'lowFodmap': False, u'title': u'Reese’s Peanut Butter Marshmallow Cookie Pie', u'diets': [u'dairy free'], u'preparationMinutes': 2, u'pricePerServing': 102.85, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1/2 cup chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'Hot fudge for drizzle', u'aisle': u'Sweet Snacks', u'name': u'fudge', u'metaInformation': [u'hot', u'for drizzle'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fudge-isolated.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 19100, u'unit': u'servings'}, {u'originalString': u'1 1/2 to 2 cups of mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'1 package peanut butter cookie dough or 1 recipe of dough *we use Pillsbury', u'aisle': u'Baking', u'name': u'peanut butter cookie mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cookies-isolated.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 99047, u'unit': u'package'}, {u'originalString': u"12 Reese's Peanut Butter Cups", u'aisle': u'Sweet Snacks', u'name': u'peanut butter cups', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 19150, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2014/02/reeses-peanut-butter-marshmallow-cookie-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat the oven to 350.Spray a pie pan with nonstick cooking spray. Press 2/3 of the dough all over the bottom and sides of the pie plate.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"Bake for 5 to 8 minutes or until, as seen in the photo, it's starting to set up, but is not baked through.Sprinkle chocolate chips evenly over the bottom, and add the peanut butter cups. Sprinkle marshmallows over the top. Press 1/4 cup sized balls of remaining dough into the palm of your hand  and carefully place on the top of the pie.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Bake for an additional 15--18 minutes or until golden brown. Remember, the insides are gooey so it will jiggle a little coming out. Cool for 6-10 minutes before slicing or 20 minutes for the perfect piece to come out.', u'length': {u'number': 48, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with hot fudge for serving. *see note for baking tips', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fudge-isolated.jpg', u'id': 19100, u'name': u'fudge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Red Apple, Honeyed, Sweet', u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 44597, u'instructions': u"Heat the oven to 350.Spray a pie pan with nonstick cooking spray. Press 2/3 of the dough all over the bottom and sides of the pie plate. Bake for 5 to 8 minutes or until, as seen in the photo, it's starting to set up, but is not baked through.Sprinkle chocolate chips evenly over the bottom, and add the peanut butter cups. Sprinkle marshmallows over the top. Press 1/4 cup sized balls of remaining dough into the palm of your hand  and carefully place on the top of the pie. Bake for an additional 15--18 minutes or until golden brown. Remember, the insides are gooey so it will jiggle a little coming out. Cool for 6-10 minutes before slicing or 20 minutes for the perfect piece to come out. Drizzle with hot fudge for serving. *see note for baking tips", u'spoonacularSourceUrl': u'https://spoonacular.com/reeses-peanut-butter-marshmallow-cookie-pie-549165', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}