{u'recipes': [{u'sourceName': u'Kitchen Confidante', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/606609-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 606609, u'veryPopular': False, u'lowFodmap': False, u'title': u"Nutella S'mores Parfaits", u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 67.37, u'creditText': u'Kitchen Confidante', u'extendedIngredients': [{u'originalString': u'3/4 cup graham crack crumbs (about 6 crackers)', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [u'( 6 crackers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10018617, u'unit': u'cup'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 cup marshmallow fluff', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'marshmallow fluff', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93644, u'unit': u'cup'}, {u'originalString': u'1/4 cup Nutella', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19125, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://kitchenconfidante.com/nutella-smores-parfaits-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place 2 tablespoons of graham cracker crumbs at the bottom of each cup.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}, {u'equipment': [], u'step': u'Place about 2 tablespoons of whipped cream, followed by about 1 tablespoon Nutella, spreading the layers evenly from the inside to the edges. Sprinkle with about another tablespoon of graham crackers, then another tablespoon of whipped cream. To the top of each, place a dollop of marshmallow fluff. Brown the top of the marshmallow with a kitchen torch if you wish, be careful not to burn it. Insert a graham cracker on top and serve immediately.The components of the dessert can be prepared in advance, but the dessert is best when assembled right before serving. However, in a pinch, you can also prepare the parfaits in advance and refrigerate until ready to serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93644, u'name': u'marshmallow cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Parfait on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 83, u'instructions': u'Place 2 tablespoons of graham cracker crumbs at the bottom of each cup. Place about 2 tablespoons of whipped cream, followed by about 1 tablespoon Nutella, spreading the layers evenly from the inside to the edges. Sprinkle with about another tablespoon of graham crackers, then another tablespoon of whipped cream. To the top of each, place a dollop of marshmallow fluff. Brown the top of the marshmallow with a kitchen torch if you wish, be careful not to burn it. Insert a graham cracker on top and serve immediately.The components of the dessert can be prepared in advance, but the dessert is best when assembled right before serving. However, in a pinch, you can also prepare the parfaits in advance and refrigerate until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/nutella-smores-parfaits-606609', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}