{u'recipes': [{u'sourceName': u'Foodista', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/649049-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 649049, u'veryPopular': False, u'lowFodmap': False, u'title': u'Korean Extra Crispy Fried Chicken w Sweet Spicy Glaze', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 226.46, u'creditText': u'Foodista.com – The Cooking Encyclopedia Everyone Can Edit', u'extendedIngredients': [{u'originalString': u'5 tbsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'canola oil, for frying (peanut oil if available)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying', u'(peanut oil if available)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'24 chicken wings, cut into 3 pieces and tips discarded', u'aisle': u'Meat', u'name': u'chicken wings', u'metaInformation': [u'cut into 3 pieces and tips discarded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 5100, u'unit': u''}, {u'originalString': u'1 cup cornstarch (1/2 cup for coating, \xbd cup for batter)', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [u'for coating, \xbd cup for batter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'10 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tbsp honey (or mulyeot, corn syrup)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'(or mulyeot, corn syrup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'tbsp'}, {u'originalString': u'1, 2 tbsp rice vinegar (or cider vinegar)', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [u'(or cider vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1102047, u'unit': u'tsp'}, {u'originalString': u'1/4 cup sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4058, u'unit': u'cup'}, {u'originalString': u'sesame seeds (garnish)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'(garnish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'3 tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'3, 4 Thai chili peppers, deseeded and finely minced', u'aisle': u'Produce;Ethnic Foods', u'name': u'thai chili peppers', u'metaInformation': [u'finely minced', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11670, u'unit': u''}, {u'originalString': u'10 cups of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 10.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.foodista.com/recipe/LYJP4NPZ/korean-extra-crispy-fried-chicken-w-sweet-spicy-glaze', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Cut and discard the end tip of each chicken wing. cut remaining pieces in half at the joint to create 2 pieces. Rinse pieces under cold water and set to dry for at least 10 minutes. In a heavy pot such as a dutch oven, pour in canola or peanut oil to a depth of 3 inches.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat over medium-high for about 15 minutes or until ready for frying.2. In the meantime, combine sauce ingredients of soy, vinegar, sugar, honey, ketchup, sesame oil, Thai chili peppers, and the seasoning in a small sauce pan. Boil until sauce slightly thickens and then set at low heat. Adjust the spiciness/sweetness of the sauce by adding more minced red peppers and/or sugar, continuously tasting for desired result.3. In a large mixing bowl, mix 1 cup cornstarch and salt and pepper. Individually coat each chicken wing pieces with the cornstarch and set aside.4. In another bowl, whisk the remaining cornstarch and water together to make a runny, liquidy batter.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'id': 11670, u'name': u'thai chili'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add each chicken wing one at a time and coat well. Shake off excess batter and fry the chicken in batches for about 10~13 minutes, or until golden brown, then drain on paper towels. Do not overcrowd the pan when frying each batch.5. Flavor the wings with a brush or by tossing them all together in a mixing bowl.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [], u'step': u'Transfer to a serving plate and garnish with sesame seeds. Enjoy and eat while hot!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'<ol><li>1. Cut and discard the end tip of each chicken wing. cut remaining pieces in half at the joint to create 2 pieces. Rinse pieces under cold water and set to dry for at least 10 minutes. In a heavy pot such as a dutch oven, pour in canola or peanut oil to a depth of 3 inches. Heat over medium-high for about 15 minutes or until ready for frying.</li><li>2. In the meantime, combine sauce ingredients of soy, vinegar, sugar, honey, ketchup, sesame oil, Thai chili peppers, and the seasoning in a small sauce pan. Boil until sauce slightly thickens and then set at low heat. Adjust the spiciness/sweetness of the sauce by adding more minced red peppers and/or sugar, continuously tasting for desired result.</li><li>3. In a large mixing bowl, mix 1 cup cornstarch and salt and pepper. Individually coat each chicken wing pieces with the cornstarch and set aside.</li><li>4. In another bowl, whisk the remaining cornstarch and water together to make a runny, liquidy batter. Add each chicken wing one at a time and coat well. Shake off excess batter and fry the chicken in batches for about 10~13 minutes, or until golden brown, then drain on paper towels. Do not overcrowd the pan when frying each batch.</li><li>5. Flavor the wings with a brush or by tossing them all together in a mixing bowl. Transfer to a serving plate and garnish with sesame seeds. Enjoy and eat while hot!</li></ol>', u'spoonacularSourceUrl': u'https://spoonacular.com/korean-extra-crispy-fried-chicken-w-sweet-spicy-glaze-649049', u'license': u'CC BY 3.0', u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}