{u'recipes': [{u'sourceName': u'Veg Recipes of India', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/487457-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 487457, u'veryPopular': True, u'lowFodmap': False, u'title': u'veg fried rice , how to make vegetable fried rice | rice s', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 124.34, u'creditText': u'Veg Recipes of India', u'extendedIngredients': [{u'originalString': u'5-6 button mushrooms, sliced or finely chopped', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'sliced', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'\xbd cup finely chopped or shredded cabbage', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11109, u'unit': u'cup'}, {u'originalString': u'1 small capsicum, finely chopped', u'aisle': u'Produce', u'name': u'capsicum', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 medium size carrot, finely chopped or shredded', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'shredded', u'medium size', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'\xbd tbsp finely chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp finely chopped garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp finely chopped ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'1.5 cup basmati rice or medium to long grained rice', u'aisle': u'Pasta and Rice', u'name': u'long-grain rice', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}, {u'originalString': u'salt and black pepper as required', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8-10 french beans, thinly sliced diagonally or finely chopped', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'french', u'thinly sliced', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 16033, u'unit': u''}, {u'originalString': u'2 to 3 medium spring onions, finely chopped, reserve the greens for garnishing', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'medium', u'finely chopped', u'for garnishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 star anise', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}, {u'originalString': u'4 to 5 cups water for cooking the rice', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'for cooking the rice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 tbsp naturally fermented soy sauce or as required', u'aisle': u'?', u'name': u'as required', u'metaInformation': [], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tbsp'}], u'healthScore': 99.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.vegrecipesofindia.com/veg-fried-rice-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'soak rice in water for 30 mins.drain and cook the rice in 4 to 5 cups water, till the grains are al dente or just cooked.strain in a colander and let the rice cool completely. cover and keep the rice aside.when the rice is cooling, chop the veggies and keep aside.heat oil in a wok or a pan. first add the star anise and fry for half a minute or till the oil becomes fragrant.tip in the ginger and garlic and saute for some seconds. no need to brown the garlic and ginger.add the spring onions and stir fry till they are transparent. add all the veggies and stir fry on a high flame.if you cannot handle stir frying on a high flame, then stir fry on a medium flame.you have to continuously toss and stir while frying so that the veggies are uniformly cooked and do not get burnt.the veggies have to be cooked till they are almost cooked and yet retain their crunchiness and crispiness.add the soy sauce, salt and pepper. stir quickly and add the rice. stir fry for a few minutes till the sauce has coated the fried rice well.serve the veg fried rice hot plain or with a indo chinese vegetable recipe.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. One wine you could try is Mulderbosch Chenin Blanc. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 472, u'instructions': u'soak rice in water for 30 mins.drain and cook the rice in 4 to 5 cups water, till the grains are al dente or just cooked.strain in a colander and let the rice cool completely. cover and keep the rice aside.when the rice is cooling, chop the veggies and keep aside.heat oil in a wok or a pan. first add the star anise and fry for half a minute or till the oil becomes fragrant.tip in the ginger and garlic and saute for some seconds. no need to brown the garlic and ginger.add the spring onions and stir fry till they are transparent. add all the veggies and stir fry on a high flame.if you cannot handle stir frying on a high flame, then stir fry on a medium flame.you have to continuously toss and stir while frying so that the veggies are uniformly cooked and do not get burnt.the veggies have to be cooked till they are almost cooked and yet retain their crunchiness and crispiness.add the soy sauce, salt and pepper. stir quickly and add the rice. stir fry for a few minutes till the sauce has coated the fried rice well.serve the veg fried rice hot plain or with a indo chinese vegetable recipe.', u'spoonacularSourceUrl': u'https://spoonacular.com/veg-fried-rice-how-to-make-vegetable-fried-rice-rice-s-487457', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}