{u'recipes': [{u'sourceName': u'Your Homebased Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485820-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 485820, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mint Striped Delight and $25.00 Walmart Gift Card Giveaway', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 77.72, u'creditText': u'Your Homebased Mom', u'extendedIngredients': [{u'originalString': u'6 Tbsp. butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 pkg. (8 oz.) PHILADELPHIA Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'green food coloring', u'aisle': u'Baking', u'name': u'green food coloring', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'2 pkg. (3.9 oz. each) JELL-O Chocolate Instant Pudding', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.8, u'consistency': u'solid', u'id': 19184, u'unit': u'oz'}, {u'originalString': u'3-1/4 cups cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'35 OREO Cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 35.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1/2 - 1 tsp peppermint extract (depending on how minty you want it)', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [u'(depending on how minty you want it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022050, u'unit': u'tsp'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tub (12 oz.) COOL WHIP Whipped Topping, thawed, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'divided', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 42135, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.yourhomebasedmom.com/mint-striped-delight/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'PROCESS cookies in food processor until fine crumbs form.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to medium bowl; mix in butter. Press onto bottom of 13\xd79-inch dish. Refrigerate until ready to use.WHISK cream cheese, sugar and 2 Tbsp. milk in medium bowl until blended.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add in peppermint extract and green food coloring', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'green food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1022050, u'name': u'peppermint extract'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Stir in 1-1/4 cups COOL WHIP; spread over crust.BEAT pudding mixes and 3-1/4 cups milk with whisk 2 min.; pour over cream cheese layer.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let stand 5 min. or until thickened; cover with remaining COOL WHIP. Refrigerate 4 hours.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place dessert in refrigerator for about 4 hours before cutting into squares to serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1011, u'instructions': u'PROCESS cookies in food processor until fine crumbs form. Transfer to medium bowl; mix in butter. Press onto bottom of 13\xd79-inch dish. Refrigerate until ready to use.WHISK cream cheese, sugar and 2 Tbsp. milk in medium bowl until blended. Add in peppermint extract and green food coloringStir in 1-1/4 cups COOL WHIP; spread over crust.BEAT pudding mixes and 3-1/4 cups milk with whisk 2 min.; pour over cream cheese layer.Let stand 5 min. or until thickened; cover with remaining COOL WHIP. Refrigerate 4 hours.Place dessert in refrigerator for about 4 hours before cutting into squares to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/mint-striped-delight-and-25-00-walmart-gift-card-giveaway-485820', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 260, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}