{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/695346-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 695346, u'veryPopular': True, u'lowFodmap': False, u'title': u'Flemish Beef Stew', u'diets': [u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 197.71, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 cups brown ale, or dark beer', u'aisle': u'Alcoholic Beverages', u'name': u'ale', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014006, u'unit': u'cups'}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 pounds bottom round, trimmed of fat and cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'bottom round roast', u'metaInformation': [u'trimmed of fat', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 13411, u'unit': u'pounds'}, {u'originalString': u'4 teaspoons canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon caraway seeds', u'aisle': u'Spices and Seasonings', u'name': u'caraway seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2005, u'unit': u'teaspoon'}, {u'originalString': u'4 large carrots, peeled and cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'peeled', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 1/2 tablespoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 pound sliced cremini, or white button mushrooms', u'aisle': u'Produce', u'name': u'white button mushrooms', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/flemish_beef_stew.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 teaspoons oil in a large skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add half the beef and brown on all sides, turning frequently, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer to a 6-quart slow cooker.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain any fat from the pan.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the remaining 2 teaspoons oil and brown the remaining beef.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to the slow cooker.Return the skillet to medium heat, add mushrooms and cook, stirring often, until they give off their liquid and it evaporates to a glaze, 5 to 7 minutes. Sprinkle flour over the mushrooms; cook undisturbed for 10 seconds, then stir and cook for 30 seconds more.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour in ale (or beer); bring to a boil, whisking constantly to reduce foaming, until thickened and bubbling, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10014006, u'name': u'ale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer the mushroom mixture to the slow cooker.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add carrots, onion, garlic, mustard, caraway seeds, salt, pepper and bay leaf to the slow cooker. Stir to combine.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'id': 2005, u'name': u'caraway seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Put the lid on and cook on low until the beef is very tender, about 8 hours. Discard the bay leaf before serving.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Malbec, and Shiraz are great choices for Beef Stew. These full-bodied red wines are the perfect accompaniment for hearty beef stew. You could try Gnarly Head Cabernet Sauvignon. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'Gold Medal Winner: 2014 Los Angeles International Wine CompetitionGnarly Head 2012 Cabernet Sauvignon is King - big, gallant and powerful. This dark, bold Cabernet has solid tannins and jammy fruit, with aromas of black cherry, blackberry, freshly-cracked black peppercorn, violet and charred notes. On the palate, flavors of dense black fruit compote and currant followed by a trio of clove, spice and earth, lead to a generous, lingering finish.Try pairing this Cabernet with grilled lamb skewers, strong cheeses or a spaghetti Bolognese. View More', u'title': u'Gnarly Head Cabernet Sauvignon', u'price': u'$11.99', u'id': 442127, u'link': u'https://www.wine.com/product/gnarly-head-cabernet-sauvignon-2012/129675', u'imageUrl': u'https://spoonacular.com/productImages/442127-312x231.jpg'}]}, u'aggregateLikes': 2446, u'instructions': u'Heat 2 teaspoons oil in a large skillet over medium heat. Add half the beef and brown on all sides, turning frequently, about 5 minutes. Transfer to a 6-quart slow cooker. Drain any fat from the pan. Add the remaining 2 teaspoons oil and brown the remaining beef. Transfer to the slow cooker.Return the skillet to medium heat, add mushrooms and cook, stirring often, until they give off their liquid and it evaporates to a glaze, 5 to 7 minutes. Sprinkle flour over the mushrooms; cook undisturbed for 10 seconds, then stir and cook for 30 seconds more. Pour in ale (or beer); bring to a boil, whisking constantly to reduce foaming, until thickened and bubbling, about 3 minutes. Transfer the mushroom mixture to the slow cooker.Add carrots, onion, garlic, mustard, caraway seeds, salt, pepper and bay leaf to the slow cooker. Stir to combine.Put the lid on and cook on low until the beef is very tender, about 8 hours. Discard the bay leaf before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/flemish-beef-stew-695346', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 525, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}