{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/544096-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 544096, u'veryPopular': True, u'lowFodmap': False, u'title': u'Olive Garden Copycat Minestrone Soup', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 251.3, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 (14.5 oz) cans diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned diced tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 11531, u'unit': u'oz'}, {u'originalString': u'1 (15 oz) can white navy beans or cannellini beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned white cannellini beans', u'metaInformation': [u'white', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'oz'}, {u'originalString': u'1 cup diced carrots (2 carrots)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'(2 carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup diced celery (3 stalks)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'(3 stalks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'2 tsp dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2003, u'unit': u'tsp'}, {u'originalString': u'3/4 tsp dried rosemary, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp chopped fresh parsley (or 2 tsp dried)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'dried', u'fresh', u'chopped', u'(or 2 tsp )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 (14.5 oz) can Italian green beans, drained', u'aisle': u'Produce', u'name': u'italian beans', u'metaInformation': [u'green', u'italian', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/runner-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011052, u'unit': u'oz'}, {u'originalString': u'1 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 (15 oz) can dark red kidney beans, drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red kidney beans', u'metaInformation': [u'dark', u'red', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16033, u'unit': u'oz'}, {u'originalString': u'Finely shredded Romano cheese, for serving (Parmesan works too)', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [u'shredded', u'for serving (parmesan works too)', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1038, u'unit': u'servings'}, {u'originalString': u'Salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/3 cups shell pasta', u'aisle': u'Pasta and Rice', u'name': u'shell pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shell-pasta.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 11020420, u'unit': u'cups'}, {u'originalString': u'2 cups packed chopped fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'packed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'1/2 tsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'4 cups low-sodium vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 cup diced yellow onion (1 small)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}, {u'originalString': u'1 1/3 cups diced zucchini (1 small)', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 77.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.cookingclassy.com/2013/11/olive-garden-copycat-minestrone-soup-slow-cooker/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add vegetable stock, water, tomatoes, celery, carrots, onion, parsley, basil, oregano, thyme, rosemary, bay leaves and sugar to a 6 or 7-quart slow cooker. Season with salt and pepper to taste and cook on low heat 6 - 8 hours or high 3 - 4 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6615, u'name': u'vegetable stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add in zucchini, pasta, garlic, kidney beans and white beans and cook on high heat and additional 30 - 40 minutes until pasta is tender. Stir in spinach and Italian green beans and cook several minutes until heated through. Stir in more vegetable broth or water to thin if desired.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'id': 16033, u'name': u'kidney beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve warm topped with Romano cheese. Recipe Source: Cooking Classy', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'romano cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian can be paired with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Mazzei Chianti Classico Riserva Ser Lapo. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with violet nuances, this wine has bright aromas of fresh cherries mingle with notes of thyme and subtle smoky nuances. In the mouth, this wine has a bright acid structure providing a lively quality. Cranberry, raspberry and red cherry dominate with hints of leather, cedar and cocoa powder. Some earthiness in the finish and ripe soft tannins.Pasta with meat sauces, stews, grilled meats and mid-aged cheeses.', u'title': u'Mazzei Chianti Classico Riserva Ser Lapo', u'price': u'$26.99', u'id': 452096, u'link': u'https://www.wine.com/product/mazzei-chianti-classico-riserva-ser-lapo-2011/146710', u'imageUrl': u'https://spoonacular.com/productImages/452096-312x231.jpg'}]}, u'aggregateLikes': 1210, u'instructions': u'Add vegetable stock, water, tomatoes, celery, carrots, onion, parsley, basil, oregano, thyme, rosemary, bay leaves and sugar to a 6 or 7-quart slow cooker. Season with salt and pepper to taste and cook on low heat 6 - 8 hours or high 3 - 4 hours. Add in zucchini, pasta, garlic, kidney beans and white beans and cook on high heat and additional 30 - 40 minutes until pasta is tender. Stir in spinach and Italian green beans and cook several minutes until heated through. Stir in more vegetable broth or water to thin if desired. Serve warm topped with Romano cheese. Recipe Source: Cooking Classy', u'spoonacularSourceUrl': u'https://spoonacular.com/olive-garden-copycat-minestrone-soup-544096', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 380, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}