{u'recipes': [{u'sourceName': u'Two Peas and Their Pod', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/548025-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 548025, u'veryPopular': False, u'lowFodmap': False, u'title': u'Portobello Mushroom Burgers', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 199.13, u'creditText': u'Two Peas and Their Pod', u'extendedIngredients': [{u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'4 large portobello mushrooms', u'aisle': u'Produce', u'name': u'portobello mushrooms', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11265, u'unit': u''}, {u'originalString': u'4 slices Provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 sandwich buns', u'aisle': u'Bakery/Bread', u'name': u'sandwich buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18353, u'unit': u''}, {u'originalString': u'Condiments-Tomato slices, red onion, lettuce, mustard, ketchup', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'slices'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.twopeasandtheirpod.com/portobello-mushroom-burgers-a-giveaway/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Lightly brush each portobello mushroom with olive oil and season with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place mushrooms gill side up on grill over medium-high heat. Cook for 4-5 minutes and then flip mushrooms. Cook for another 4-5 minutes. 2.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place provolone cheese slices on top of each mushroom. Cook until cheese is melted.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'id': 1035, u'name': u'provolone cheese slices'}]}, {u'equipment': [], u'step': u'Place hot mushrooms on sandwich buns. Top with condiments of your choice-tomato slices, red onion, lettuce, mustard, ketchup, etc.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'id': 18353, u'name': u'sandwich bun'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Gascon Malbec Riserva with a 4.4 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Dark, rich and complex, Don Miguel Gascon Reserva Malbec is a powerful, yet fresh, wine. An elegant nose features hints of violet, blackberry and blackcurrants, with subtle aromas of chocolate mint. The wine is robust and strong on the palate, with smooth tannins and distinctive layers of dried plum, dates and cherry flavors that integrate seamlessly with notes of almond and hazelnut, backed up by a long and velvety-smooth finish. View More', u'title': u'Gascon Malbec Riserva', u'price': u'$20.99', u'id': 454160, u'link': u'https://www.wine.com/product/gascon-malbec-riserva-2014/162603', u'imageUrl': u'https://spoonacular.com/productImages/454160-312x231.jpg'}]}, u'aggregateLikes': 168, u'instructions': u'1. Lightly brush each portobello mushroom with olive oil and season with salt and pepper. Place mushrooms gill side up on grill over medium-high heat. Cook for 4-5 minutes and then flip mushrooms. Cook for another 4-5 minutes. 2. Place provolone cheese slices on top of each mushroom. Cook until cheese is melted. Place hot mushrooms on sandwich buns. Top with condiments of your choice-tomato slices, red onion, lettuce, mustard, ketchup, etc. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/portobello-mushroom-burgers-548025', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}