{u'recipes': [{u'sourceName': u'Laa Loosh', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548675-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 548675, u'veryPopular': False, u'lowFodmap': True, u'title': u'Glazed Turnips – 2 Points', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 52.37, u'creditText': u'Laa Loosh', u'extendedIngredients': [{u'originalString': u'1 tbsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp low calorie butter (I used Brummel & Brown)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(I used Brummel & Brown)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 tsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'1/4 cup parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1lb fresh turnips', u'aisle': u'Produce', u'name': u'turnips', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11564, u'unit': u'lb'}, {u'originalString': u'2 tsp fat free vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'fat free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.laaloosh.com/2012/05/30/glazed-turnips-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Peel turnips, remove stem, and slice thickly Simmer them in salted water for about 10 minutes. They should be just tender when you take them out of the water.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'id': 11564, u'name': u'turnip'}]}, {u'equipment': [], u'step': u'Drain them very well.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat some butter in a skillet and brown the turnips in it.Season with salt, pepper, paprika and brown sugar, turning the turnips around to get colored.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'id': 11564, u'name': u'turnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add stock as needed to make a thin glaze. Taste to adjust seasonings.Chop parsley or celery leaves and sprinkle over turnips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'id': 11564, u'name': u'turnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 334, u'instructions': u'InstructionsPeel turnips, remove stem, and slice thickly Simmer them in salted water for about 10 minutes. They should be just tender when you take them out of the water.Drain them very well. Heat some butter in a skillet and brown the turnips in it.Season with salt, pepper, paprika and brown sugar, turning the turnips around to get colored. Add stock as needed to make a thin glaze. Taste to adjust seasonings.Chop parsley or celery leaves and sprinkle over turnips. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/glazed-turnips-2-points-548675', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}