{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/770913-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 280, u'id': 770913, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow-Cooker Green Bean Casserole', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 161.88, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 pound sliced cremini mushrooms (about 8 cups)', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 11266, u'unit': u'cups'}, {u'originalString': u'1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cups canned french-fried onions', u'aisle': u'Canned and Jarred', u'name': u'fried onions', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fried-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93709, u'unit': u'cups'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 pounds green beans, trimmed and cut into2-inch pieces (about 12 cups)', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'solid', u'id': 11052, u'unit': u'cups'}, {u'originalString': u'3 cups half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 large yellow onion, cut into 1/2-inch dice(about 2 cups)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'cut into 1/2-inch dice( 2 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 12.0, u'imageType': u'jpeg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/slow-cooker-green-bean-casserole.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Combine the green beans, mushrooms and 1 teaspoon salt in a 6-quart slow cooker.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt the butter over medium-high heat in a large skillet.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onions and a pinch of salt and cook, stirring occasionally, until the onions are tender and lightly browned, 6 to 8 minutes. Reduce the heat to medium, then add the garlic and cook, stirring constantly, until the garlic is just softened, about 2 minutes. Stir in the flour and stir constantly until it thickens into a paste, about 2 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the half-and-half and 1 teaspoon each salt and pepper and cook, whisking occasionally, until thickened, 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Remove from the heat and season to taste with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Pour the sauce into the slow cooker and stir to coat the vegetables. (The sauce will loosen as it cooks.)', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Cover the slow cooker and cook on low until the green beans are tender but not mushy, about 4 hours.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [], u'step': u'Remove the lid and stir. If the green beans look too soupy, cook for an additional 15 minutes uncovered. Season with additional salt and pepper to taste.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [], u'step': u'Transfer to a shallow serving dish and sprinkle with the fried onions.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fried-onions.jpg', u'id': 93709, u'name': u'fried onions'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 412, u'instructions': u'Combine the green beans, mushrooms and 1 teaspoon salt in a 6-quart slow cooker.                          Melt the butter over medium-high heat in a large skillet. Add the onions and a pinch of salt and cook, stirring occasionally, until the onions are tender and lightly browned, 6 to 8 minutes. Reduce the heat to medium, then add the garlic and cook, stirring constantly, until the garlic is just softened, about 2 minutes. Stir in the flour and stir constantly until it thickens into a paste, about 2 minutes. Add the half-and-half and 1 teaspoon each salt and pepper and cook, whisking occasionally, until thickened, 8 to 10 minutes. Remove from the heat and season to taste with salt and pepper. Pour the sauce into the slow cooker and stir to coat the vegetables. (The sauce will loosen as it cooks.)                          Cover the slow cooker and cook on low until the green beans are tender but not mushy, about 4 hours. Remove the lid and stir. If the green beans look too soupy, cook for an additional 15 minutes uncovered. Season with additional salt and pepper to taste. Transfer to a shallow serving dish and sprinkle with the fried onions. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-green-bean-casserole-770913', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'thanksgiving', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 290, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}