{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/493664-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 493664, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheddar Cheese Pizza Fondue', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 52.55, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 cans (10-3/4 ounces each) condensed cheddar cheese soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'cheddar cheese soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 6038, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'Italian bread, cubed and toasted', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'italian', u'cubed', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'servings'}, {u'originalString': u'1-1/2 cups (6 ounces) shredded pizza cheese blend', u'aisle': u'Cheese', u'name': u'pizza cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 93651, u'unit': u'ounces'}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped pepperoni', u'aisle': u'Meat', u'name': u'pepperoni', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 7057, u'unit': u'cup'}, {u'originalString': u'1 can (8 ounces) pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cheddar-cheese-pizza-fondue', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, combine the first six ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add cheese and pepperoni; cook and stir over medium heat until cheese is melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'id': 7057, u'name': u'pepperoni'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Transfer to a fondue pot and keep warm.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with bread cubes.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Di Majo Norante Sangiovese with a 4.1 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Vivid ruby red in color with a fresh bouquet of violets and woodland berries. Smooth and refreshing with loads of ripe fruit. An excellent accompaniment to antipasti, first courses and grilled white meats View More', u'title': u'Di Majo Norante Sangiovese', u'price': u'$8.99', u'id': 434381, u'link': u'https://www.wine.com/product/di-majo-norante-sangiovese-2000/38435', u'imageUrl': u'https://spoonacular.com/productImages/434381-312x231.jpg'}]}, u'aggregateLikes': 177, u'instructions': u'Directions                                                                                In a large saucepan, combine the first six ingredients. Add cheese and pepperoni; cook and stir over medium heat until cheese is melted.                                                                                            Transfer to a fondue pot and keep warm. Serve with bread cubes.                                    Yield: 4 cups.                                                                                                                         Originally published as Pizza Fondue in  Simple & DeliciousMarch/April 2008, p48                                                                                                                                                                                                        Nutritional Facts                                                                             1/4 cup (calculated without bread) equals 96 calories, 8 g fat (4 g saturated fat), 17 mg cholesterol, 523 mg sodium, 5 g carbohydrate, 1 g fiber, 5 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cheddar-cheese-pizza-fondue-493664', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}