{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600107-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 600107, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ted’s Strawberry Shortcake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 152.41, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'2 1/2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/4 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound strawberries, washed and sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'washed and sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'pound'}, {u'originalString': u'1 1/2 tablespoons sugar for strawberries', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'for strawberries'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.copykat.com/2011/06/05/teds-strawberry-shortcake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a container with a lid, place strawberries, and sprinkle sugar over the strawberries.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Let sugar marinate over the strawberries for a couple of hours before using.Preheat oven to 450 degrees. Sift together flour, salt, and baking powder. Stir heavy cream into sifted flour, and mix gently until the flour is just incorporated. Gently knead and shape into 4 equal sized biscuits. Make four biscuits with dough, and place on a greased cookie sheet. If you have some dusting sugar, sprinkle a little onto the biscuits.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for approximately 10 to 15 minutes, the biscuits will be golden brown when done.Shortcake Assembly1 biscuit1 scoop Hagan Daas Vanilla Ice Cream', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Strawberries', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Whipped cream', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Slice shortcake in half, lay bottom of shortcake in a plate, then add a scoop of ice cream, a spoonful of strawberries, top with biscuit and whipped cream.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Add additional strawberries to the plate around the biscuit.This is a great dessert to make ahead of time, and assemble the shortcakes right before dinner. I think if you added blackberries, or even blueberries to the mixture you would have a wonderful new creation.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 192, u'instructions': u'In a container with a lid, place strawberries, and sprinkle sugar over the strawberries. Let sugar marinate over the strawberries for a couple of hours before using.Preheat oven to 450 degrees. Sift together flour, salt, and baking powder. Stir heavy cream into sifted flour, and mix gently until the flour is just incorporated. Gently knead and shape into 4 equal sized biscuits. Make four biscuits with dough, and place on a greased cookie sheet. If you have some dusting sugar, sprinkle a little onto the biscuits. Bake for approximately 10 to 15 minutes, the biscuits will be golden brown when done.Shortcake Assembly1 biscuit1 scoop Hagan Daas Vanilla Ice CreamStrawberriesWhipped creamSlice shortcake in half, lay bottom of shortcake in a plate, then add a scoop of ice cream, a spoonful of strawberries, top with biscuit and whipped cream. Add additional strawberries to the plate around the biscuit.This is a great dessert to make ahead of time, and assemble the shortcakes right before dinner. I think if you added blackberries, or even blueberries to the mixture you would have a wonderful new creation.', u'spoonacularSourceUrl': u'https://spoonacular.com/teds-strawberry-shortcake-600107', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}