{u'recipes': [{u'sourceName': u'Blogging Over Thyme', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478952-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 478952, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vanilla Almond Steel-Cut Oatmeal', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 180.26, u'creditText': u'Blogging Over Thyme', u'extendedIngredients': [{u'originalString': u'raw sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 12061, u'unit': u'servings'}, {u'originalString': u'brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19334, u'unit': u'servings'}, {u'originalString': u'maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups unsweetened, original soy milk (I prefer Eden Organic original soy)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [u'unsweetened', u'organic', u'(I prefer Eden original soy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 16235, u'unit': u'cups'}, {u'originalString': u'1 cup steel-cut oats', u'aisle': u'Cereal', u'name': u'steel cut oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/steel-cut-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93695, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1 cup water (add an extra 1/2 cup if using rice cooker)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(add an extra 1/2 cup if using rice cooker)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 19.0, u'imageType': u'jpeg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.bloggingoverthyme.com/2011/10/26/vanilla-almond-steel-cut-oatmeal/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add oatmeal, soymilk, water, vanilla extract, and salt into medium saucepan.Bring to a boil, stirring occasionally. Reduce to medium-low heat, allowing oatmeal to simmer (with lid on) for 20-30 minutes (depending on desired consistency).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'id': 16235, u'name': u'soymilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rice-cooker.jpg', u'id': 404662, u'name': u'rice cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add oatmeal, soymilk, water, vanilla extract, and salt to rice cooker bowl. Set timer for following morning using porridge setting.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'id': 16235, u'name': u'soymilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Serve, add toppings, and enjoy. Refrigerate leftovers and reheat in microwave.', u'number': 2, u'ingredients': []}], u'name': u'Remove from heat and serve. Top with sliced raw almonds, sprinkle of brown sugar, and drizzle of maple syrup. If desired, add a splash of cold milk on top.Refrigerate leftovers and reheat in microwave.Night Before'}], u'winePairing': {}, u'aggregateLikes': 83, u'instructions': u'Add oatmeal, soymilk, water, vanilla extract, and salt into medium saucepan.Bring to a boil, stirring occasionally. Reduce to medium-low heat, allowing oatmeal to simmer (with lid on) for 20-30 minutes (depending on desired consistency).Remove from heat and serve. Top with sliced raw almonds, sprinkle of brown sugar, and drizzle of maple syrup. If desired, add a splash of cold milk on top.Refrigerate leftovers and reheat in microwave.Night Before: Add oatmeal, soymilk, water, vanilla extract, and salt to rice cooker bowl. Set timer for following morning using porridge setting.Serve, add toppings, and enjoy. Refrigerate leftovers and reheat in microwave.', u'spoonacularSourceUrl': u'https://spoonacular.com/vanilla-almond-steel-cut-oatmeal-478952', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}