{u'recipes': [{u'sourceName': u'Kawaling Pinoy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612867-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 612867, u'veryPopular': False, u'lowFodmap': False, u'title': u'Loslos', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 207.65, u'creditText': u'Kawaling Pinoy', u'extendedIngredients': [{u'originalString': u'3 pounds baby back ribs, cut into individual ribs', u'aisle': u'Meat', u'name': u'baby back ribs', u'metaInformation': [u'cut into individual ribs'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-back-ribs.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 10010204, u'unit': u'pounds'}, {u'originalString': u'2 bay leaves', u'aisle': u'Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 head garlic, peeled and minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'oil for deep-frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for deep-frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon pepper corns, cracked', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1 cup vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.kawalingpinoy.com/2014/09/loslos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a pot over medium heat, combine ribs, soy sauce, vinegar, water, garlic, bay leaves and pepper corns. Bring to a boil, uncovered and without stirring, for about 5 minutes. Lower heat, cover and continue to cook for about 40-50 minutes or until ribs are fork-tender.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain ribs, discarding liquid and aromatics. Allow to cool.In a shallow dish, combine flour, salt and pepper. In a bowl, beat eggs until foamy.Lightly dredge rib pieces in flour, dip in beaten eggs and then dredge again in flour to fully coat. In a pan over medium heat, heat about 2-inches deep oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add ribs in batches and deep-fry, turning on sides as needed, for about 4 to 5 minutes or until golden and crisp.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan and drain on paper towels.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 11, u'instructions': u'In a pot over medium heat, combine ribs, soy sauce, vinegar, water, garlic, bay leaves and pepper corns. Bring to a boil, uncovered and without stirring, for about 5 minutes. Lower heat, cover and continue to cook for about 40-50 minutes or until ribs are fork-tender. Drain ribs, discarding liquid and aromatics. Allow to cool.In a shallow dish, combine flour, salt and pepper. In a bowl, beat eggs until foamy.Lightly dredge rib pieces in flour, dip in beaten eggs and then dredge again in flour to fully coat. In a pan over medium heat, heat about 2-inches deep oil. Add ribs in batches and deep-fry, turning on sides as needed, for about 4 to 5 minutes or until golden and crisp. Remove from pan and drain on paper towels. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/loslos-612867', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}