{u'recipes': [{u'sourceName': u'Norecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/196071-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 196071, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tonjiru', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 336.77, u'creditText': u'Norecipes', u'extendedIngredients': [{u'originalString': u'1burdock root (about 160 grams)', u'aisle': u'Produce', u'name': u'burdock root', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 160.0, u'consistency': u'solid', u'id': 11104, u'unit': u'grams'}, {u'originalString': u'1poundpork belly cut into bite-size chunks', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'cut into bite-size chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10005, u'unit': u'pound'}, {u'originalString': u'2scallions white parts chopped, green parts thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'white', u'green', u'thinly sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'200gramsbaby taro peeled and cut in half', u'aisle': u'Produce', u'name': u'taro', u'metaInformation': [u'peeled', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taro-root.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11518, u'unit': u'grams'}, {u'originalString': u'6cupswater', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1/4cupyellow miso (to taste)', u'aisle': u'Ethnic Foods', u'name': u'yellow miso', u'metaInformation': [u'to taste', u'yellow', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10216112, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://norecipes.com/tonjiru-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Put the pork belly into a cold pan, and turn on the heat to medium. The pork should release some fat as the pan heats up so you shouldn't need to add any oil. Once some oil has rendered out, add the white parts of the scallions and ginger and fry until the surface of the pork is cooked and a brown crust has formed on the bottom of the pan. Turn up the heat to high and then add the sake. Use the liquid to scrape up the brown fond on the bottom of the pan, and boil until there's almost no liquid left.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'id': 10005, u'name': u'pork belly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the water and kombu, and then bring to a boil. Skim off any foam that accumulates at the surface until there's no more foam accumulating. Cover with a lid and turn down the heat to maintain a gentle simmer, and cook for about 40 minutes. Meanwhile, fill a bowl with cold water, then add a tablespoon of vinegar or lemon juice. Working quickly, peel the burdock, then use a sharp knife to whittle away chips of burdock as you rotate the root with your other hand.", u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove the kombu and ginger. Skim off as much excess fat as you can.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drain the burdock and add it to the tonjiru along with the carrots, konnyaku and taro. Simmer until the vegetables are tender. Turn down the heat to low, then add the miso. Because the salinity of miso varies by brand, taste the soup and add more miso if it needs more salt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taro-root.jpg', u'id': 11518, u'name': u'taro root'}]}, {u'equipment': [], u'step': u'Add the green parts of the scallions, and serve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u"Put the pork belly into a cold pan, and turn on the heat to medium. The pork should release some fat as the pan heats up so you shouldn't need to add any oil. Once some oil has rendered out, add the white parts of the scallions and ginger and fry until the surface of the pork is cooked and a brown crust has formed on the bottom of the pan. Turn up the heat to high and then add the sake. Use the liquid to scrape up the brown fond on the bottom of the pan, and boil until there's almost no liquid left.Add the water and kombu, and then bring to a boil. Skim off any foam that accumulates at the surface until there's no more foam accumulating. Cover with a lid and turn down the heat to maintain a gentle simmer, and cook for about 40 minutes. Meanwhile, fill a bowl with cold water, then add a tablespoon of vinegar or lemon juice. Working quickly, peel the burdock, then use a sharp knife to whittle away chips of burdock as you rotate the root with your other hand. Remove the kombu and ginger. Skim off as much excess fat as you can. Drain the burdock and add it to the tonjiru along with the carrots, konnyaku and taro. Simmer until the vegetables are tender. Turn down the heat to low, then add the miso. Because the salinity of miso varies by brand, taste the soup and add more miso if it needs more salt. Add the green parts of the scallions, and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/tonjiru-196071', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}