{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213495-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 213495, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sticky apple cups', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 120.31, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 medium Bramley apples, about 200g each', u'aisle': u'Produce', u'name': u'bramley apples', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/braeburn-apples.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1009003, u'unit': u''}, {u'originalString': u'85g dried dates, roughly chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'dried', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 9087, u'unit': u'g'}, {u'originalString': u'2 tbsp light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'tbsp'}, {u'originalString': u'1 tsp mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'mixed spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022035, u'unit': u'tsp'}, {u'originalString': u'1 small orange, zest and juice', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'85g ready-to-eat prunes, roughly chopped or raisins', u'aisle': u'Dried Fruits;Produce', u'name': u'prunes', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 9291, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1819/sticky-apple-cups', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Halve each apple through the circumference and dig out the core with a dessert spoon from both halves, leaving bowl-shaped hollows behind.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Mix together all the remaining ingredients except for the orange juice and fill the apples with the mixture. Fit them into a microwaveable dish and pour the orange juice on top. Cover and cook on Medium (500w) for 5-7 mins until soft. Cool for a few mins before serving with the yogurt or fromage frais.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 71, u'instructions': u'Halve each apple through the circumference and dig out the core with a dessert spoon from both halves, leaving bowl-shaped hollows behind.Mix together all the remaining ingredients except for the orange juice and fill the apples with the mixture. Fit them into a microwaveable dish and pour the orange juice on top. Cover and cook on Medium (500w) for 5-7 mins until soft. Cool for a few mins before serving with the yogurt or fromage frais.', u'spoonacularSourceUrl': u'https://spoonacular.com/sticky-apple-cups-213495', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}