{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/196532-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196532, u'veryPopular': False, u'lowFodmap': False, u'title': u'Animal-Style Grilled Cheese Bruschetta', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 130.3, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'12 slices American cheese', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slices'}, {u'originalString': u'12 slices baguette bread (each slice 1/2-inch thick)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'(each slice 1/)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'24 dill pickle chips', u'aisle': u'Canned and Jarred', u'name': u'dill pickle chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickle-slices.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 10211937, u'unit': u''}, {u'originalString': u'1 tablespoon ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons plus 2 teaspoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'1 small onion, cut into 1/4-inch thick slices with rings unseparated', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'with rings unseparated', u'small', u'cut into 1/ slices '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 large plum tomatoes, cut into 1/4-inch thick slices (12 slices total)', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'large', u'cut into 1/ slices (12 slices total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons sweet pickle relish', u'aisle': u'Condiments', u'name': u'sweet pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11945, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon distilled white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white distilled vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2053, u'unit': u'teaspoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/08/bar-bites-animal-style-grilled-cheese-bruschetta-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'For the', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread: combine mayonnaise, ketchup, relish, sugar, and vinegar in a bowl and stir until homogenous. Set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the sliced tomatoes and onions with the 2 tablespoons of olive oil, then lightly season with salt and freshly ground black pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'4', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Using a metal spatula, place the sliced tomatoes and onions on the hottest part of your grill, taking care to keep the onion rings together and not separated. Grill the tomatoes just until they are nicely charred with grill marks on both sides, 1 to 2 minutes per side. Grill onions until they soften and caramelize with grill marks on both sides, 2 to 3 minutes per side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u"Transfer grilled tomatoes and onions to a large platter and set aside. It's ok if the onions separate after grilling.", u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'5', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Brush one side of each baguette slice with the remaining 1 tablespoon of olive oil, then smear the other side of each baguette slice with the prepared spread.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Place the baguette slices, spread side-up, on a large platter.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'6', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Place two dill pickle chips on the spread-side of each baguette slice. Fold each slice of American cheese in half over itself, then place each cheese slice on top of the dill pickle chips on each of the baguette slices.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickle-slices.jpg', u'id': 10211937, u'name': u'dill pickle slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'id': 1253, u'name': u'american cheese'}]}, {u'equipment': [], u'step': u'Place a single tomato slice on each baguette slice, then evenly distribute the onions over each baguette slice.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'7', u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the topped baguette slices on the cooler side of the grill and cook until the bottom of the bread is toasted and the cheese is completely melted, 3 to 5 minutes. If some of the bruschetta are cooking faster than others, rearrange them on the grill as necessary.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 18, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove the bruschetta from the grill and serve immediately.', u'number': 19, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Korbel Organic Brut. It has 4.3 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'#73 Wine Spectator Top 100 of 2016Korbel Brut – Made with Organically Grown Grapes is created in the classic Korbel style, crisp, delicate and bright. We always strive to present the pure flavors of the grape in all of our champagnes. The organically grown grapes in this cuvee deliver well-integrated aromas and flavors of apple, pear and white peaches. The finish is medium dry, with a slight savory note at the end. View More', u'title': u'Korbel Organic Brut', u'price': u'$12.98', u'id': 443895, u'link': u'https://www.wine.com/product/korbel-organic-brut/105310', u'imageUrl': u'https://spoonacular.com/productImages/443895-312x231.jpg'}]}, u'aggregateLikes': 53, u'instructions': u"Procedures                                                                              1                                                                            For the Spread: combine mayonnaise, ketchup, relish, sugar, and vinegar in a bowl and stir until homogenous. Set aside.                                                                                                                            2                                                                            Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate.                                                                                                                            3                                                                            Drizzle the sliced tomatoes and onions with the 2 tablespoons of olive oil, then lightly season with salt and freshly ground black pepper.                                                                                                                            4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Using a metal spatula, place the sliced tomatoes and onions on the hottest part of your grill, taking care to keep the onion rings together and not separated. Grill the tomatoes just until they are nicely charred with grill marks on both sides, 1 to 2 minutes per side. Grill onions until they soften and caramelize with grill marks on both sides, 2 to 3 minutes per side. Transfer grilled tomatoes and onions to a large platter and set aside. It's ok if the onions separate after grilling.                                                                                                                            5                                                                            Brush one side of each baguette slice with the remaining 1 tablespoon of olive oil, then smear the other side of each baguette slice with the prepared spread. Place the baguette slices, spread side-up, on a large platter.                                                                                                                            6                                                                            Place two dill pickle chips on the spread-side of each baguette slice. Fold each slice of American cheese in half over itself, then place each cheese slice on top of the dill pickle chips on each of the baguette slices. Place a single tomato slice on each baguette slice, then evenly distribute the onions over each baguette slice.                                                                                                                            7                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Place the topped baguette slices on the cooler side of the grill and cook until the bottom of the bread is toasted and the cheese is completely melted, 3 to 5 minutes. If some of the bruschetta are cooking faster than others, rearrange them on the grill as necessary. Remove the bruschetta from the grill and serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/animal-style-grilled-cheese-bruschetta-196532', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}