{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507330-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 507330, u'veryPopular': True, u'lowFodmap': False, u'title': u'Herbed-Baked Eggs', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 102.56, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'6 extra-large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'extra-large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Toasted French bread or brioche, for serving', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french', u'toasted', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 18029, u'unit': u'servings'}, {u'originalString': u'1 tablespoon minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon minced fresh rosemary leaves', u'aisle': u'Produce', u'name': u'fresh rosemary leaves', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon minced fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon minced fresh garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon freshly grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.browneyedbaker.com/2008/05/29/barefoot-bloggers-herbed-baked-eggs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the broiler for 5 minutes and place the oven rack 6 inches below the heat.2.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Combine the garlic, thyme, rosemary, parsley, and Parmesan and set aside. Carefully crack 3 eggs into each of 2 small bowls or teacups (you won't be baking them in these) without breaking the yolks. (It's very important to have all the eggs ready to go before you start cooking.)3.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place 2 individual gratin dishes on a baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place 1 tablespoon of cream and 1/2 tablespoon of butter in each dish and place under the broiler for about 3 minutes, until hot and bubbly. Quickly, but carefully, pour 3 eggs into each gratin dish and sprinkle evenly with the herb mixture, then sprinkle liberally with salt and pepper.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place back under the broiler for 5 to 6 minutes, until the whites of the eggs are almost cooked. (Rotate the baking sheet once if they aren't cooking evenly.) The eggs will continue to cook after you take them out of the oven. Allow to set for 60 seconds and serve hot with toasted bread.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 959, u'instructions': u"1. Preheat the broiler for 5 minutes and place the oven rack 6 inches below the heat.2. Combine the garlic, thyme, rosemary, parsley, and Parmesan and set aside. Carefully crack 3 eggs into each of 2 small bowls or teacups (you won't be baking them in these) without breaking the yolks. (It's very important to have all the eggs ready to go before you start cooking.)3. Place 2 individual gratin dishes on a baking sheet. Place 1 tablespoon of cream and 1/2 tablespoon of butter in each dish and place under the broiler for about 3 minutes, until hot and bubbly. Quickly, but carefully, pour 3 eggs into each gratin dish and sprinkle evenly with the herb mixture, then sprinkle liberally with salt and pepper. Place back under the broiler for 5 to 6 minutes, until the whites of the eggs are almost cooked. (Rotate the baking sheet once if they aren't cooking evenly.) The eggs will continue to cook after you take them out of the oven. Allow to set for 60 seconds and serve hot with toasted bread.", u'spoonacularSourceUrl': u'https://spoonacular.com/herbed-baked-eggs-507330', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}