{u'recipes': [{u'sourceName': u'A Zesty Bite', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/699593-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 699593, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppermint Mousse Bites', u'diets': [], u'pricePerServing': 41.19, u'creditText': u'A Zesty Bite', u'extendedIngredients': [{u'originalString': u'30 (2 boxes) Athens Mini Fillo Shells', u'aisle': u'Refrigerated;Frozen', u'name': u'fillo shells', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'unitLong': u'', u'unitShort': u'', u'amount': 60.0, u'consistency': u'solid', u'id': 93817, u'unit': u''}, {u'originalString': u'1 3.56-ounce box of instant chocolate pudding', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.56, u'consistency': u'solid', u'id': 19184, u'unit': u'ounce'}, {u'originalString': u'1 cup 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbe cup light cool whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1200, u'unit': u'cup'}, {u'originalString': u'\xbc cup peppermint baking chips', u'aisle': u'Baking', u'name': u'peppermint baking chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 98858, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.azestybite.com/peppermint-mousse-bites/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put chocolate pudding mix, cool whip and milk into a bowl and then using a hand mixer beat for 3-4 minutes on high speed.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'id': 19184, u'name': u'instant chocolate pudding mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the bowl in the refrigerator for at least 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the mousse in a piping or Ziploc bag with a decorating tip. Pipe into the Mini Fillo shells and then top with peppermint baking chips.Store in refrigerator until ready to eat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 98858, u'name': u'peppermint crunch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'id': 93817, u'name': u'mini filo shells'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 36, u'instructions': u'Put chocolate pudding mix, cool whip and milk into a bowl and then using a hand mixer beat for 3-4 minutes on high speed. Place the bowl in the refrigerator for at least 45 minutes. Place the mousse in a piping or Ziploc bag with a decorating tip. Pipe into the Mini Fillo shells and then top with peppermint baking chips.Store in refrigerator until ready to eat.', u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-mousse-bites-699593', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}