{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/608757-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 608757, u'veryPopular': False, u'lowFodmap': False, u'title': u'Almond Poppy Seed French Toast', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 119.87, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'1/2 tsp almond extract (more to taste)', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [u'to taste', u'(more )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002050, u'unit': u'tsp'}, {u'originalString': u'sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 12061, u'unit': u'servings'}, {u'originalString': u'1 loaf day old bread (I used poppy seed brioche)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'(I used poppy seed brioche)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18064, u'unit': u'loaf'}, {u'originalString': u'butter for the griddle', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for the griddle'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 Tbsp poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'Tbsp'}, {u'originalString': u'powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1 Tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2014/08/almond-poppy-seed-french-toast.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Slice the bread in nice thick slices', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the eggs in a wide shallow dish, a pie plate works well.  Make sure to get the eggs completely beaten.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the buttermilk, sugar, poppy seeds, and extract and blend until the sugar is dissolved.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u"Heat a griddle and butter it well.Soak each piece of bread in the batter before placing it on the griddle.  It will only take a short soak on each side, you don't want it completely mushy inside.Cook the bread until it is golden on each side, and hot throughout.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Serve hot with butter, maple syrup, and some sliced almonds on top.  Dust with powdered sugar for a fancier presentation.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 99, u'instructions': u"Slice the bread in nice thick slicesWhisk the eggs in a wide shallow dish, a pie plate works well.  Make sure to get the eggs completely beaten.  Whisk in the buttermilk, sugar, poppy seeds, and extract and blend until the sugar is dissolved.Heat a griddle and butter it well.Soak each piece of bread in the batter before placing it on the griddle.  It will only take a short soak on each side, you don't want it completely mushy inside.Cook the bread until it is golden on each side, and hot throughout.  Serve hot with butter, maple syrup, and some sliced almonds on top.  Dust with powdered sugar for a fancier presentation.", u'spoonacularSourceUrl': u'https://spoonacular.com/almond-poppy-seed-french-toast-608757', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 7, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}