{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/578616-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 578616, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vegetable Enchilada', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 223.93, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 head cauliflower, cut into 1/2-inch chunks', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'cut into 1/2-inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'1 leaf chard, chopped', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11147, u'unit': u'leaf'}, {u'originalString': u'12 corn tortillas, halved', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons grapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'8 ounces monterey jack cheese, shredded', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'1 medium onion, halved and sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'halved', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1 pasilla pepper, sliced into strips', u'aisle': u'Produce', u'name': u'pasilla pepper', u'metaInformation': [u'sliced into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guajillo-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11982, u'unit': u''}, {u'originalString': u'1 red bell pepper, sliced into strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'sliced into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'3 cups salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'cups'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'8 ounces cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'1 small sweet potato, peeled and cut into 1/2-inch cubes', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'small', u'peeled', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 yellow bell pepper, sliced into strips', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'sliced into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.foodfanatic.com/recipes/vegetable-enchilada-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425\xb0F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add all chopped vegetables to a large mixing bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour the grapeseed oil, cumin, paprika, salt and pepper over them. Using your hands, mix the vegetables so that they are all coated.Line two baking sheets with parchment paper and spread out the vegetables.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4517, u'name': u'grape seed oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake them in the oven for 30 minutes or until they are tender and slightly browned. You can stir around the vegetables half-way through to ensure they roast evenly.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove vegetables from the oven and reduce the oven heat to 350 degrees F.Lightly coat a 8x8x2 or 9x9x2-inch square baking pan or casserole dish with olive oil (or cooking spray). In', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread 1/4 cup of salsa into the bottom of the baking pan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Add a layer of tortilla pieces, to completely cover the salsa. Top with 1/3 of the vegetables, a handful of chard (or spinach), 1/3 of the cheese and 1/3 of the salsa.Repeat this to make three layers. Your top layer will be roasted veggies with cheese on top.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Bake on the center rack for 25 to 30 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow dish to cool 10 minutes before cutting large portions.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with plain Greek yogurt (or sour cream), cilantro, green onion, and/or avocado.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Enchilada can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The SketchBook Pinot Noir Wine with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Sketchbook Pinot Noir is bright and juicy, with leather and earth on the nose and flavors of Bing cherry, crunchy red fruits, and a delicate, lingering finish.', u'title': u'SketchBook Pinot Noir Wine', u'price': u'$20.0', u'id': 428766, u'link': u'https://www.amazon.com/2014-SketchBook-Mendocino-County-Pinot/dp/B01FEFJBAU', u'imageUrl': u'https://spoonacular.com/productImages/428766-312x231.jpg'}]}, u'aggregateLikes': 1065, u'instructions': u'Preheat the oven to 425\xb0F.Add all chopped vegetables to a large mixing bowl. Pour the grapeseed oil, cumin, paprika, salt and pepper over them. Using your hands, mix the vegetables so that they are all coated.Line two baking sheets with parchment paper and spread out the vegetables. Bake them in the oven for 30 minutes or until they are tender and slightly browned. You can stir around the vegetables half-way through to ensure they roast evenly.Remove vegetables from the oven and reduce the oven heat to 350 degrees F.Lightly coat a 8x8x2 or 9x9x2-inch square baking pan or casserole dish with olive oil (or cooking spray). InSpread 1/4 cup of salsa into the bottom of the baking pan. Add a layer of tortilla pieces, to completely cover the salsa. Top with 1/3 of the vegetables, a handful of chard (or spinach), 1/3 of the cheese and 1/3 of the salsa.Repeat this to make three layers. Your top layer will be roasted veggies with cheese on top.Bake on the center rack for 25 to 30 minutes. Remove from the oven and allow dish to cool 10 minutes before cutting large portions.Serve with plain Greek yogurt (or sour cream), cilantro, green onion, and/or avocado.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetable-enchilada-578616', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}