{u'recipes': [{u'sourceName': u'Deliciously Organic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/550488-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 550488, u'veryPopular': False, u'lowFodmap': False, u'title': u'Finding Inspiration and a Gooey Butter Cake', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 47.89, u'creditText': u'Deliciously Organic', u'extendedIngredients': [{u'originalString': u'1 3/4 teaspoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.75, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 cups organic whole cane sugar or sucanat', u'aisle': u'Baking', u'name': u'cane sugar', u'metaInformation': [u'whole', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 teaspoon coarse sea salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'7 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'12 tablespoons unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 1/2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons whole milk, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'1 1/4 cups whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 10020080, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://deliciouslyorganic.net/finding-inspiration-and-a-gooey-butter-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Stir milk with 2 tablespoons warm water in a small bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add yeast and whisk gently until it dissolves. Set aside.  Using an electric mixer with paddle attachment, cream butter, whole cane sugar and salt for about 1 minute on medium speed.  Scrape down the sides of the bowl, turn mixer to low, and beat in the egg and vanilla.  With mixer on low, alternately add flour and milk mixture until just combined.  Turn speed up to medium and beat for 3-4 minutes until dough comes together and pulls from the side of the bowl.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour dough into a buttered 13x9 inch pan.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread dough (I used a greased off-set spatula) evenly along the bottom of the pan.  (it will seem like such a small amount of dough for such a large pan, but it will work!) Cover dish with a clean tea towel, put in a warm place, and allow to rise until doubled, 2 1/2 to 3 hours.Preheat the oven to 350 degrees and adjust rack to middle position.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour maple syrup in a small sauce pan and heat over medium heat until simmering.  Continue to simmer until it reaches 240 degrees.  Take off of heat and measure out 3 tablespoons of remaining syrup into a small bowl.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk in 2 tablespoon of warm water and the vanilla.  (if you wait to do this step, the maple syrup will harden.  If this happens you can melt it again over low heat on the stove.) Using an electric mixer with paddle attachment, cream butter, whole cane sugar and salt until light and fluffy, 5 to 7 minutes. Scrape down sides of bowl and beat in the egg. Alternately add flour and maple mixture, scraping down sides of bowl between each addition until throughly combined.Spoon topping in small dollops over risen cake and use an offset spatula to gently spread it in an even layer.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Bake for 30-35 minutes until cake is golden brown. Cool for 20 minutes before serving.*I have yet to figure out a way to make this with soaked grains.  When I do, I'll make sure and post it for those who prefer soaking.", u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Butter Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u"Stir milk with 2 tablespoons warm water in a small bowl. Add yeast and whisk gently until it dissolves. Set aside.  Using an electric mixer with paddle attachment, cream butter, whole cane sugar and salt for about 1 minute on medium speed.  Scrape down the sides of the bowl, turn mixer to low, and beat in the egg and vanilla.  With mixer on low, alternately add flour and milk mixture until just combined.  Turn speed up to medium and beat for 3-4 minutes until dough comes together and pulls from the side of the bowl.Pour dough into a buttered 13x9 inch pan.  Spread dough (I used a greased off-set spatula) evenly along the bottom of the pan.  (it will seem like such a small amount of dough for such a large pan, but it will work!) Cover dish with a clean tea towel, put in a warm place, and allow to rise until doubled, 2 1/2 to 3 hours.Preheat the oven to 350 degrees and adjust rack to middle position. Pour maple syrup in a small sauce pan and heat over medium heat until simmering.  Continue to simmer until it reaches 240 degrees.  Take off of heat and measure out 3 tablespoons of remaining syrup into a small bowl.  Whisk in 2 tablespoon of warm water and the vanilla.  (if you wait to do this step, the maple syrup will harden.  If this happens you can melt it again over low heat on the stove.) Using an electric mixer with paddle attachment, cream butter, whole cane sugar and salt until light and fluffy, 5 to 7 minutes. Scrape down sides of bowl and beat in the egg. Alternately add flour and maple mixture, scraping down sides of bowl between each addition until throughly combined.Spoon topping in small dollops over risen cake and use an offset spatula to gently spread it in an even layer. Bake for 30-35 minutes until cake is golden brown. Cool for 20 minutes before serving.*I have yet to figure out a way to make this with soaked grains.  When I do, I'll make sure and post it for those who prefer soaking.", u'spoonacularSourceUrl': u'https://spoonacular.com/finding-inspiration-and-a-gooey-butter-cake-550488', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}