{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479171-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479171, u'veryPopular': False, u'lowFodmap': False, u'title': u'Feeding Friends: White Wine Braised Artichokes with Thyme', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'pricePerServing': 284.66, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'2 large artichokes', u'aisle': u'Produce', u'name': u'artichokes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11007, u'unit': u''}, {u'originalString': u'1/4 dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u''}, {u'originalString': u'4 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'6 sprigs thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 6.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://feedmephoebe.com/2013/04/feeding-friends-white-wine-braised-artichokes-with-thyme/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Pour the wine, lemon juice, garlic cloves, and thyme into a shallow casserole dish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Place the artichokes on a work surface.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/peeler.png', u'id': 404693, u'name': u'peeler'}], u'step': u'Cut off the top 1/3. Pluck the outer leaves off until they start turning a greenish-yellow. At this point, you should have eliminated most of the leaves that still have their spiky tips. If not, trim the tops off the remaining spiky leaves with scissors.Using a peeler, remove the outer layer of the stalks of the artichoke.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}]}, {u'equipment': [], u'step': u'Cut the artichokes in half lengthwise. Working quickly, remove the choke: pull out the very small purplish leaves at the very center – this will make it easier to spoon out the choke (the fur at the center of the artichokes). Using a grapefruit spoon, if possible, scrape out the fur. When clean, flip around in the braising liquid to cover and arrange cut-side down to prevent the centers from browning. Repeat with remaining artichokes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle the chokes with olive oil and season with the salt. Cover with foil and roast in the oven until tender when pieced with a fork, about 30 to 40 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil and allow to cool slightly.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with the braising liquid, and lemon wedges and parsley for garnish.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 82, u'instructions': u'Preheat the oven to 400 degrees F.Pour the wine, lemon juice, garlic cloves, and thyme into a shallow casserole dish.Place the artichokes on a work surface. Cut off the top 1/3. Pluck the outer leaves off until they start turning a greenish-yellow. At this point, you should have eliminated most of the leaves that still have their spiky tips. If not, trim the tops off the remaining spiky leaves with scissors.Using a peeler, remove the outer layer of the stalks of the artichoke. Cut the artichokes in half lengthwise. Working quickly, remove the choke: pull out the very small purplish leaves at the very center – this will make it easier to spoon out the choke (the fur at the center of the artichokes). Using a grapefruit spoon, if possible, scrape out the fur. When clean, flip around in the braising liquid to cover and arrange cut-side down to prevent the centers from browning. Repeat with remaining artichokes.Drizzle the chokes with olive oil and season with the salt. Cover with foil and roast in the oven until tender when pieced with a fork, about 30 to 40 minutes. Remove foil and allow to cool slightly. Serve with the braising liquid, and lemon wedges and parsley for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/feeding-friends-white-wine-braised-artichokes-with-thyme-479171', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"valentine's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}