{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/837678-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 837678, u'veryPopular': True, u'lowFodmap': False, u'title': u'Garlic & Herb Encrusted Pork Roast with Pre-gravied Potatoes', u'diets': [u'gluten free'], u'pricePerServing': 330.97, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 1/4 cups chicken stock (or water and chicken bouillon cubes)', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'(or water and chicken bouillon cubes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 tablespoon dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'tablespoon'}, {u'originalString': u'1 glove garlic, thinly julienned', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground thyme', u'aisle': u'Spices and Seasonings', u'name': u'ground thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tablespoon'}, {u'originalString': u'1/2 tablespoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoon'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 3-lb. pork roast (see guidelines above)', u'aisle': u'Meat', u'name': u'pork roast', u'metaInformation': [u'(see guidelines above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 10010225, u'unit': u'lb'}, {u'originalString': u'1/4 teaspoon rosemary (optional)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'6 large starchy potatoes, peeled and sliced into 1/4 inch rounds', u'aisle': u'Produce', u'name': u'starchy potatoes', u'metaInformation': [u'large', u'peeled', u'sliced into 1/4 inch rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1/2 yellow onion, diced small', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.laurenslatest.com/garlic-and-herb-encrusted-pork-roast-with-pregravied-potatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Prepare roast by cutting small 1 inch deep slits into meat. Fill slits with julienned garlic pieces. Rub entire roast with olive oil, salt, pepper, thyme and rosemary (if applicable).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place into roasting pan (or large baking dish) and bake 1 hour.While roast is baking, melt butter and chicken stock together and finish preparing potatoes if you have not yet done so. After an hour of baking, remove roast.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour about 1/4 cup of warm butter liquid onto roast and around the pan. Shingle potatoes around roast to create two layers of potatoes. Sprinkle on a few diced onions and pour on more butter liquid. Repeat this process until all ingredients are layered around pork roast. Sprinkle paprika and parsley over the whole thing. Return to oven and bake 45 minutes to an hour more. The dish is done once the potatoes are soft and the roast is cooked.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'id': 10010225, u'name': u'pork roast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and place roast onto a separate place to rest. Cover with foil and set aside. Keeping the potatoes in the roasting pan, stir to coat potatoes in the gravy. If it seems too runny, keep stirring. The starch from the potatoes will thicken the sauce. Taste potatoes and adjust seasonings accordingly. After 10 minutes, slice the pork roast thinly and serve with potatoes.Recipe TIPS:- The longer the potatoes cook, the better they become! Also, using a good quality chicken stock will make a HUGE difference in the taste.-If your gravy for your potatoes is still too runny for your liking, mash a few pieces of the potatoes and stir. That should help thicken it up.-Applesauce is good with pork, so give that a whirl.-Use a meat thermometer for best results! You can always remove the meat if its cooked and keep the potatoes cooking! Dry meat is not bueno.-If you are using a loin top roast with the string around it, DO NOT remove the string until after the meat has finished cooking!', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'id': 10010225, u'name': u'pork roast'}]}], u'name': u''}], u'aggregateLikes': 907, u'instructions': u'Preheat oven to 350 degrees. Prepare roast by cutting small 1 inch deep slits into meat. Fill slits with julienned garlic pieces. Rub entire roast with olive oil, salt, pepper, thyme and rosemary (if applicable). Place into roasting pan (or large baking dish) and bake 1 hour.While roast is baking, melt butter and chicken stock together and finish preparing potatoes if you have not yet done so. After an hour of baking, remove roast. Pour about 1/4 cup of warm butter liquid onto roast and around the pan. Shingle potatoes around roast to create two layers of potatoes. Sprinkle on a few diced onions and pour on more butter liquid. Repeat this process until all ingredients are layered around pork roast. Sprinkle paprika and parsley over the whole thing. Return to oven and bake 45 minutes to an hour more. The dish is done once the potatoes are soft and the roast is cooked. Remove from oven and place roast onto a separate place to rest. Cover with foil and set aside. Keeping the potatoes in the roasting pan, stir to coat potatoes in the gravy. If it seems too runny, keep stirring. The starch from the potatoes will thicken the sauce. Taste potatoes and adjust seasonings accordingly. After 10 minutes, slice the pork roast thinly and serve with potatoes.Recipe TIPS:- The longer the potatoes cook, the better they become! Also, using a good quality chicken stock will make a HUGE difference in the taste.-If your gravy for your potatoes is still too runny for your liking, mash a few pieces of the potatoes and stir. That should help thicken it up.-Applesauce is good with pork, so give that a whirl.-Use a meat thermometer for best results! You can always remove the meat if its cooked and keep the potatoes cooking! Dry meat is not bueno.-If you are using a loin top roast with the string around it, DO NOT remove the string until after the meat has finished cooking!', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-herb-encrusted-pork-roast-with-pre-gravied-potatoes-837678', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}