{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522957-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 522957, u'veryPopular': False, u'lowFodmap': False, u'title': u'Green Chile Macaroni and Cheese', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 83.77, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'1 Tbsp corn oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'corn oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 42289, u'unit': u'Tbsp'}, {u'originalString': u'1/2 cup fresh or frozen (thawed) corn kernels', u'aisle': u'Produce', u'name': u'fresh corn kernels', u'metaInformation': [u'fresh', u'thawed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011167, u'unit': u'cup'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 cups freshly cooked macaroni', u'aisle': u'Pasta and Rice', u'name': u'macaroni', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20499, u'unit': u'cups'}, {u'originalString': u'1 whole fresh poblano chile for roasting, plus 1/4 cup chopped fresh poblano chile', u'aisle': u'Produce', u'name': u'poblano chile', u'metaInformation': [u'fresh', u'whole', u'chopped', u'for roasting, plus 1/4 cup   poblano chile'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'1/4 cup chopped red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'3/4 cup whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.creative-culinary.com/green-chile-macaroni-corn-and-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Char whole chile directly over gas flame or in broiler until blackened on all sides.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to brown paper bag and seal.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 15 minutes.Peel, seed and coarsely chop chile and put in processor.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add whipping cream and process until smooth.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in large, heavy saucepan over medium high heat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1/4 cup chopped raw chile, red bell pepper, onion and garlic.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute until soft about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add corn, stir for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cream and chile puree and bring to a boil.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add macaroni and cheese and stir til cheese is melted and mixture is heated through.Season with salt and pepper and serve.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese works really well with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.  View More', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Char whole chile directly over gas flame or in broiler until blackened on all sides. Transfer to brown paper bag and seal. Let stand 15 minutes.Peel, seed and coarsely chop chile and put in processor. Add whipping cream and process until smooth.Heat oil in large, heavy saucepan over medium high heat.Add 1/4 cup chopped raw chile, red bell pepper, onion and garlic. Saute until soft about 4 minutes.Add corn, stir for 1 minute.Add the cream and chile puree and bring to a boil.Add macaroni and cheese and stir til cheese is melted and mixture is heated through.Season with salt and pepper and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/green-chile-macaroni-and-cheese-522957', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}