{u'recipes': [{u'sourceName': u'I Wash You Dry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/718107-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 718107, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Chicken Potato Casserole', u'diets': [u'gluten free'], u'pricePerServing': 137.97, u'creditText': u'I Wash You Dry', u'extendedIngredients': [{u'originalString': u'1 tbsp butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 (10 3/4 oz) can condensed cream of chicken soup with herbs', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of chicken soup', u'metaInformation': [u'with herbs', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6016, u'unit': u'oz'}, {u'originalString': u'1 cup crushed croutons', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'croutons', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18242, u'unit': u'cup'}, {u'originalString': u'1 (28 oz) package frozen diced hash brown potatoes with onions and peppers, thawed', u'aisle': u'Frozen', u'name': u'hash brown potatoes', u'metaInformation': [u'diced', u'frozen', u'with onions and peppers, thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 11390, u'unit': u'oz'}, {u'originalString': u'2 cups shredded rotisserie chicken', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cups'}, {u'originalString': u'1 (8 oz) container of sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'oz'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.iwashyoudry.com/2016/02/26/cheesy-chicken-potato-casserole/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Lightly grease a 3 quart casserole dish with non-stick spray and set aside.In a large bowl combine the condensed soup and sour cream, whisk until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [], u'step': u'Add in the cheese, hash brown potatoes and chicken. Stir until combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'id': 11390, u'name': u'hash browns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Pour the mixture into the prepared casserole dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the crushed croutons with the melted butter and sprinkle over the top of the casserole.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18242, u'name': u'croutons'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake, uncovered, for 40 to 50 minutes or until heated through and center is bubbly.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with fresh thyme. Enjoy!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'pineapple , guava , apricot', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 205, u'instructions': u'Preheat oven to 350 degrees F. Lightly grease a 3 quart casserole dish with non-stick spray and set aside.In a large bowl combine the condensed soup and sour cream, whisk until smooth. Add in the cheese, hash brown potatoes and chicken. Stir until combine. Pour the mixture into the prepared casserole dish.Combine the crushed croutons with the melted butter and sprinkle over the top of the casserole. Bake, uncovered, for 40 to 50 minutes or until heated through and center is bubbly. Garnish with fresh thyme. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-chicken-potato-casserole-718107', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}