{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/567577-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 567577, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramelized French Onion Dip Burger', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 320.51, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'4 slices bacon. diced into 1 inch pieces', u'aisle': u'Meat', u'name': u'bacon pieces', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10862, u'unit': u'slices'}, {u'originalString': u'1 cup Caramelized French Onion Dip', u'aisle': u'Produce', u'name': u'caramelized onion', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10211282, u'unit': u'cup'}, {u'originalString': u'4 hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'3 cups sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'4 slices provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'4 (1/3 pound) burger patties', u'aisle': u'Frozen;Meat', u'name': u'turkey burger patties', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 99026, u'unit': u'pound'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.lifesambrosia.com/2013/06/caramelized-french-onion-dip-burger-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Prepare french onion dip according to recipe instructions at least 30 minutes before preparing the burgers. Preheat grill. While grill is preheating, place bacon in a skillet, cook over medium heat for 2 - 3 minutes.', u'length': {u'number': 33, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in mushrooms. Cook until mushrooms are softened and bacon is cooked through. About 3 more minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from heat and stir in parsley. Cook the burgers on preheated grill 2 - 3 minutes per side or until cooked through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place provolone cheese on top and close the lid of the grill. Cook just until melted 30 seconds - 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush hamburger buns with oil. Toast on grill for 1 - 2 minutes or until golden brown. To assemble the burger, place the burger on the bottom bun, spoon some of the bacon and mushroom mixture over the top. Generously spread caramelized french onion dip on the top bun and place on top of burger.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'id': 18350, u'name': u'hamburger bun'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Belasco de Baquedano Llama Malbec with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'As its namesake, this wine embodies the distinctive spirit of our vineyards, spanning the foothills of the Andes. Llama is a rich ruby-purple color, and boasts elegant flavors of black berries, ripe plum and robust spices with good balance and structure. View More', u'title': u'Belasco de Baquedano Llama Malbec', u'price': u'$16.99', u'id': 449922, u'link': u'https://www.wine.com/product/belasco-de-baquedano-llama-malbec-2013/132727', u'imageUrl': u'https://spoonacular.com/productImages/449922-312x231.jpg'}]}, u'aggregateLikes': 44, u'instructions': u'Prepare french onion dip according to recipe instructions at least 30 minutes before preparing the burgers. Preheat grill. While grill is preheating, place bacon in a skillet, cook over medium heat for 2 - 3 minutes. Add in mushrooms. Cook until mushrooms are softened and bacon is cooked through. About 3 more minutes. Remove from heat and stir in parsley. Cook the burgers on preheated grill 2 - 3 minutes per side or until cooked through. Place provolone cheese on top and close the lid of the grill. Cook just until melted 30 seconds - 1 minute. Brush hamburger buns with oil. Toast on grill for 1 - 2 minutes or until golden brown. To assemble the burger, place the burger on the bottom bun, spoon some of the bacon and mushroom mixture over the top. Generously spread caramelized french onion dip on the top bun and place on top of burger. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramelized-french-onion-dip-burger-567577', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}