{u'recipes': [{u'sourceName': u'Your Homebased Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485854-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 485854, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cafe Rio Black Beans', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 31.45, u'creditText': u'Your Homebased Mom', u'extendedIngredients': [{u'originalString': u'2-15 oz cans black beans, (drained)', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained', u'canned', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'1/4 cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons cumin or cumin seed', u'aisle': u'Spices and Seasonings', u'name': u'cumin seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'salt ( kosher or sea salt) and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste', u'( kosher or sea salt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 C tomato juice', u'aisle': u'Beverages', u'name': u'tomato juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 11886, u'unit': u'C'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.yourhomebasedmom.com/cafe-rio-black-beans/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a pan,saute garlic, cumin and olive oil over medium heat until you can smell it!  Only about a minute. Be careful not to burn garlic as it will turn bitter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add beans, tomato juice and seasoning.  Simmer until some of the liquid is absorbed and evaporated. Stir in chopped cilantro when ready to serve', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'id': 11886, u'name': u'tomato juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 940, u'instructions': u'In a pan,saute garlic, cumin and olive oil over medium heat until you can smell it!  Only about a minute. Be careful not to burn garlic as it will turn bitter.Add beans, tomato juice and seasoning.  Simmer until some of the liquid is absorbed and evaporated. Stir in chopped cilantro when ready to serve', u'spoonacularSourceUrl': u'https://spoonacular.com/cafe-rio-black-beans-485854', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}