{u'recipes': [{u'sourceName': u'Rants from my Crazy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512843-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 210, u'id': 512843, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prime Rib Soup', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 77.27, u'creditText': u'Rants from my Crazy Kitchen', u'extendedIngredients': [{u'originalString': u'4 large carrots, peeled and cut into large pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'peeled', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 large stalks celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'4 whole cremini mushrooms', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11266, u'unit': u''}, {u'originalString': u'3 cloves garlic, unpeeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'unpeeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'dash onion powder or garlic powder (optional, taste soup before adding)', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [u'(optional, taste soup before adding)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'dash'}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'3 small/medium potatoes, peeled and chopped', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'prime rib meat, pulled from bones and chopped fine', u'aisle': u'Meat', u'name': u'prime rib', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'liquid', u'id': 13833, u'unit': u'rib'}, {u'originalString': u'meaty bones (ribs) from a fully cooked prime rib (I had 3 ribs)', u'aisle': u'Meat', u'name': u'prime rib', u'metaInformation': [u'fully cooked', u'(ribs)', u'(I had 3 ribs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'liquid', u'id': 13833, u'unit': u'rib'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 medium yellow onion, quartered', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://rantsfrommycrazykitchen.com/2014/01/07/prime-rib-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'For the stock:Put all stock ingredients in a large pot and cover with water, plus a few inches. Bring to a boil, reduce heat and cover. Simmer, covered for two hours, stirring occasionally. After two hours remove the lid and continue to simmer for one more hour.Strain the stock through a fine mesh colander into another large pot. Reserve meaty bones, discard vegetables.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the stock into small containers and refrigerate at least two hours, uncovered, or overnight, covered.Meanwhile, once the bones are cool enough to handle remove the meat and chop it fine.Skim the fat from the tops of the stock using a spoon. The stock can be frozen in freezer safe containers at this point.For the soup:Bring 8-10 cups of the stock to a boil in a large pot, add all of the vegetables except the peas, reduce the heat and simmer until the vegetables are tender. Taste the soup and adjust seasonings.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Add the peas and chopped prime rib meat and cook for a few minutes more, or until peas are tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'id': 13833, u'name': u'prime rib'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Cabernet Sauvignon, and Merlot are my top picks for Prime Rib. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. The Mark West Black Label Monterey County Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'pinot noir', u'cabernet sauvignon', u'merlot'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches. View More", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u'For the stock:Put all stock ingredients in a large pot and cover with water, plus a few inches. Bring to a boil, reduce heat and cover. Simmer, covered for two hours, stirring occasionally. After two hours remove the lid and continue to simmer for one more hour.Strain the stock through a fine mesh colander into another large pot. Reserve meaty bones, discard vegetables. Pour the stock into small containers and refrigerate at least two hours, uncovered, or overnight, covered.Meanwhile, once the bones are cool enough to handle remove the meat and chop it fine.Skim the fat from the tops of the stock using a spoon. The stock can be frozen in freezer safe containers at this point.For the soup:Bring 8-10 cups of the stock to a boil in a large pot, add all of the vegetables except the peas, reduce the heat and simmer until the vegetables are tender. Taste the soup and adjust seasonings. Add the peas and chopped prime rib meat and cook for a few minutes more, or until peas are tender. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/prime-rib-soup-512843', u'dishTypes': [u'soup'], u'occasions': [u"valentine's day", u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}