{u'recipes': [{u'sourceName': u'Farm Girl Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556646-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 556646, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beetroot Gratin with Fontina & Walnuts', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 125.55, u'creditText': u'Farm Girl Gourmet', u'extendedIngredients': [{u'originalString': u'6 medium beets, peeled and thinly sliced with a mandoline or sharp knife', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'with a mandoline or sharp knife', u'medium', u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'Butter for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'6 ounces fontina cheese, shredded', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1020, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons minced fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'2-3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'fine sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons coarsely chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12155, u'unit': u'tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.farmgirlgourmet.com/2011/10/beetroot-gratin-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F.  Butter an 8-inch baking dish.In a large bowl, combine the beets and olive oil and toss gently to coat.  In a small bowl, stir together the cheese and thyme.  Arrange about one-fourth of the beets in the bottom of the prepared dish, overlapping them very slightly.  Sprinkle about one-fourth of the cheese and thyme mixture over the beets and season lightly with salt and pepper.  Repeat to make 3 more layers, sprinkling the last layer of the herbed cheese with a little more salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Drizzle the cream over the surface and sprinkle with walnuts on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Bake until the beets are tender and the walnuts are nicely browned, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the gratin from the oven and let rest for 5 minutes before serving.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 6, u'instructions': u'Preheat the oven to 375 degrees F.  Butter an 8-inch baking dish.In a large bowl, combine the beets and olive oil and toss gently to coat.  In a small bowl, stir together the cheese and thyme.  Arrange about one-fourth of the beets in the bottom of the prepared dish, overlapping them very slightly.  Sprinkle about one-fourth of the cheese and thyme mixture over the beets and season lightly with salt and pepper.  Repeat to make 3 more layers, sprinkling the last layer of the herbed cheese with a little more salt and pepper.  Drizzle the cream over the surface and sprinkle with walnuts on top. Bake until the beets are tender and the walnuts are nicely browned, about 45 minutes.  Remove the gratin from the oven and let rest for 5 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/beetroot-gratin-with-fontina-walnuts-556646', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}