{u'recipes': [{u'sourceName': u'Oh So Delicioso', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/617454-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 617454, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crockpot Mexican Pineapple Chicken // Freezer Meal', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 285.7, u'creditText': u'Oh So Delicioso', u'extendedIngredients': [{u'originalString': u'Avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'1 Can Black Beans, rinsed and drained', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'rinsed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'solid', u'id': 16015, u'unit': u'Can'}, {u'originalString': u'3 Boneless Skin-less Chicken Breasts', u'aisle': u'Meat', u'name': u'bone in skin on chicken breasts', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1005057, u'unit': u''}, {u'originalString': u'Cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'servings'}, {u'originalString': u'1 tsp Chili Powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'Cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1 Can Corn, drained', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'solid', u'id': 11168, u'unit': u'Can'}, {u'originalString': u'2 tsp Cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tsp Garlic Salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'tsp'}, {u'originalString': u'Lime Juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'servings'}, {u'originalString': u'1 Can Pineapple Tid-bits, undrained', u'aisle': u'Canned and Jarred', u'name': u'pineapple tid-bits', u'metaInformation': [u'undrained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'liquid', u'id': 1039354, u'unit': u'Can'}, {u'originalString': u'Salt and Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 Can Rotel Tomatoes, undrained', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'undrained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'Can'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://ohsodelicioso.com/crockpot-mexican-pineapple-chicken-freezer-meal/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Combine all ingredients in a crockpot and stir. Cook on low for 6 hours.When meat is tender, shred and season with salt and pepper as desired.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve over rice, quinoa, in burritos, quesadillas, or over nachos.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish as desired but avocado, cilantro and lime are my favorites!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Remove as much air as possible and seal. Label and freeze for up to 3 months.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is CalNaturale Chardonnay Lodi. It has 4.1 out of 5 stars and a bottle costs about 11 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Combine all ingredients in a crockpot and stir. Cook on low for 6 hours.When meat is tender, shred and season with salt and pepper as desired. Serve over rice, quinoa, in burritos, quesadillas, or over nachos.Garnish as desired but avocado, cilantro and lime are my favorites! Remove as much air as possible and seal. Label and freeze for up to 3 months.', u'spoonacularSourceUrl': u'https://spoonacular.com/crockpot-mexican-pineapple-chicken-freezer-meal-617454', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}