{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537134-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 537134, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppers with Stuff(ing)', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 233.86, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'2 apples', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 cup grated cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups cooked rice', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'1 pound Italian sausage', u'aisle': u'Meat', u'name': u'italian sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7036, u'unit': u'pound'}, {u'originalString': u'4 large red peppers', u'aisle': u'Produce', u'name': u'red peppers', u'metaInformation': [u'red', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 white onion, chopped', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.macheesmo.com/2008/10/peppers-with-stuffing/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add rice to the skillet and season wiht salt and pepper.4)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Cut the tops off of the peppers and stuff them full of the rice mixture.5)', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place peppers in a baking dish and bake for 35 minutes at 350 degrees F.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add grated cheese to peppers and return to oven for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Let peppers cool for a bit before serving.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u"Directions1) Cook sausage in a large skillet without casing over medium-high heat. Crumble sausage as it cooks and cook until it's browned, 8-10 minutes. Then add chopped onions and cook until they are soft, 4-5 minutes.2) Peel and dice apples and then add to sausage. Cook for a minute or two.3) Add rice to the skillet and season wiht salt and pepper.4) Cut the tops off of the peppers and stuff them full of the rice mixture.5) Place peppers in a baking dish and bake for 35 minutes at 350 degrees F. Add grated cheese to peppers and return to oven for 15 minutes.Let peppers cool for a bit before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/peppers-with-stuffing-537134', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}