{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/283810-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 283810, u'veryPopular': False, u'lowFodmap': True, u'title': u'PB & J Frozen Banana Treats', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 25.86, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'3 medium bananas', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1/4 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1 Tbsp. seedless raspberry jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'raspberry jam', u'metaInformation': [u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10719297, u'unit': u'Tbsp'}, {u'originalString': u'1-1/2 cups letter-shaped whole grain oat with corn and wheat cereal', u'aisle': u'Gluten Free;Health Foods', u'name': u'whole grain oat flour', u'metaInformation': [u'whole', u'with corn and wheat cereal', u'letter-shaped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20132, u'unit': u'cups'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/pb-j-frozen-banana-treats-75483.aspx', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Peel bananas, then cut crosswise in half.  Insert 1 wooden pop stick into cut end of each banana.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Place cereal in shallow dish or pie plate.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine peanut butter and jam; spread evenly onto bananas.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [], u'step': u'Roll in cereal, evenly coating all sides.  Press cereal into peanut butter mixture to secure.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place in single layer on wax paper-covered baking sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Freeze 4 hours or until frozen.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from freezer about 15 min. before serving.  Store leftover banana pops in freezer.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Treat. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Peel bananas, then cut crosswise in half.  Insert 1 wooden pop stick into cut end of each banana. Place cereal in shallow dish or pie plate.                                            Combine peanut butter and jam; spread evenly onto bananas.  Roll in cereal, evenly coating all sides.  Press cereal into peanut butter mixture to secure.  Place in single layer on wax paper-covered baking sheet.                                            Freeze 4 hours or until frozen.  Remove from freezer about 15 min. before serving.  Store leftover banana pops in freezer.', u'spoonacularSourceUrl': u'https://spoonacular.com/pb-j-frozen-banana-treats-283810', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}