{u'recipes': [{u'sourceName': u'Iowa Girl Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/631081-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631081, u'veryPopular': True, u'lowFodmap': False, u'title': u'BBQ Chicken, Apple, Bacon, Cheddar Quesadillas - Iowa Girl Eats', u'diets': [], u'pricePerServing': 164.76, u'creditText': u'Iowa Girl Eats', u'extendedIngredients': [{u'originalString': u'1 apple, chopped', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'6 slices bacon, cooked and crumbled', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1/2 cup BBQ sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'2 small chicken breasts, cooked & shredded', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'shredded', u'small', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'4 burrito-sized flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'1-1/3 cup shredded cheddar cheese, divided', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://iowagirleats.com/2013/02/11/bbq-chicken-apple-bacon-cheddar-quesadillas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix shredded chicken with BBQ sauce (may not use all sauce.) Spray a large skillet with non-stick spray then add two tortillas, propped against each other in the center so only half of each tortilla is laying on the bottom of the skillet. Sprinkle 2-1/2 Tablespoons cheese on the bottom of each tortilla followed by 1/4 of the chicken, 1/4 of the chopped apple, and 1/4 of the crumbled bacon. Top with 2-1/2 more Tablespoons cheese then fold tortillas over.Turn heat to medium then cook until bottom side is golden brown. Flip then cook until second side is golden brown.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}], u'step': u'Remove to a cutting board then let rest for 5 minutes before cutting into wedges with a pizza cutter. Repeat with remaining ingredients then serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Quesadilla can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Siduri Sta. Rita Hills Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 33 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The 2014 Sta. Rita Hills Pinot Noir is a blend of fruit from the John Sebastiano, Clos Pepe, Cargasacchi, and Lindley Vineyards. The actual blend is 64% John Sebastiano Vineyard Pinot Noir, 22% Clos Pepe, 9% Lindley, and 6% Cargasacchi. Clonally, this wine is a blend of 8 different clones which also provides for a wide range of flavors within one wine. The 2014 Pinot Noir Sta. Rita Hills should be a classic expression of the region, showing lots of spice, red fruit and dried soils aromas and flavors. Balanced, polished and elegant with plenty of fruit, it should certainly be an outstanding wine, and at the price, is an excellent value in Pinot Noir.', u'title': u'Siduri Sta. Rita Hills Pinot Noir', u'price': u'$32.99', u'id': 454206, u'link': u'https://www.wine.com/product/siduri-sta-rita-hills-pinot-noir-2014/168102', u'imageUrl': u'https://spoonacular.com/productImages/454206-312x231.jpg'}]}, u'aggregateLikes': 545, u'instructions': u'Mix shredded chicken with BBQ sauce (may not use all sauce.) Spray a large skillet with non-stick spray then add two tortillas, propped against each other in the center so only half of each tortilla is laying on the bottom of the skillet. Sprinkle 2-1/2 Tablespoons cheese on the bottom of each tortilla followed by 1/4 of the chicken, 1/4 of the chopped apple, and 1/4 of the crumbled bacon. Top with 2-1/2 more Tablespoons cheese then fold tortillas over.Turn heat to medium then cook until bottom side is golden brown. Flip then cook until second side is golden brown. Remove to a cutting board then let rest for 5 minutes before cutting into wedges with a pizza cutter. Repeat with remaining ingredients then serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-chicken-apple-bacon-cheddar-quesadillas-iowa-girl-eats-631081', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}