{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520066-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 520066, u'veryPopular': True, u'lowFodmap': False, u'title': u'Softbatch Cookie Butter Brown Sugar Cookies', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 19.2, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup plus 2 tablespoons all-purpose flour (or up to 1 cup flour as necessary, see directions below)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'(or up to 1 cup flour as necessary, see directions below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3/4 cup light brown sugar, packed (dark brown may be substituted)', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'dark', u'light', u'packed', u'( brown may be substituted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'pinch salt, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 1/2 tablespoons vanilla extract (yes tablespoons, not teaspoons)', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'(yes tablespoons, not teaspoons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.averiecooks.com/2013/09/softbatch-cookie-butter-brown-sugar-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"To the bowl of a stand mixer fitted with the paddle attachment (or large bowl and electric hand mixer), cream together the egg, Cookie Butter, brown sugar, and vanilla on medium-high speed until light and fluffy, about 4 to 5 minutes. Do not shortchange this creaming step, and if using a hand mixer, 6-7 minutes may be necessary. Don't overbeat or overdo it so that the oils start releasing (more prone to happening with peanut butter than Cookie Butter); just make sure the mixture is properly creamed. Stop, scrape down the sides of the bowl, and add 3/4 cup plus 2 tablespoons flour (which is 1 cup minus 2 tablespoons), cornstarch, cinnamon, baking soda, optional salt, and mix on low speed until just incorporated, about 1 minute; don't overmix. The dough will be soft and on the oily side, but it should come together and not be sticky, tacky, or wet. If it is, add up to 2 more tablespoons of flour, for a total of 1 cup, and mix to incorporate. Due to climate and variance in ingredients such as moisture level of brown sugar, volume of egg, brand of Cookie Butter, etc. the flour amount could vary by a few tablespoons. Using a medium 2-inch cookie scoop, form heaping two-tablespoon mounds (I made 13).", u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place mounds on a large plate, flatten mounds slightly, cover with plasticwrap, and refrigerate for at least 3 hours, or up to 5 days, before baking. Do not bake with warm dough because cookies will spread and bake thinner and flatter. Properly chilled dough is mandatory. Preheat oven to 350F, line a baking sheet with a\xa0Silpat, or spray with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 8 minutes, or until edges have set and tops are just beginning to set, even if slightly undercooked, pale and glossy in the center. Do not bake longer than 9 minutes if you want Softbatch-sytle cookies because they firm up as they cool (The cookies shown in the photos were baked with dough that had been chilled overnight, allowed to come to room temp while the oven preheated, and were baked for 8 minutes. They have slightly chewy edges with soft, pillowy, gooey centers). Allow cookies to cool on the baking sheet for about 5 minutes before removing and transferring to a rack to finish cooling. Store cookies airtight at room temperature for up to 1 week, or in the freezer for up to 4 months. Alternatively, unbaked cookie dough can be stored airtight in the refrigerator for up to 5 days, or in the freezer for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 54938, u'instructions': u"To the bowl of a stand mixer fitted with the paddle attachment (or large bowl and electric hand mixer), cream together the egg, Cookie Butter, brown sugar, and vanilla on medium-high speed until light and fluffy, about 4 to 5 minutes. Do not shortchange this creaming step, and if using a hand mixer, 6-7 minutes may be necessary. Don't overbeat or overdo it so that the oils start releasing (more prone to happening with peanut butter than Cookie Butter); just make sure the mixture is properly creamed. Stop, scrape down the sides of the bowl, and add 3/4 cup plus 2 tablespoons flour (which is 1 cup minus 2 tablespoons), cornstarch, cinnamon, baking soda, optional salt, and mix on low speed until just incorporated, about 1 minute; don't overmix. The dough will be soft and on the oily side, but it should come together and not be sticky, tacky, or wet. If it is, add up to 2 more tablespoons of flour, for a total of 1 cup, and mix to incorporate. Due to climate and variance in ingredients such as moisture level of brown sugar, volume of egg, brand of Cookie Butter, etc. the flour amount could vary by a few tablespoons. Using a medium 2-inch cookie scoop, form heaping two-tablespoon mounds (I made 13). Place mounds on a large plate, flatten mounds slightly, cover with plasticwrap, and refrigerate for at least 3 hours, or up to 5 days, before baking. Do not bake with warm dough because cookies will spread and bake thinner and flatter. Properly chilled dough is mandatory. Preheat oven to 350F, line a baking sheet with a\xa0Silpat, or spray with cooking spray. Place mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet). Bake for 8 minutes, or until edges have set and tops are just beginning to set, even if slightly undercooked, pale and glossy in the center. Do not bake longer than 9 minutes if you want Softbatch-sytle cookies because they firm up as they cool (The cookies shown in the photos were baked with dough that had been chilled overnight, allowed to come to room temp while the oven preheated, and were baked for 8 minutes. They have slightly chewy edges with soft, pillowy, gooey centers). Allow cookies to cool on the baking sheet for about 5 minutes before removing and transferring to a rack to finish cooling. Store cookies airtight at room temperature for up to 1 week, or in the freezer for up to 4 months. Alternatively, unbaked cookie dough can be stored airtight in the refrigerator for up to 5 days, or in the freezer for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/softbatch-cookie-butter-brown-sugar-cookies-520066', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 13, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}