{u'recipes': [{u'sourceName': u'Your Homebased Mom', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/485921-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 485921, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet & Spicy Turkey Burger & Giveaway', u'diets': [u'dairy free'], u'pricePerServing': 227.63, u'creditText': u'Your Homebased Mom', u'extendedIngredients': [{u'originalString': u'2 -3 Tbsp chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tbsp'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 1/2 lbs. ground turkey', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 5662, u'unit': u'lbs'}, {u'originalString': u'1/2 jalapeno, chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'juice of 1/2 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1/4 C mango chutney', u'aisle': u'Ethnic Foods', u'name': u'mango chutney', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango-chutney.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10119297, u'unit': u'C'}, {u'originalString': u'1/2 C mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'C'}, {u'originalString': u'1 package Lipton Onion Soup Mix', u'aisle': u'Canned and Jarred', u'name': u'onion soup mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 6094, u'unit': u'package'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.yourhomebasedmom.com/sweet-spicy-turkey-burger/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Combine all ingredients and form into patties.  Refrigerate for 1-2 hours to allow patty to firm up.  Cook on grill.  Top with mango jalapeno aioli and other desired toppings', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}]}, {u'equipment': [], u'step': u'Combine ingredients and refrigerate until ready to serve.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Turkey Burgers works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Terrazas de los Andes Reserva Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Bright red color with purple shades. Intense floral and fruity notes. Presence of violets, ripe black cherry and plum aromas. ReIts sweet and juicy mouthfeel delivers finesse, delicate tannins and an elegant finish of black fruits. veals a toasty and spicy character of black pepper and chocolate.Pair with Tuna Carpaccio and Red Fruits Vinaigrette, Tenderloin served with MediterraneanRatatouille and Moist Semisweet Chocolate Cake over Mascarpone and Red Fruits Ice Cream. View More', u'title': u'Terrazas de los Andes Reserva Malbec', u'price': u'$21.99', u'id': 438817, u'link': u'https://www.wine.com/product/terrazas-de-los-andes-reserva-malbec-2014/162923', u'imageUrl': u'https://spoonacular.com/productImages/438817-312x231.jpg'}]}, u'aggregateLikes': 260, u'instructions': u'Combine all ingredients and form into patties.  Refrigerate for 1-2 hours to allow patty to firm up.  Cook on grill.  Top with mango jalapeno aioli and other desired toppingsCombine ingredients and refrigerate until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-spicy-turkey-burger-giveaway-485921', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}