{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/529626-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 529626, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Cornbread Stuffing with Smoked Oysters and Sausage', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 333.95, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'1 Tbsp Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 stalk Celery, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'\xbd cup Chicken Stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'2 cups Cornbread, cubed', u'aisle': u'Bakery/Bread', u'name': u'cornbread', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornbread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18023, u'unit': u'cups'}, {u'originalString': u'1/2 cup Dried Cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1/2 tsp Dried Sage', u'aisle': u'Spices and Seasonings', u'name': u'dried sage', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002038, u'unit': u'tsp'}, {u'originalString': u'3 cloves Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 medium Onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 can Smoked Oysters, drained and finely chopped', u'aisle': u'Seafood', u'name': u'oysters', u'metaInformation': [u'smoked', u'drained', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 15167, u'unit': u'can'}, {u'originalString': u'1 pound Pork Sausage (like Johnsonville Sausage)', u'aisle': u'Meat', u'name': u'pork sausage', u'metaInformation': [u'(like Johnsonville Sausage)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1007063, u'unit': u'pound'}, {u'originalString': u'Salt and Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 Tbsp White Wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'Tbsp'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.countrycleaver.com/2013/11/cranberry-cornbread-stuffing-smoked-oysters-sausage.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat, and cook pork sausage until it begins to brown.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1007063, u'name': u'pork sausage'}]}, {u'equipment': [], u'step': u'Add in onion, celery, garlic, and sauge and continue to cook. Stir occasionally until the vegetables have softened and browned.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in cubed cornbread, cranberries and smoked oysters - fold in. Gently fold in chicken stock and white wine. Stir gently to combine completely.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornbread.jpg', u'id': 18023, u'name': u'cornbread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Add in salt and pepper to taste if desired.Use the butter to grease a casserole dish.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread stuffing into an even layer into the dish.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until its heated through and brown on top - about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately or if using to stuff into a bird - place into the freezer for one hour so it cools down.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cornbread works really well with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. You could try Chateau Ste. Michelle Cold Creek Vineyard Riesling. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish.', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 155, u'instructions': u'Preheat oven to 350 degrees.Heat a large skillet over medium heat, and cook pork sausage until it begins to brown. Add in onion, celery, garlic, and sauge and continue to cook. Stir occasionally until the vegetables have softened and browned. Add in cubed cornbread, cranberries and smoked oysters - fold in. Gently fold in chicken stock and white wine. Stir gently to combine completely. Add in salt and pepper to taste if desired.Use the butter to grease a casserole dish. Spread stuffing into an even layer into the dish. Bake until its heated through and brown on top - about 20 minutes.Serve immediately or if using to stuff into a bird - place into the freezer for one hour so it cools down.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-cornbread-stuffing-with-smoked-oysters-and-sausage-529626', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}