{u'recipes': [{u'sourceName': u'Heather Likes Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/512392-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 512392, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brown Butter Fettuccini Alfredo', u'diets': [], u'pricePerServing': 96.34, u'creditText': u'Heather Likes Food', u'extendedIngredients': [{u'originalString': u'1 lb fettuccini, cooked with some of the cooking water reserved.', u'aisle': u'Pasta and Rice', u'name': u'fettuccini', u'metaInformation': [u'with some of the cooking water reserved.', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'lb'}, {u'originalString': u'3 cloves fresh garlic, finely chopped or grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'grated', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2- 1 C shredded or shaved fresh parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'fresh', u'shredded', u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'C'}, {u'originalString': u'1/2 C salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001001, u'unit': u'C'}, {u'originalString': u'2 C Whipping Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'C'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.heatherlikesfood.com/brown-butter-fettuccini-alfredo/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt butter over med-low heat in a large skillet and stir in garlic when fully melted.Continue to cook the butter, stirring frequently. The butter will start to foam and when the foam subsides, look for the butter solids to start turning brown. When the solids are a nice golden brown, stir in the cream and bring to a simmer for about 3-4 minutes or until the sauce has thickened up to your liking. Stir in parmesan cheese, mixing to combine, followed by the pasta. If the sauce seems thick, thin it with some of the reserved cooking water from the pasta.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve with additional parmesan cheese and black pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Grigio and Unoaked Chardonnay are my top picks for Fettuccine Alfredo. Creamy, cheesy, buttery alfredo dishes can pair beautifully with an unoaked chardonnay or a pinot grigio. The Tiamo Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.', u'pairedWines': [u'pinot grigio', u'unoaked chardonnay'], u'productMatches': [{u'description': u"Light straw yellow color. Fresh and rich fruity aromas of apple and pear with a hint of citrus fruit that fade into the floral bouquet. Fresh and fruity, very clean and crisp.Tiamo Pinot Grigio pairs well with a wide array of lighter cuisine, especially fish/shellfish, poultry, pastas in cream sauce and softer cheeses. It's also an ideal aperitif.", u'title': u'Tiamo Pinot Grigio', u'price': u'$8.49', u'id': 438682, u'link': u'https://www.wine.com/product/tiamo-pinot-grigio-2008/98091', u'imageUrl': u'https://spoonacular.com/productImages/438682-312x231.jpg'}]}, u'aggregateLikes': 652, u'instructions': u'Melt butter over med-low heat in a large skillet and stir in garlic when fully melted.Continue to cook the butter, stirring frequently. The butter will start to foam and when the foam subsides, look for the butter solids to start turning brown. When the solids are a nice golden brown, stir in the cream and bring to a simmer for about 3-4 minutes or until the sauce has thickened up to your liking. Stir in parmesan cheese, mixing to combine, followed by the pasta. If the sauce seems thick, thin it with some of the reserved cooking water from the pasta. Serve with additional parmesan cheese and black pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/brown-butter-fettuccini-alfredo-512392', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}