{u'recipes': [{u'sourceName': u'Moms with Crock Pots', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483182-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 483182, u'veryPopular': True, u'lowFodmap': False, u'title': u'Apple Coffee Cake in the Crock Pot', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 84.65, u'creditText': u'Moms with Crock Pots', u'extendedIngredients': [{u'originalString': u'2 apples , peeled cored and diced', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'diced', u'cored', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'2 cups biscuit mix', u'aisle': u'Baking', u'name': u'biscuit mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18010, u'unit': u'cups'}, {u'originalString': u'\xbc cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 tablespoons firm butter or 2 tablespoons margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 egg , lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://momswithcrockpots.com/2012/02/apple-coffee-cake-in-the-crock-pot/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine first 9 ingredients in a large bowl', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Spread in a lightly greased 3\xbd quart crock pot (or spread in a lightly greased baking dish which fits in a larger sized crock pot).', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine streusel ingredients with a fork or pastry blender; sprinkle over the batter.Cover and cook on high for about 2\xbd hours, until a toothpick inserted in the center comes out clean.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1093, u'instructions': u'Combine first 9 ingredients in a large bowlSpread in a lightly greased 3\xbd quart crock pot (or spread in a lightly greased baking dish which fits in a larger sized crock pot).Combine streusel ingredients with a fork or pastry blender; sprinkle over the batter.Cover and cook on high for about 2\xbd hours, until a toothpick inserted in the center comes out clean.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-coffee-cake-in-the-crock-pot-483182', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}