{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/460299-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 460299, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ghirardelli\xae Flourless Mocha Torte', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 105.12, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 ounce Ghirardelli 60% Cacao Bittersweet Chocolate baking bar, for shavings', u'aisle': u'Baking', u'name': u'baking bar', u'metaInformation': [u'60%', u'for shavings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounce'}, {u'originalString': u'6 large eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2/3 cup granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 tablespoon instant freeze-dried coffee', u'aisle': u'Tea and Coffee', u'name': u'instant coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces Ghirardelli Milk Chocolate baking bar, broken or chopped into 1-inch pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Ghirardelli-Flourless-Mocha-Torte/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F. Grease two 8-inch or 9-inch round cake pans. Line the bottoms with parchment paper and grease the parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the torte, melt the bittersweet chocolate in the top of a double boiler or in a heatproof bowl over barely simmering water, stirring occasionally until smooth. Set aside. Dissolve the coffee in the boiling water; set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, whip the egg whites with an electric mixer on medium speed until soft peaks form. Gradually add 1/3 cup sugar, and increase the mixing speed to high and continue beating until stiff peaks form.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In another large bowl, whip the yolks, the remaining 1/3 cup sugar, and the salt with an electric mixer on medium speed until thick, about 5 minutes. Slowly add the chocolate mixture and coffee; beat until well blended. Fold one-quarter of the egg whites into the yolk mixture to lighten. Then fold in the remaining whites until no streaks remain.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the batter into the prepared pans.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake on the center oven rack for 25 minutes. Turn off the oven and leave the cake inside for 5 minutes. Invert and transfer the pans to a wire rack (the centers will fall).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the waxed paper and cool completely.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the frosting, melt the milk chocolate in the top of a double boiler or in a heatproof bowl over barely simmering water, stirring until smooth. Dissolve the coffee in the boiling water; add all at once to the chocolate, stirring continually until smooth. Cool completely.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat the cream at high speed until stiff peaks form. Gently fold the chocolate mixture into the whipped cream.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}], u'step': u'To assemble the torte, level the top of each layer by cutting off the raised edges with a long serrated knife.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Place one layer on a serving plate.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the layer with 1 cup of the chocolate whipped cream. Top with the remaining cake layer. Frost the top and sides of the torte with the remaining frosting. Sprinkle the top with bittersweet chocolate shavings.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Preheat the oven to 350 degrees F. Grease two 8-inch or 9-inch round cake pans. Line the bottoms with parchment paper and grease the parchment paper.                            To make the torte, melt the bittersweet chocolate in the top of a double boiler or in a heatproof bowl over barely simmering water, stirring occasionally until smooth. Set aside. Dissolve the coffee in the boiling water; set aside.                            In a large bowl, whip the egg whites with an electric mixer on medium speed until soft peaks form. Gradually add 1/3 cup sugar, and increase the mixing speed to high and continue beating until stiff peaks form.                            In another large bowl, whip the yolks, the remaining 1/3 cup sugar, and the salt with an electric mixer on medium speed until thick, about 5 minutes. Slowly add the chocolate mixture and coffee; beat until well blended. Fold one-quarter of the egg whites into the yolk mixture to lighten. Then fold in the remaining whites until no streaks remain. Pour the batter into the prepared pans.                            Bake on the center oven rack for 25 minutes. Turn off the oven and leave the cake inside for 5 minutes. Invert and transfer the pans to a wire rack (the centers will fall). Remove the waxed paper and cool completely.                            To make the frosting, melt the milk chocolate in the top of a double boiler or in a heatproof bowl over barely simmering water, stirring until smooth. Dissolve the coffee in the boiling water; add all at once to the chocolate, stirring continually until smooth. Cool completely.                            In a large bowl, beat the cream at high speed until stiff peaks form. Gently fold the chocolate mixture into the whipped cream.                            To assemble the torte, level the top of each layer by cutting off the raised edges with a long serrated knife. Place one layer on a serving plate. Spread the layer with 1 cup of the chocolate whipped cream. Top with the remaining cake layer. Frost the top and sides of the torte with the remaining frosting. Sprinkle the top with bittersweet chocolate shavings.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/ghirardelli-flourless-mocha-torte-460299', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}