{u'recipes': [{u'sourceName': u'Your Cup of Cake', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/592816-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 592816, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Pi\xf1a Colada Cupcakes', u'diets': [], u'pricePerServing': 30.38, u'creditText': u'Your Cup of Cake', u'extendedIngredients': [{u'originalString': u'2 Tbsp. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 tsp. coconut extract', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 12104, u'unit': u'tsp'}, {u'originalString': u'1 C. coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'C'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'4 Tbsp. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'1/3 C. oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4582, u'unit': u'C'}, {u'originalString': u'1 C. crushed pineapple, drained', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'crushed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'C'}, {u'originalString': u'1/2 C. pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9273, u'unit': u'C'}, {u'originalString': u'3-4 C. powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19336, u'unit': u'C'}, {u'originalString': u'2-4 Tbsp. Strawberry puree, fresh berries put through a blender', u'aisle': u'Alcoholic Beverages', u'name': u'strawberry puree', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-puree.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1009316, u'unit': u'Tbsp'}, {u'originalString': u'1/2 C. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'C'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 box white cake mix', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'box'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.yourcupofcake.com/2012/09/strawberry-pina-colada-cupcakes.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees and line your pans with cupcake liners.2. Sift cake mix into a small bowl and set aside.3. In a large bowl, combine eggs, oil, coconut milk, coconut extract and vanilla extract.4. Stir in cake mix until smooth.5. Fill cupcake liners 3/4 full and bake for 17-22 minutes or until an inserted knife comes our clean.6. Filling: Over medium heat, combine all ingredients (except butter) and stir constantly until thickened.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in butter, let cool completely. 7.  Once cupcakes and filling has cooled, cut out a hole from the top of the cupcake and fill it generously with pineapple filling.8.  Buttercream: Beat butter for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add vanilla extract and 2 Tbsp. strawberry puree.  Slowly add powdered sugar until you reach your desired consistency, add more strawberry puree if buttercream become stop thick.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-puree.png', u'id': 1009316, u'name': u'strawberry puree'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Add 2 tsp. strawberry flavored gelatin for added color and flavor. 9. Pipe buttercream over filled cupcakes and top with flaked coconut.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 29403, u'instructions': u'1. Preheat oven to 350 degrees and line your pans with cupcake liners.2. Sift cake mix into a small bowl and set aside.3. In a large bowl, combine eggs, oil, coconut milk, coconut extract and vanilla extract.4. Stir in cake mix until smooth.5. Fill cupcake liners 3/4 full and bake for 17-22 minutes or until an inserted knife comes our clean.6. Filling: Over medium heat, combine all ingredients (except butter) and stir constantly until thickened.  Remove from heat and stir in butter, let cool completely. 7.  Once cupcakes and filling has cooled, cut out a hole from the top of the cupcake and fill it generously with pineapple filling.8.  Buttercream: Beat butter for 2 minutes.  Add vanilla extract and 2 Tbsp. strawberry puree.  Slowly add powdered sugar until you reach your desired consistency, add more strawberry puree if buttercream become stop thick.  Add 2 tsp. strawberry flavored gelatin for added color and flavor. 9. Pipe buttercream over filled cupcakes and top with flaked coconut.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-pia-colada-cupcakes-592816', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}