{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474517-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 474517, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey-Lemon Chicken with Potatoes – Slow Cooker {Saturdays with Rachael Ray}', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 460.5, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'1 1/2 pounds baby potatoes', u'aisle': u'Produce', u'name': u'baby potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11352, u'unit': u'pounds'}, {u'originalString': u'Balsamic drizzle*', u'aisle': u'Condiments', u'name': u'balsamic glaze', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 98998, u'unit': u'servings'}, {u'originalString': u'8 bone-in, skin on chicken thighs', u'aisle': u'Meat', u'name': u'bone-in chicken thighs', u'metaInformation': [u'bone-in', u', skin on'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 1005091, u'unit': u''}, {u'originalString': u'1/4 cup chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'1/4 cup flat leaf parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'2 to 3 cloves garlic, finely chopped or grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 lemon, thinly sliced', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'zest of 1 lemon, cut into strips', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 cup pine nuts, toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 to 5 sprigs thyme, leaves picked and chopped', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'leaves picked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.tasteandtellblog.com/honey-lemon-chicken-with-potatoes-slow-cooker/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a skillet over medium-high heat.  Season the chicken with salt and pepper and brown in the hot oil for a minute or two on each side.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the potatoes in the bottom of the slow cooker.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, garlic, and thyme.  Season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add the chicken to the slow cooker and drizzle with the honey.  Lay the lemon slices on top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add the stock, put the cover on the slow cooker, and cook until the chicken is cooked through, 4 hours on high or 6-8 hours on low.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve each portion topped with lemon zest, parsley, pine nuts and balsamic drizzle.*You can buy balsamic drizzle at the store, or you can make your own.  To make your own, pour some balsamic vinegar in a pan and add a little bit of brown sugar.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Let it come to a simmer and cook until it has reduced down by about half.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 336, u'instructions': u'Heat the olive oil in a skillet over medium-high heat.  Season the chicken with salt and pepper and brown in the hot oil for a minute or two on each side.Place the potatoes in the bottom of the slow cooker.  Add the onion, garlic, and thyme.  Season with salt and pepper.  Add the chicken to the slow cooker and drizzle with the honey.  Lay the lemon slices on top.  Add the stock, put the cover on the slow cooker, and cook until the chicken is cooked through, 4 hours on high or 6-8 hours on low.Serve each portion topped with lemon zest, parsley, pine nuts and balsamic drizzle.*You can buy balsamic drizzle at the store, or you can make your own.  To make your own, pour some balsamic vinegar in a pan and add a little bit of brown sugar.  Let it come to a simmer and cook until it has reduced down by about half.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-lemon-chicken-with-potatoes-slow-cooker-saturdays-with-rachael-ray-474517', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 375, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}