{u'recipes': [{u'sourceName': u'Veg Recipes of India', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/488405-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 488405, u'veryPopular': False, u'lowFodmap': False, u'title': u'thai red curry , how to make veg thai red curry', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 202.82, u'creditText': u'Veg Recipes of India', u'extendedIngredients': [{u'originalString': u"2 thai chillies or bird's eye chilies", u'aisle': u'Produce;Ethnic Foods', u'name': u"bird's eye chile", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11670, u'unit': u''}, {u'originalString': u'\xbc tsp black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022030, u'unit': u'tsp'}, {u'originalString': u'2 dry red chillies', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1 cup thick coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'2 tbsp coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'tbsp'}, {u'originalString': u'1.5 to 2 tbsp sesame oil or coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'2 tsp coriander seeds', u'aisle': u'Spices and Seasonings', u'name': u'coriander seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2013, u'unit': u'tsp'}, {u'originalString': u'1 tsp cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'\xbd inch galangal', u'aisle': u'Produce;Ethnic Foods', u'name': u'galangal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/galangal.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 0.5, u'consistency': u'solid', u'id': 93656, u'unit': u'inch'}, {u'originalString': u'4-5 small garlic cloves or 2 to 3 medium garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'small', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2-3 medium kaffir lime leaves', u'aisle': u'Ethnic Foods', u'name': u'kaffir lime leaves', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93633, u'unit': u''}, {u'originalString': u'2 lemon grass stalks', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemon grass', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11972, u'unit': u''}, {u'originalString': u'\xbd tsp lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'salt as required', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2 to 3 shallots or 1 to 2 spring onions, chopped (optional)', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 tbsp chopped thai basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thai basil', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tbsp'}, {u'originalString': u'1.5 to 2 cups vegetable stock or water', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 tsp soya sauce or as required', u'aisle': u'?', u'name': u'as required', u'metaInformation': [], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u'tsp'}, {u'originalString': u'3 cups of chopped and steamed or lightly boiled mix vegetables (keep the stock for adding to the curry later)', u'aisle': u'?', u'name': u'lightly mix vegetables', u'metaInformation': [u'boiled', u'steamed', u'chopped', u'for adding to the curry later)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.vegrecipesofindia.com/veg-thai-red-curry-thai-red-curry/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'take all the all the ingredients mentioned for the thai red paste.put them in a grinder and make a semi fine or fine paste. keep aside.rinse and chop the veggies.steam or cook the vegetables till they are almost done.strain the vegetable stock from the vegetables. keep both the stock and the steamed or lightly boiled vegetables ready.In a pan, heat the sesame oil or coconut oil. add the shallots or spring onions and saute for 2-3 minutes. now add thai red curry paste.saute this mixture for a couple of minutes.now add  cup coconut milk to this paste.mix the coconut milk with the rest of the red curry paste.add the vegetable stock and mix everything.bring the curry to boil.now add the boiled vegetables.add the rest of the coconut milk.add salt and simmer for 10-12 minutes. now add thai basil leaves and just simmer for a minute.garnish the veg thai red curry with that basil leaves.serve the veg red thai curry with lemon grass rice or plain steamed rice.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6615, u'name': u'vegetable stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'id': 11972, u'name': u'lemon grass'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Pine Ridge Chenin Blanc - Viognier with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'The 2014 release of this intriguing blend delights the nose with a charming bouquet of enticing aromas of fresh Meyer lemon, fuzzy peach, ripe honeydew melon and yellow plum, mingled with touches of citrus blossom and white tea. The clean, vibrant palate enters with juicy pomelo, sweet lychee and honeyedtangerine fruits, balanced by vibrant acidity and hints of yellow apple and key lime pie that last through the crisp and refreshing finish.With its balanced acidity, this versatile wine pairs well with a number of dishes, from light salads to seafood to, most notably, foods with a hint of spiciness - its subtle sweetness provides balance alongside a touch of heat. Try Chenin Blanc + Viognier with a flavorful Thai curry, a sushi dish, such asa spicy tuna roll, or seared halibut. Blend: 80% Chenin Blanc, 20% Viognier', u'title': u'Pine Ridge Chenin Blanc - Viognier', u'price': u'$12.99', u'id': 438881, u'link': u'https://www.wine.com/product/pine-ridge-chenin-blanc-viognier-2014/142668', u'imageUrl': u'https://spoonacular.com/productImages/438881-312x231.jpg'}]}, u'aggregateLikes': 80, u'instructions': u'take all the all the ingredients mentioned for the thai red paste.put them in a grinder and make a semi fine or fine paste. keep aside.rinse and chop the veggies.steam or cook the vegetables till they are almost done.strain the vegetable stock from the vegetables. keep both the stock and the steamed or lightly boiled vegetables ready.In a pan, heat the sesame oil or coconut oil. add the shallots or spring onions and saute for 2-3 minutes. now add thai red curry paste.saute this mixture for a couple of minutes.now add  cup coconut milk to this paste.mix the coconut milk with the rest of the red curry paste.add the vegetable stock and mix everything.bring the curry to boil.now add the boiled vegetables.add the rest of the coconut milk.add salt and simmer for 10-12 minutes. now add thai basil leaves and just simmer for a minute.garnish the veg thai red curry with that basil leaves.serve the veg red thai curry with lemon grass rice or plain steamed rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-red-curry-how-to-make-veg-thai-red-curry-488405', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}