{u'recipes': [{u'sourceName': u'Table for Two Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/594124-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 594124, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lemon Pound Cake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 57.17, u'creditText': u'Table for Two Blog', u'extendedIngredients': [{u'originalString': u'\xbd tsp. almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002050, u'unit': u'tsp'}, {u'originalString': u'\xbe tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1\xbd cups cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Juice of 2 lemons (use the lemons you used for the zest)', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'for the zest)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 tsp. lemon extract', u'aisle': u'Baking', u'name': u'lemon extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 12311111, u'unit': u'tsp'}, {u'originalString': u'Zest of 2 lemons', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'3 tbsp. milk (I used 2%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'\xbe cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u"2 cups confectioner's sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'15 tbsp. unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 15.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.tablefortwoblog.com/lemon-pound-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Grease a 9x5 loaf pan with cooking spray and set aside.Beat milk, eggs, and the extracts in a bowl and set aside.In the bowl of a stand mixer, sift together flour, sugar, and baking powder and add the lemon zest. Stir to combine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the softened butter to the flour mixture and mix on low until just combined, about 30 seconds.Then slowly add in the milk mixture, beating on medium speed until batter is combined. Turn the mixer speed on high and beat for an additional 20-30 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Pour batter into prepared loaf pan and bake for 45-50 minutes, or until toothpick comes out clean when inserted in the center of the cake.Allow cake to cool for 15 minutes then un-mold.While cake is cooling, make the glaze.', u'length': {u'number': 65, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Combine powdered sugar and juice of 1 lemon, at first then slowly add the juice of the other lemon. Everyone likes their glaze consistency different so if you like it thicker, add less lemon juice, if you like it runnier, add more lemon juice.Once cake is cooled, take a fork and pierce all over the top of the cake. Unmold and set on a wire rack with parchment or wax paper underneath.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Pour the glaze evenly over the top and let it cool for 10-15 more minutes before slicing.Store in an airtight container for 1 week.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 232, u'instructions': u'Preheat oven to 350 degrees. Grease a 9x5 loaf pan with cooking spray and set aside.Beat milk, eggs, and the extracts in a bowl and set aside.In the bowl of a stand mixer, sift together flour, sugar, and baking powder and add the lemon zest. Stir to combine.Add the softened butter to the flour mixture and mix on low until just combined, about 30 seconds.Then slowly add in the milk mixture, beating on medium speed until batter is combined. Turn the mixer speed on high and beat for an additional 20-30 seconds.Pour batter into prepared loaf pan and bake for 45-50 minutes, or until toothpick comes out clean when inserted in the center of the cake.Allow cake to cool for 15 minutes then un-mold.While cake is cooling, make the glaze. Combine powdered sugar and juice of 1 lemon, at first then slowly add the juice of the other lemon. Everyone likes their glaze consistency different so if you like it thicker, add less lemon juice, if you like it runnier, add more lemon juice.Once cake is cooled, take a fork and pierce all over the top of the cake. Unmold and set on a wire rack with parchment or wax paper underneath. Pour the glaze evenly over the top and let it cool for 10-15 more minutes before slicing.Store in an airtight container for 1 week.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-pound-cake-594124', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}