{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223907-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 223907, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rainbow rippled meringues', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 123.85, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tbsp freeze-dried blueberries, pounded to a dust using a pestle and mortar', u'aisle': u'Dried Fruits;Produce', u'name': u'dried blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries-dried.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93686, u'unit': u'tbsp'}, {u'originalString': u'4 large eggs whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'purple food colouring paste', u'aisle': u'Baking', u'name': u'food colouring', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 21.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'blue food colouring paste', u'aisle': u'Baking', u'name': u'food colouring', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 21.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'green food colouring paste', u'aisle': u'Baking', u'name': u'food colouring', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 21.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'yellow food colouring paste', u'aisle': u'Baking', u'name': u'food colouring', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 21.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'2 tbsp freeze-dried raspberries, pounded to dust using a pestle and mortar', u'aisle': u'Dried Fruits', u'name': u'freeze dried strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freeze-dried-strawberries.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 98946, u'unit': u'tbsp'}, {u'originalString': u'\xbd tbsp dried lavender, pounded to a dust using a pestle and mortar', u'aisle': u'Gourmet', u'name': u'lavender', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93811, u'unit': u'tbsp'}, {u'originalString': u'very finely grated zest 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'orange food colouring paste', u'aisle': u'Baking', u'name': u'orange food colouring', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 21.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'very finely grated zest 1 orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'2 tbsp finely chopped shelled pistachios', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'shelled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12151, u'unit': u'tbsp'}, {u'originalString': u'extra-large round piping nozzle', u'aisle': u'Meat', u'name': u'round steak', u'metaInformation': [u'extra-large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/round-steak.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 23617, u'unit': u'oz'}, {u'originalString': u'225g white caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'disposable piping bags', u'aisle': u'?', u'name': u'disposable piping', u'metaInformation': [], u'unitLong': u'bag', u'unitShort': u'bags', u'amount': 1.0, u'unit': u'bags'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/rainbow-rippled-meringues', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 140.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 140C/120C fan/gas 1 andline 2 large baking sheets with bakingparchment. First, set up your piping bags.You will need 3 disposable piping bagsfor the 3 flavours. Using a wet paintbrush,paint lines of undiluted food colouringalong the inside of the piping bags. Be quite generous,because you want bold colours. Wash thebrush well between each colour so theydon’t mix. Snip off the end of 1 bag anddrop in an extra-large round pipingnozzle, then put the bags to one side.Tip the egg whites into a large mixingbowl or table-top mixer – make sure it’sgrease-free before you start.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk theeggs with an electric hand whisk or inyour mixer, until they hold soft peaks.Begin adding the sugar 1 tbsp at a time,whisking continuously, until you havea thick and glossy meringue, whichwill hold up in a stiff peak on the endof the whisk. Divide the meringue into3 bowls and swirl through your chosenflavourings (to correspond to the pipingbag colours). You want to achieve amarbled effect rather than thoroughlymixing it all in.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Put the piping bag fitted with yournozzle into a tall glass or jug and roll thepiping bag down over the lip of the jug tohold it in place. Fill the bag with thecorrect flavoured meringue to match thecolour in the bag. Lift up and twist theend to seal.Hold the piping bag about 2cmvertically above the baking tray. Apply aneven pressure to the bag, slowly liftingthe bag as you squeeze, to make asmooth round meringue, approximately6cm wide. To finish with a nice peak atthe top, push down a little on the mixturethen quickly pull the nozzle away.Continue until all the mixture in the bagis used up, leaving enough room for themeringues to spread a little. Quickly removethe nozzle, wash it and dry well, thendrop in the next piping bag. Continuewith the remaining mixtures until it theyare all used up and you have 2 trayscovered with 3 colours of meringues.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 1 hr, turning the heat downto 120C/100C fan/gas \xbd for the final30 mins.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven andcool on wire racks while you makeanother batch of meringues with theremaining 3 flavours, if you like. Can bemade up to a week ahead and kept inan airtight container, or serve with our flavoured creams (see tips, below).', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 638, u'instructions': u'Heat oven to 140C/120C fan/gas 1 andline 2 large baking sheets with bakingparchment. First, set up your piping bags.You will need 3 disposable piping bagsfor the 3 flavours. Using a wet paintbrush,paint lines of undiluted food colouringalong the inside of the piping bags. Be quite generous,because you want bold colours. Wash thebrush well between each colour so theydon’t mix. Snip off the end of 1 bag anddrop in an extra-large round pipingnozzle, then put the bags to one side.Tip the egg whites into a large mixingbowl or table-top mixer – make sure it’sgrease-free before you start. Whisk theeggs with an electric hand whisk or inyour mixer, until they hold soft peaks.Begin adding the sugar 1 tbsp at a time,whisking continuously, until you havea thick and glossy meringue, whichwill hold up in a stiff peak on the endof the whisk. Divide the meringue into3 bowls and swirl through your chosenflavourings (to correspond to the pipingbag colours). You want to achieve amarbled effect rather than thoroughlymixing it all in.Put the piping bag fitted with yournozzle into a tall glass or jug and roll thepiping bag down over the lip of the jug tohold it in place. Fill the bag with thecorrect flavoured meringue to match thecolour in the bag. Lift up and twist theend to seal.Hold the piping bag about 2cmvertically above the baking tray. Apply aneven pressure to the bag, slowly liftingthe bag as you squeeze, to make asmooth round meringue, approximately6cm wide. To finish with a nice peak atthe top, push down a little on the mixturethen quickly pull the nozzle away.Continue until all the mixture in the bagis used up, leaving enough room for themeringues to spread a little. Quickly removethe nozzle, wash it and dry well, thendrop in the next piping bag. Continuewith the remaining mixtures until it theyare all used up and you have 2 trayscovered with 3 colours of meringues.Bake for 1 hr, turning the heat downto 120C/100C fan/gas \xbd for the final30 mins. Remove from the oven andcool on wire racks while you makeanother batch of meringues with theremaining 3 flavours, if you like. Can bemade up to a week ahead and kept inan airtight container, or serve with our flavoured creams (see tips, below).', u'spoonacularSourceUrl': u'https://spoonacular.com/rainbow-rippled-meringues-223907', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 21, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}