{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/514064-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 514064, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bacon Cheddar Ranch Burgers', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 425.87, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'8 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'freshly ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 slices cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'slices'}, {u'originalString': u'2 tsp. dried dill', u'aisle': u'Spices and Seasonings', u'name': u'dried dill', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2017, u'unit': u'tsp'}, {u'originalString': u'1 tbsp. dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'tbsp'}, {u'originalString': u'your choice of condiments (I like spicy brown mustard)', u'aisle': u'Oil, Vinegar, Salad Dressing;Milk, Eggs, Other Dairy', u'name': u'fat of choice', u'metaInformation': [u'(I like spicy brown mustard)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1011001, u'unit': u'servings'}, {u'originalString': u'\xbd tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 lb. ground turkey (beef or chicken is OK too)', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [u'(beef or chicken is OK too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'\xbe tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'\xbd tsp. onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'4 hamburger buns or torta rolls (as shown here)', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'(as shown here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'sliced tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://wearychef.com/bacon-cheddar-ranch-burgers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Cook your bacon using whatever method you like. I prefer cooking it in the microwave for 3-4 minutes between layers of paper towels or in a 400 degree oven for about 20 minutes.Meanwhile, stir together turkey, yogurt, parsley, dill, garlic powder, onion powder, salt, and pepper. Form into four patties.Spray a large skillet with cooking spray, and heat over medium-high heat. Carefully place burger patties in hot skillet, and cook for about 7 minutes per side, until cooked through. In the last few minutes of cooking, place a cheese slice on top of each burger to melt.Dress your buns with mustard or whatever condiments you like, then place burger patties on buns. Top with bacon, lettuce, and tomato. Enjoy!', u'length': {u'number': 31, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Belasco de Baquedano Llama Malbec. It has 4.3 out of 5 stars and a bottle costs about 17 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'As its namesake, this wine embodies the distinctive spirit of our vineyards, spanning the foothills of the Andes. Llama is a rich ruby-purple color, and boasts elegant flavors of black berries, ripe plum and robust spices with good balance and structure. View More', u'title': u'Belasco de Baquedano Llama Malbec', u'price': u'$16.99', u'id': 449922, u'link': u'https://www.wine.com/product/belasco-de-baquedano-llama-malbec-2013/132727', u'imageUrl': u'https://spoonacular.com/productImages/449922-312x231.jpg'}]}, u'aggregateLikes': 1318, u'instructions': u'Cook your bacon using whatever method you like. I prefer cooking it in the microwave for 3-4 minutes between layers of paper towels or in a 400 degree oven for about 20 minutes.Meanwhile, stir together turkey, yogurt, parsley, dill, garlic powder, onion powder, salt, and pepper. Form into four patties.Spray a large skillet with cooking spray, and heat over medium-high heat. Carefully place burger patties in hot skillet, and cook for about 7 minutes per side, until cooked through. In the last few minutes of cooking, place a cheese slice on top of each burger to melt.Dress your buns with mustard or whatever condiments you like, then place burger patties on buns. Top with bacon, lettuce, and tomato. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-cheddar-ranch-burgers-514064', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}