{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/698452-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 698452, u'veryPopular': False, u'lowFodmap': False, u'title': u'Corn Pudding', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 68.39, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 teaspoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons plain dry breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'dry breadcrumbs', u'metaInformation': [u'plain', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tablespoons'}, {u'originalString': u'3 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 cups fresh corn kernels, (about 2 large ears), divided (see Tip)', u'aisle': u'Produce', u'name': u'fresh corn kernels', u'metaInformation': [u'fresh', u'divided', u'large', u'( 2 ears)', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011167, u'unit': u'cups'}, {u'originalString': u'1 cup nonfat evaporated milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/corn_pudding.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325F. Coat a 1 1/2- or 2-quart souffl or baking dish with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine 1 cup corn and flour in a food processor or blender; process until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk eggs and egg whites in a large bowl. Stir in the pureed corn, the remaining 1 cup kernels, evaporated milk, salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour the mixture into the prepared dish.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Bake for 30 minutes.Meanwhile, melt butter in a small saucepan over low heat and cook until a light, nutty brown, 30 seconds to 4 minutes, depending on your stove.', u'length': {u'number': 34, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Add breadcrumbs and cook, stirring frequently, until the crumbs darken slightly, 1 to 1 1/2 minutes.When the pudding has baked for 30 minutes, sprinkle the breadcrumbs on top and continue to bake until a knife inserted near the center comes out clean, 25 to 35 minutes more.', u'length': {u'number': 57, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 18, u'instructions': u'Preheat oven to 325F. Coat a 1 1/2- or 2-quart souffl or baking dish with cooking spray.Combine 1 cup corn and flour in a food processor or blender; process until smooth. Whisk eggs and egg whites in a large bowl. Stir in the pureed corn, the remaining 1 cup kernels, evaporated milk, salt and pepper. Pour the mixture into the prepared dish. Bake for 30 minutes.Meanwhile, melt butter in a small saucepan over low heat and cook until a light, nutty brown, 30 seconds to 4 minutes, depending on your stove. Add breadcrumbs and cook, stirring frequently, until the crumbs darken slightly, 1 to 1 1/2 minutes.When the pudding has baked for 30 minutes, sprinkle the breadcrumbs on top and continue to bake until a knife inserted near the center comes out clean, 25 to 35 minutes more. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/corn-pudding-698452', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}