{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522882-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 522882, u'veryPopular': True, u'lowFodmap': False, u'title': u'Flank Steak with Cilantro Pesto', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 195.67, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tbsp chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'3 tablespoons plain fat-free yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free plain yogurt', u'metaInformation': [u'plain', u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1118, u'unit': u'tablespoons'}, {u'originalString': u'1 (1-pound) flank steak, trimmed', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'pound'}, {u'originalString': u'3/4 cup fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 clove garlic, sliced or mashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'mashed', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 garlic clove, chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon chopped seeded jalape\xf1o pepper', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u'tablespoon'}, {u'originalString': u'juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 1/2 teaspoons fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'teaspoons'}, {u'originalString': u'4 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'dash of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'dash'}, {u'originalString': u'2 tablespoons pine nuts , toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.creative-culinary.com/flank-steak-with-cilantro-pesto/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix marinade ingredients. Lightly score flank steak on both sides and cover with marinade.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Let marinate for at least one hour or overnight.For the pesto, combine first 6 ingredients in a blender; process until finely chopped (about 15 seconds).', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add yogurt and juice; process until smooth.Grill steak 6 minutes (med) on each side or until desired degree of doneness.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut steak diagonally across grain into thin slices.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve steak with pesto.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with cilantro sprigs, if desired.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Flank Steak. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. One wine you could try is Beringer Howell Mountain Bancroft Ranch Merlot. It has 4.2 out of 5 stars and a bottle costs about 35 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"The 2006 Bancroft Ranch Merlot is a rich garnet color, and brims with flavors of ripe black fruits, brown spices and a hint of orange zest. Its refined tannins and depth of flavor make it one of Beringer's most memorable wines from Howell Mountain.Blend: 93% Merlot, 4% Cabernet Sauvignon, and 3% Cabernet Franc", u'title': u'Beringer Howell Mountain Bancroft Ranch Merlot', u'price': u'$34.99', u'id': 438453, u'link': u'https://www.wine.com/product/beringer-howell-mountain-bancroft-ranch-merlot-2006/116574', u'imageUrl': u'https://spoonacular.com/productImages/438453-312x231.jpg'}]}, u'aggregateLikes': 1771, u'instructions': u'Mix marinade ingredients. Lightly score flank steak on both sides and cover with marinade. Let marinate for at least one hour or overnight.For the pesto, combine first 6 ingredients in a blender; process until finely chopped (about 15 seconds). Add yogurt and juice; process until smooth.Grill steak 6 minutes (med) on each side or until desired degree of doneness. Cut steak diagonally across grain into thin slices. Serve steak with pesto. Garnish with cilantro sprigs, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/flank-steak-with-cilantro-pesto-522882', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}