{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/282076-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 105, u'id': 282076, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raspberry-Tres Leches Cake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 54.82, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u"1/2 cup BREAKSTONE'S or KNUDSEN Sour Cream", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 can (12 oz.) evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1214, u'unit': u'oz'}, {u'originalString': u'1 cup fresh raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'1 pkg. (3 oz.) JELL-O Raspberry Flavor Gelatin', u'aisle': u'Baking', u'name': u'raspberry flavor gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-jello.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10319172, u'unit': u'oz'}, {u'originalString': u'1 can (14 oz.) sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'1 cup thawed COOL WHIP Whipped Topping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 42135, u'unit': u'cup'}, {u'originalString': u'1 pkg. (2-layer size) white cake mix', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white', u'(2-layer size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'pkg'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/raspberry-tres-leches-cake-127748.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare cake batter and bake in 13x9-inch pan as directed on package.  Cool 10 min.  Pierce cake with large fork at 1/2-inch intervals.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend milks, sour cream and dry gelatin mix in blender until well blended.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over cake; let stand until milk mixture is completely absorbed, re-piercing cake if necessary.  Refrigerate 1 hour.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Frost cake with COOL WHIP.  Top with raspberries just before serving.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Prepare cake batter and bake in 13x9-inch pan as directed on package.  Cool 10 min.  Pierce cake with large fork at 1/2-inch intervals.                                              Blend milks, sour cream and dry gelatin mix in blender until well blended.  Pour over cake; let stand until milk mixture is completely absorbed, re-piercing cake if necessary.  Refrigerate 1 hour.                                             Frost cake with COOL WHIP.  Top with raspberries just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-tres-leches-cake-282076', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}