{u'recipes': [{u'sourceName': u'Buns in My Oven', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/616013-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 616013, u'veryPopular': True, u'lowFodmap': False, u'title': u'Meatball Casserole with Cheese Ravioli', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 317.82, u'creditText': u'Buns in My Oven', u'extendedIngredients': [{u'originalString': u'1 pound refrigerated cheese ravioli', u'aisle': u'Refrigerated;Frozen', u'name': u'cheese ravioli', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93832, u'unit': u'pound'}, {u'originalString': u'2 tablespoons chopped fresh basil', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 pound Casa meatballs', u'aisle': u'Meat', u'name': u'meatballs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10110219, u'unit': u'pound'}, {u'originalString': u'1/4 cup fresh Mozzarella pearls', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'1/4 cup finely grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 25 ounce jar pasta sauce', u'aisle': u'Pasta and Rice', u'name': u'pasta sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 25.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'ounce'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.bunsinmyoven.com/2014/10/06/meatball-casserole/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the ravioli according to package directions.While the ravioli is cooking, heat a deep 10-12 inch skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'id': 93832, u'name': u'ravioli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the meatballs to the pan, pour in the sauce and stir in the garlic. Cover and simmer for 10-15 minutes or until the meatballs are warmed through.Stir the cooked ravioli into the skillet with the meatballs and sauce. Stir gently to coat the ravioli in the sauce. Top with the mozzarella pearls. Turn the heat to low, cover, and let sit for 3 minutes or until the mozzarella has melted.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'id': 93832, u'name': u'ravioli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Serve immediately, topped with the grated Parmesan and basil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 1002, u'instructions': u'Cook the ravioli according to package directions.While the ravioli is cooking, heat a deep 10-12 inch skillet over medium heat. Add the meatballs to the pan, pour in the sauce and stir in the garlic. Cover and simmer for 10-15 minutes or until the meatballs are warmed through.Stir the cooked ravioli into the skillet with the meatballs and sauce. Stir gently to coat the ravioli in the sauce. Top with the mozzarella pearls. Turn the heat to low, cover, and let sit for 3 minutes or until the mozzarella has melted.Serve immediately, topped with the grated Parmesan and basil.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatball-casserole-with-cheese-ravioli-616013', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}