{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597411-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 597411, u'veryPopular': False, u'lowFodmap': False, u'title': u'Parsley Pesto Pasta', u'diets': [], u'pricePerServing': 375.46, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'4 cups fresh parsley (stems and all)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'(stems and all)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'cups'}, {u'originalString': u'1 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8 ounces spaghetti or linguine', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'ounces'}, {u'originalString': u'1/2 cup walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 98.0, u'imageType': u'png', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.framedcooks.com/2014/06/parsley-pesto-pasta.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to package directions in heavily salted water.  Scoop out a cup of pasta water before you drain it.2. While the pasta is cooking, make the pesto: process the parsley and walnuts until well chopped.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the cheese and pulse a few times.  Now pour the oil through the feeder tube while the processor is running until the pesto is smooth.3. Toss the hot pasta with the pesto, adding the pesto in increments until you have the amount you like on your pasta (you may have some leftover, which is a wonderful thing!).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add a little pasta water until the pasta has a light sauce.4.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve garnished with a little chopped parsley and fresh ground pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 39, u'instructions': u'1. Cook pasta according to package directions in heavily salted water.  Scoop out a cup of pasta water before you drain it.2. While the pasta is cooking, make the pesto: process the parsley and walnuts until well chopped.  Add the cheese and pulse a few times.  Now pour the oil through the feeder tube while the processor is running until the pesto is smooth.3. Toss the hot pasta with the pesto, adding the pesto in increments until you have the amount you like on your pasta (you may have some leftover, which is a wonderful thing!).  Add a little pasta water until the pasta has a light sauce.4. Serve garnished with a little chopped parsley and fresh ground pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/parsley-pesto-pasta-597411', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}