{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522591-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 100, u'id': 522591, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken relleno', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 113.56, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'250 g. of belly bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'g'}, {u'originalString': u'1 c. of beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'c'}, {u'originalString': u'1/3 c. of finely chopped carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11124, u'unit': u'c'}, {u'originalString': u'1 tsp. of cayenne powder', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'a whole dressed chicken, 2 to 2.2 kg. in weight', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u''}, {u'originalString': u'1/2 tsp. of dried rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. of dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. of fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2018, u'unit': u'tsp'}, {u'originalString': u'250 g. of ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10219, u'unit': u'g'}, {u'originalString': u'3 hard-boiled eggs, shelled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled eggs', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'1/3 c. of finely chopped onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11282, u'unit': u'c'}, {u'originalString': u'3/4 c. of panko (Japanese bread crumbs)', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [u'(Japanese bread crumbs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10018079, u'unit': u'c'}, {u'originalString': u'1/2 tsp. of freshly milled black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1/3 c. of finely chopped bell peppers (I used a combination of red and green bell peppers)', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'green', u'red', u'finely chopped', u'(I used a combination of and bell peppers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11821, u'unit': u'c'}, {u'originalString': u'1 tbsp. of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tbsp'}, {u'originalString': u'1 tsp. of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'1/3 c. of sweet pickle relish', u'aisle': u'Condiments', u'name': u'sweet pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11945, u'unit': u'c'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://casaveneracion.com/chicken-relleno/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Debone the chicken. Separate the meat from the bones, NOT the meat from the skin.Using a small pointed and very sharp knife (I used a paring knife), cut around the tail end of the chicken to separate the meat from the bone. Use swift short strokes.Do NOT push the knife too far. Just small nips. As you cut with one hand, use the other the pull the meat away from the bone. When you have about three inches of the back bone exposed, set the knife aside and use your fingers to gently separate the meat from the bone. Just start pushing your fingers inside the chicken, little by little, feeling where the bone is and then inserting your fingers between the meat and the bone.Now, you’ll need the knife again to cut through five areas — the four joints and the neck bone. The four joints are the two joints separating the thighs from the legs (drumsticks), and the two joints separating the “little drumstick” (attached to the wings) from the breast.So, just use the knife to cut through the joints. I deboned the thigh but, if you feel more comfortable, you can cut the joint that separates the thigh from the back rather than the joint that separates the thigh from the leg. That way, there’s no need to debone the thigh.Once you’ve cut through the four joints and the neck bone, you can pull off the bony carcass in one piece.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Mix together all the ingredients for the marinade.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the deboned chicken in a resealable bag.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour in the marinade. Keep in the fridge overnight, turning the bag over after about six hours.Preheat the oven to 375F.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Mix together all the ingredients for the stuffing, except the hard-boiled eggs.Take the chicken out of the bag. Stuff the cavity. You’ll have to push the stuffing all the way inside to make sure that every nook and cranny gets stuffed.Now take the three eggs and push them through the stuffing, one after the other.Use wooden toothpicks to seal the opening. In case the skin tore, use toothpicks as well to mend the tear.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'id': 1129, u'name': u'hard boiled egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place a rack on a baking dish and arrange the chicken on the rack. I originally intended to roast the chicken breast side up but I figured that I wanted the melted bacon fat to fall onto the breast meat so I ended up roasting the chicken breast side down.Roast the chicken at 375F. Depending on the size of the chicken, this can take anywhere from an hour and twenty minutes to an hour and fifty minutes. If you did not debone the thighs, the roasting time would be longer to make sure that the thigh meat is cooked through.Cover the roasted chicken relleno loosely with a foil and cool for at least 15 minutes. Longer is better. In fact, chilling it in the fridge for a couple of hours after cooling will make slicing easier.Slice the chicken and serve. You might want to pour gravy over it but, seriously, ketchup and mayo are fine with me.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'aggregateLikes': 201, u'instructions': u'InstructionsDebone the chicken. Separate the meat from the bones, NOT the meat from the skin.Using a small pointed and very sharp knife (I used a paring knife), cut around the tail end of the chicken to separate the meat from the bone. Use swift short strokes.Do NOT push the knife too far. Just small nips. As you cut with one hand, use the other the pull the meat away from the bone. When you have about three inches of the back bone exposed, set the knife aside and use your fingers to gently separate the meat from the bone. Just start pushing your fingers inside the chicken, little by little, feeling where the bone is and then inserting your fingers between the meat and the bone.Now, you’ll need the knife again to cut through five areas — the four joints and the neck bone. The four joints are the two joints separating the thighs from the legs (drumsticks), and the two joints separating the “little drumstick” (attached to the wings) from the breast.So, just use the knife to cut through the joints. I deboned the thigh but, if you feel more comfortable, you can cut the joint that separates the thigh from the back rather than the joint that separates the thigh from the leg. That way, there’s no need to debone the thigh.Once you’ve cut through the four joints and the neck bone, you can pull off the bony carcass in one piece.Mix together all the ingredients for the marinade.Place the deboned chicken in a resealable bag. Pour in the marinade. Keep in the fridge overnight, turning the bag over after about six hours.Preheat the oven to 375F.Mix together all the ingredients for the stuffing, except the hard-boiled eggs.Take the chicken out of the bag. Stuff the cavity. You’ll have to push the stuffing all the way inside to make sure that every nook and cranny gets stuffed.Now take the three eggs and push them through the stuffing, one after the other.Use wooden toothpicks to seal the opening. In case the skin tore, use toothpicks as well to mend the tear.Place a rack on a baking dish and arrange the chicken on the rack. I originally intended to roast the chicken breast side up but I figured that I wanted the melted bacon fat to fall onto the breast meat so I ended up roasting the chicken breast side down.Roast the chicken at 375F. Depending on the size of the chicken, this can take anywhere from an hour and twenty minutes to an hour and fifty minutes. If you did not debone the thighs, the roasting time would be longer to make sure that the thigh meat is cooked through.Cover the roasted chicken relleno loosely with a foil and cool for at least 15 minutes. Longer is better. In fact, chilling it in the fridge for a couple of hours after cooling will make slicing easier.Slice the chicken and serve. You might want to pour gravy over it but, seriously, ketchup and mayo are fine with me.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-relleno-522591', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}