{u'recipes': [{u'sourceName': u'I Heart Nap Time', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/623768-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 623768, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skillet breakfast potatoes', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 58.95, u'creditText': u'I Heart Nap Time', u'extendedIngredients': [{u'originalString': u'6 pieces bacon, cut into 1 inch pieces', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cut into 1 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'pieces'}, {u'originalString': u'3 large baking potatoes', u'aisle': u'Produce', u'name': u'baking potatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1 (4 oz can) Old El Paso green chiles, chopped', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11819, u'unit': u'oz'}, {u'originalString': u'1/2 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 cup onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 cup shredded sharp cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.iheartnaptime.net/skillet-breakfast-potatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Wash your potatoes and then pierceseveral times with a fork. Cook in the microwave for 10-15 minutes or until fork tender.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and allow to cool.While the potatoes are cooking, cook the bacon in a frying pan or large skillet over medium heat. Cook until crisp and then remove with a slotted spoon and place on a paper towel lined plate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place onions and green chiles in the pan with bacon grease and saute until the onions are translucent. Next, dice the potatoes (I like to remove some of the skin first) and then place in the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add salt and pepper and then stir around, breaking up any large pieces.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add cheese and bacon on top and turn heat to low and allow to cook until the cheese is melted.Enjoy with a fried egg, salsa and sour cream on top. We also like to roll these potatoes up in a tortilla with scrambled eggs to make breakfast burritos. They even taste great as a dinner side. So many yummy ways to enjoy them!', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 58, u'instructions': u'Wash your potatoes and then pierceseveral times with a fork. Cook in the microwave for 10-15 minutes or until fork tender. Remove and allow to cool.While the potatoes are cooking, cook the bacon in a frying pan or large skillet over medium heat. Cook until crisp and then remove with a slotted spoon and place on a paper towel lined plate.Place onions and green chiles in the pan with bacon grease and saute until the onions are translucent. Next, dice the potatoes (I like to remove some of the skin first) and then place in the pan. Add salt and pepper and then stir around, breaking up any large pieces. Add cheese and bacon on top and turn heat to low and allow to cook until the cheese is melted.Enjoy with a fried egg, salsa and sour cream on top. We also like to roll these potatoes up in a tortilla with scrambled eggs to make breakfast burritos. They even taste great as a dinner side. So many yummy ways to enjoy them!', u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-breakfast-potatoes-623768', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}