{u'recipes': [{u'sourceName': u'Healthy Seasonal Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/620648-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 620648, u'veryPopular': False, u'lowFodmap': True, u'title': u'mom’s 10 minute cranberry orange relish', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 30.42, u'creditText': u'Healthy Seasonal Recipes', u'extendedIngredients': [{u'originalString': u'12 ounces cranberries, picked over and rinsed', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'picked over', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9078, u'unit': u'ounces'}, {u'originalString': u'\xbd navel orange (with skin), cut into 6 pieces', u'aisle': u'Produce', u'name': u'navel orange', u'metaInformation': [u'with skin), cut into 6 pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9202, u'unit': u''}, {u'originalString': u'2 tablespoon raspberry jam, or to taste', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'raspberry jam', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10719297, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons sugar, or to taste', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.healthyseasonalrecipes.com/moms-10-minute-cranberry-orange-relish/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Remove any seeds from orange (if there are any) and place in food processor fitted with steel blade attachment. Process until chopped into pieces no larger than a pea.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add cranberries and pulse until the cranberries are finely chopped.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk raspberry jam in a medium bowl to loosen.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'id': 10719297, u'name': u'raspberry jam'}]}, {u'equipment': [], u'step': u'Add cranberry mixture and sugar and stir thoroughly until the jam is incorporated and the sugar is dissolved. Refrigerate up to one week.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 207, u'instructions': u'Remove any seeds from orange (if there are any) and place in food processor fitted with steel blade attachment. Process until chopped into pieces no larger than a pea. Add cranberries and pulse until the cranberries are finely chopped. Whisk raspberry jam in a medium bowl to loosen. Add cranberry mixture and sugar and stir thoroughly until the jam is incorporated and the sugar is dissolved. Refrigerate up to one week.', u'spoonacularSourceUrl': u'https://spoonacular.com/moms-10-minute-cranberry-orange-relish-620648', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}