{u'recipes': [{u'sourceName': u'Bakerita', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/797890-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 797890, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blueberry Nectarine Pie with Almond Crumble (Gluten Free + Refined Sugar Free)', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 218.27, u'creditText': u'Bakerita', u'extendedIngredients': [{u'originalString': u'\xbd cup almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93740, u'unit': u'cup'}, {u'originalString': u'\xbd cup sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'2 cups blanched almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'blanched almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93740, u'unit': u'cups'}, {u'originalString': u'2 cups fresh blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cups'}, {u'originalString': u'\xbd teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'6 tablespoons coconut oil, solid', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'1 large egg, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 egg white, to egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'Zest & juice of 1 small lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 tablespoons honey or maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'6 fresh nectarines, cored and sliced', u'aisle': u'Produce', u'name': u'nectarines', u'metaInformation': [u'fresh', u'cored', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nectarines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9191, u'unit': u''}, {u'originalString': u'\xbc teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup tapioca flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93696, u'unit': u'cup'}, {u'originalString': u'2 tablespoons tapioca flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93696, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.bakerita.com/blueberry-nectarine-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350F.In a mixing bowl, combine the almond flour and sea salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the melted coconut oil and egg and mix until the mixture completely comes together. Press the crust into a 9 pie plate, up and around the edges.In a small bowl, whisk the egg white slightly. Use a pastry brush to brush egg white on the bottom of the crust to prevent it from getting soggy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place the crust in the freezer while preparing the filling and crumb topping.In a medium mixing bowl, combine the nectarines, blueberries, lemon zest, lemon juice, cinnamon, nutmeg, coconut sugar and tapioca flour. Stir to combine and coat all of the fruit evenly.In a separate bowl, combine the almond flour, tapioca flour, rolled oats, and coconut sugar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'rolled oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nectarines.jpg', u'id': 9191, u'name': u'nectarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}], u'step': u'Add the coconut oil and using a pastry cutter, two forks, or your hands, work the coconut oil into the flour until it comes together into a course meal with no dry flour remaining. Toss in the sliced almonds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove the crust from the freezer and pour the fruit filling inside. Cover the fruit evenly with the oat topping and bake for 45-50 minutes, or until golden brown and bubbling. Check the pie halfway through and tent the top with foil if its browning too quickly.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool slightly before serving warm. Store leftovers in the refrigerator for up to 3 days.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Angel Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Preheat the oven to 350F.In a mixing bowl, combine the almond flour and sea salt. Add the melted coconut oil and egg and mix until the mixture completely comes together. Press the crust into a 9 pie plate, up and around the edges.In a small bowl, whisk the egg white slightly. Use a pastry brush to brush egg white on the bottom of the crust to prevent it from getting soggy. Place the crust in the freezer while preparing the filling and crumb topping.In a medium mixing bowl, combine the nectarines, blueberries, lemon zest, lemon juice, cinnamon, nutmeg, coconut sugar and tapioca flour. Stir to combine and coat all of the fruit evenly.In a separate bowl, combine the almond flour, tapioca flour, rolled oats, and coconut sugar. Add the coconut oil and using a pastry cutter, two forks, or your hands, work the coconut oil into the flour until it comes together into a course meal with no dry flour remaining. Toss in the sliced almonds.Remove the crust from the freezer and pour the fruit filling inside. Cover the fruit evenly with the oat topping and bake for 45-50 minutes, or until golden brown and bubbling. Check the pie halfway through and tent the top with foil if its browning too quickly.Let cool slightly before serving warm. Store leftovers in the refrigerator for up to 3 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-nectarine-pie-with-almond-crumble-gluten-free-+-refined-sugar-free-797890', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}