{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/840884-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 840884, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet and Sour Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 311.14, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds boneless chicken breast , cut into 1-inch pieces', u'aisle': u'Meat', u'name': u'boneless chicken breast', u'metaInformation': [u'boneless', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 5062, u'unit': u'pounds'}, {u'originalString': u'1/4 cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 green bell pepper , cut into 3/4-inch cubes (about 3/4 cup)', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'cut into 3/4-inch cubes ( 3/4 cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1/2 cup honey plus 2 teaspoons', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 teaspoons low sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'1 cup pineapple chunks canned, reserve juice for sauce', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'canned', u'for sauce'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'cup'}, {u'originalString': u'3 tablespoons pineapple juice , divided', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9273, u'unit': u'tablespoons'}, {u'originalString': u'1 red bell pepper , cut into 3/4-inch cubes (about 3/4 cup)', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into 3/4-inch cubes ( 3/4 cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'6 tablespoons rice vinegar Nakano Natural Rice Vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon Sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sesame seeds (optional)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'1 cup white onion , 3/4-inch dice', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u'cup'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.jessicagavin.com/sweet-and-sour-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium sized bowl whisk together honey, Nakano Natural Rice Vinegar, soy sauce, garlic powder, onion powder, tomato paste, and 1 tablespoon pineapple juice (from pineapple chunks). In a separate small bowl whisk together 1 tablespoon cornstarch and 2 tablespoons pineapple juice. Water can be substituted for pineapple juice if desired. In a small pot add sauce mixture, heat over medium-high heat. Once boiling, add the cornstarch mixture.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1029354, u'name': u'pineapple chunks'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'id': 9273, u'name': u'pineapple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk constantly until sauce thickens, about 30 seconds. Turn off heat and leave on stove top.To a large bowl add chicken, salt, pepper and 1/4 cup cornstarch, stir to coat the chicken.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a large saute pan or wok over medium-high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1 tablespoon vegetable oil and 1 teaspoon sesame oil. Once the oil is hot add the chicken in a single layer. Cook until light golden brown, about 4 minutes. Flip the chicken pieces to cook the other side, about 3 additional minutes or until no longer pink.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 teaspoon minced garlic, red and green bell peppers, and onions to the pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute until vegetables are crisp-tender, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add pineapple and saute for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sauce, stir to coat and cook another 2 minutes, or until sauce is warmed through.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve sweet and sour chicken over rice. Enjoy!', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sweet and Sour Chicken works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The L'Ecole 41 Chenin Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'In a medium sized bowl whisk together honey, Nakano Natural Rice Vinegar, soy sauce, garlic powder, onion powder, tomato paste, and 1 tablespoon pineapple juice (from pineapple chunks). In a separate small bowl whisk together 1 tablespoon cornstarch and 2 tablespoons pineapple juice. Water can be substituted for pineapple juice if desired. In a small pot add sauce mixture, heat over medium-high heat. Once boiling, add the cornstarch mixture. Whisk constantly until sauce thickens, about 30 seconds. Turn off heat and leave on stove top.To a large bowl add chicken, salt, pepper and 1/4 cup cornstarch, stir to coat the chicken.Heat a large saute pan or wok over medium-high heat. Add 1 tablespoon vegetable oil and 1 teaspoon sesame oil. Once the oil is hot add the chicken in a single layer. Cook until light golden brown, about 4 minutes. Flip the chicken pieces to cook the other side, about 3 additional minutes or until no longer pink. Add 1 teaspoon minced garlic, red and green bell peppers, and onions to the pan. Saute until vegetables are crisp-tender, about 2 minutes. Add pineapple and saute for 1 minute. Add the sauce, stir to coat and cook another 2 minutes, or until sauce is warmed through.Serve sweet and sour chicken over rice. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-sour-chicken-840884', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}