{u'recipes': [{u'sourceName': u'Just a Taste', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615510-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 17, u'id': 615510, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Salted Caramel Apple Tart', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 68.98, u'creditText': u'Just a Taste', u'extendedIngredients': [{u'originalString': u'3 Tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup homemade or store-bought caramel sauce', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'homemade', u'store-bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19364, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 small Granny Smith apples', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'2 Tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tablespoons'}, {u'originalString': u'1 sheet (half of a 17.3-ounce package) puff pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thawed', u'(half of a 17.3-ounce package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.justataste.com/2014/10/easy-salted-caramel-apple-tart-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425F. Line a baking sheet with parchment paper or a Silpat.Slice the apples into thin (about 1/4-inch) pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place them in a large bowl then add the lemon juice, vanilla extract and brown sugar to the bowl, tossing to thoroughly combine. Set aside.Unfold the sheet of puff pastry onto the lined baking sheet. Lightly score the dough by cutting a border 1 inch from the edges (do not cut through the pastry). Prick the pastry all over with a fork. Arrange the apple slices on the puff pastry inside the border area.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the egg with 1 Tablespoon water.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Brush the edges of the pastry with the eggwash then bake the tart for 15 to 17 minutes until golden and puffed.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the tart from the oven oven, drizzle it with caramel sauce and sprinkle it with sea salt. Slice and serve immediately.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 817, u'instructions': u'Preheat the oven to 425F. Line a baking sheet with parchment paper or a Silpat.Slice the apples into thin (about 1/4-inch) pieces. Place them in a large bowl then add the lemon juice, vanilla extract and brown sugar to the bowl, tossing to thoroughly combine. Set aside.Unfold the sheet of puff pastry onto the lined baking sheet. Lightly score the dough by cutting a border 1 inch from the edges (do not cut through the pastry). Prick the pastry all over with a fork. Arrange the apple slices on the puff pastry inside the border area. Whisk together the egg with 1 Tablespoon water. Brush the edges of the pastry with the eggwash then bake the tart for 15 to 17 minutes until golden and puffed.Remove the tart from the oven oven, drizzle it with caramel sauce and sprinkle it with sea salt. Slice and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-salted-caramel-apple-tart-615510', u'dishTypes': [u'dessert'], u'occasions': [u'halloween'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}