{u'recipes': [{u'sourceName': u'Foodess', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/608650-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 608650, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cherry-Merlot Winesicles + Orchard Sangria', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 101.44, u'creditText': u'Foodess', u'extendedIngredients': [{u'originalString': u'2 oz E&J Brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'oz'}, {u'originalString': u'1 \xbd cups fresh cherries, pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'fresh', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9070, u'unit': u'cups'}, {u'originalString': u'\xbd cup ginger beer', u'aisle': u'Beverages', u'name': u'ginger beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10014136, u'unit': u'cup'}, {u'originalString': u'1 cup Ecco Domani Merlot', u'aisle': u'Alcoholic Beverages', u'name': u'merlot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14602, u'unit': u'cup'}, {u'originalString': u'1 ripe peach, pitted and thinly sliced', u'aisle': u'Produce', u'name': u'peach', u'metaInformation': [u'pitted', u'ripe', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1 ripe plum, pitted and thinly sliced', u'aisle': u'Produce', u'name': u'plum', u'metaInformation': [u'pitted', u'ripe', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9279, u'unit': u''}, {u'originalString': u'6 oz simple syrup', u'aisle': u'Alcoholic Beverages', u'name': u'simple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 90480, u'unit': u'oz'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://foodess.com/2014/08/cherry-merlot-winesicles-orchard-sangria/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-molds.jpg', u'id': 405929, u'name': u'popsicle molds'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine merlot, cherries and simple syrup in blender and blend until completely smooth, about 30 seconds on high speed. Divide between 9 popsicle molds. Insert sticks and freeze completely, about 6 hours. Run molds under hot water to release winesicles and serve immediately.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14602, u'name': u'merlot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'Combine peach, plum, merlot, brandy and simple syrup in a large spouted measuring cup or pitcher; let stand at least 15 minutes (or up to 12 hours). Divide between two ice-filled glasses and top up with ginger beer.*To make simple syrup, heat \xbd cup granulated sugar with \xbd cup water until sugar is completely dissolved. Store extra syrup in a sealed container in the fridge.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 10014136, u'name': u'ginger beer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14602, u'name': u'merlot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 739, u'instructions': u'Combine merlot, cherries and simple syrup in blender and blend until completely smooth, about 30 seconds on high speed. Divide between 9 popsicle molds. Insert sticks and freeze completely, about 6 hours. Run molds under hot water to release winesicles and serve immediately.Combine peach, plum, merlot, brandy and simple syrup in a large spouted measuring cup or pitcher; let stand at least 15 minutes (or up to 12 hours). Divide between two ice-filled glasses and top up with ginger beer.*To make simple syrup, heat \xbd cup granulated sugar with \xbd cup water until sugar is completely dissolved. Store extra syrup in a sealed container in the fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-merlot-winesicles-+-orchard-sangria-608650', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 9, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}