{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/748460-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 748460, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brown Butter-Sauteed Tilapia with Pistachios', u'diets': [u'pescatarian'], u'preparationMinutes': 3, u'pricePerServing': 367.93, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'4 thin slices lemon, for garnish', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'for garnish', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'slices'}, {u'originalString': u'1 tablespoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon canola or peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons roasted, salted shelled pistachios, roughly chopped', u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [u'salted', u'shelled', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 (3-ounce) tilapia fillets', u'aisle': u'Seafood', u'name': u'tilapia fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 15261, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 18.0, u'imageType': u'jpeg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/aida-mollenkamp/brown-butter-sauteed-tilapia-with-pistachios-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Place flour in a shallow dish or resealable plastic bag and season with salt and pepper. Dredge fillets in flour mixture or add to bag, close, and shake to coat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place 1 tablespoon of the butter and oil in a large frying pan over medium heat. When it foams, lower heat to medium-low. Shake excess flour off 2 of the fillets, add to pan, and cook until golden brown and crisp, about 2 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Remove fillets to a plate and repeat with remaining fillets.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add remaining 1 tablespoon butter and cook until it begins to brown. Immediately remove from heat, stir in lemon juice, and pour over fish. Lay a lemon slice over each fillet, sprinkle pistachios over top and serve with mashed or roasted potatoes and a simple green salad.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Luna Nuda Pinot Grigio. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste. View More', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Place flour in a shallow dish or resealable plastic bag and season with salt and pepper. Dredge fillets in flour mixture or add to bag, close, and shake to coat.                          Place 1 tablespoon of the butter and oil in a large frying pan over medium heat. When it foams, lower heat to medium-low. Shake excess flour off 2 of the fillets, add to pan, and cook until golden brown and crisp, about 2 minutes per side. Remove fillets to a plate and repeat with remaining fillets.                          Add remaining 1 tablespoon butter and cook until it begins to brown. Immediately remove from heat, stir in lemon juice, and pour over fish. Lay a lemon slice over each fillet, sprinkle pistachios over top and serve with mashed or roasted potatoes and a simple green salad.', u'spoonacularSourceUrl': u'https://spoonacular.com/brown-butter-sauteed-tilapia-with-pistachios-748460', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 11, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}