{u'recipes': [{u'sourceName': u'Merry Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587457-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 587457, u'veryPopular': False, u'lowFodmap': True, u'title': u'Candied Pecans', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 397.05, u'creditText': u'Merry Gourmet', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 egg white, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/8 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.125, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'12 ounces pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 12142, u'unit': u'ounces'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.merrygourmet.com/2011/10/getting-my-feet-wet-with-candied-pecans/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 300 degrees. Line a half-sheet pan with non-stick aluminum foil and set aside.In a small bowl, mix sugar, cayenne pepper, and salt;  set aside. In a second, larger bowl, whisk the egg white until frothy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the pecans to the egg white and stir to coat well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Drizzle maple syrup over pecans and combine until all pecan halves are coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Add sugar mixture to pecans and toss until well combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread pecans on prepared baking sheet.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 30 minutes, then remove from oven and let cool completely. Store in an air-tight covered jar.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Perrier-Jouet Belle Epoque with a 4.4 out of 5 star rating seems like a good match. It costs about 129 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'The 1996 vintage was superb for the Champagne region, yielding ripe, balanced, clean fruit with excellent flavors. A blend of approximately half Chardonnay and half Pinot Noir this crystal bright, light-bodied Champagne is elegant and distinctive. Opening with aromas of fresh pineapple, lemon and white florals, warming into complex scents of pear. A rich bouquet of white fruits end in subtle notes of honey and vanilla. The bead is intense with brisk effervescence, swirling up into a generous and persistent mousse. It is a balanced, extremely refined wine that, if properly stored, should keep for years, especially if bottled in magnums or jeroboams.Beyond the toasts and ship launchings, Champagne has a place at every dinner table. The 1996 Fleur de Champagne pairs is the perfect wine to serve with smoked oysters, game hens, delicate Japanese fish dishes, Fettuccini Alfredo or risotto. After a patient search for a master glassmaker capable of reproducing a bottle with the 1902 Gall\xe9 design, Perrier Jou\xebt launched in 1969, its famous "flower bottle" with an arabesque design of anemones. The first bottles of Fleur de Champagne revealed a Champagne of vivacious delicacy, the epitome of the refined and engaging style of the Art Nouveau movement. Since then, it has been the signature Champagne of Perrier Jou\xebt and is considered one of the world\'s most celebrated Champagnes.', u'title': u'Perrier-Jouet Belle Epoque', u'price': u'$129.0', u'id': 433586, u'link': u'https://www.wine.com/product/perrier-jouet-belle-epoque-1996/7383', u'imageUrl': u'https://spoonacular.com/productImages/433586-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Preheat oven to 300 degrees. Line a half-sheet pan with non-stick aluminum foil and set aside.In a small bowl, mix sugar, cayenne pepper, and salt;  set aside. In a second, larger bowl, whisk the egg white until frothy. Add the pecans to the egg white and stir to coat well. Drizzle maple syrup over pecans and combine until all pecan halves are coated. Add sugar mixture to pecans and toss until well combined.Spread pecans on prepared baking sheet. Bake for 30 minutes, then remove from oven and let cool completely. Store in an air-tight covered jar.', u'spoonacularSourceUrl': u'https://spoonacular.com/candied-pecans-587457', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}