{u'recipes': [{u'sourceName': u'The Vintage Mixer', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/509057-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 509057, u'veryPopular': False, u'lowFodmap': False, u'title': u'Israeli Couscous with Pesto and Spring Vegetables', u'diets': [], u'pricePerServing': 258.37, u'creditText': u'The Vintage Mixer', u'extendedIngredients': [{u'originalString': u'1/2 cup broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011090, u'unit': u'cup'}, {u'originalString': u'1 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 cup Israeli Couscous', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'israeli couscous', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-israeli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020028, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons of Parmesan Cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup English peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'3-4 tablespoons of pesto, or 2 ice cube squares of frozen pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoons'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'handful of watercress', u'aisle': u'Produce', u'name': u'watercress', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11591, u'unit': u'handful'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.thevintagemixer.com/2012/04/israeli-couscous-recipe-with-pesto-and-spring-vegetables/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, heat 1 tablespoon of olive oil on medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the couscous and cook, stirring occasionally until slightly browned and aromatic, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}]}, {u'equipment': [], u'step': u'Add the water and chicken broth and bring to a boil. Turn the heat down and simmer the couscous for 10 to 12 minutes or until most the liquid has evaporated and the couscous is tender.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the cooked couscous to a large bowl and toss with 3-4 tablespoons of pesto. While couscous is cooking remove peas from their shells and chop one small bunch of broccoli. Steam the broccoli and peas for about 5 minutes.  Season with salt and pepper.  In a shallow bowl layer couscous, watercress, then green vegetables.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'id': 11591, u'name': u'watercress'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Drizzle with olive oil and top with Parmesan Cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'aggregateLikes': 101, u'instructions': u'In a medium saucepan, heat 1 tablespoon of olive oil on medium-high heat. Add the couscous and cook, stirring occasionally until slightly browned and aromatic, about 3 minutes. Add the water and chicken broth and bring to a boil. Turn the heat down and simmer the couscous for 10 to 12 minutes or until most the liquid has evaporated and the couscous is tender. Transfer the cooked couscous to a large bowl and toss with 3-4 tablespoons of pesto. While couscous is cooking remove peas from their shells and chop one small bunch of broccoli. Steam the broccoli and peas for about 5 minutes.  Season with salt and pepper.  In a shallow bowl layer couscous, watercress, then green vegetables.  Drizzle with olive oil and top with Parmesan Cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/israeli-couscous-with-pesto-and-spring-vegetables-509057', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}