{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/808663-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 808663, u'veryPopular': True, u'lowFodmap': False, u'title': u'Loaded Smashed Potatoes', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 162.26, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'1 stick butter, melted + 2 tablespoons cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'1 teaspoon coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'cloves from about 2 bulbs of roasted garlic', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbe cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1\xbd teaspoons freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoons'}, {u'originalString': u'5 pounds red potatoes, scrubbed', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 5.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'pounds'}, {u'originalString': u'8 ounces cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'\xbd cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'8 slices thick-cut bacon, crumbled', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'thick-cut', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10310123, u'unit': u'slices'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://addapinch.com/cooking/loaded-smashed-potatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place potatoes into large saucepan and add enough water to cover, plus about 1 inch. Cook over medium-low heat until fork tender, about 15-20 minutes.In a medium saucepan, melt butter, add half and half and roasted garlic.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-roasted.jpg', u'id': 11215, u'name': u'roasted garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Heat until simmering.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Drain potatoes and pour potatoes back into saucepan used to cook them. Smash potatoes over low heat until chunks of potatoes remain, but the majority of the potatoes are smooth.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the melted butter and half and half mixture to potatoes. Continue to mash the potatoes to incorporate the half and half mixture. Then, mix in garlic, sour cream, bacon crumbles, and cheddar cheese with a spoon until well-combined. Stir in salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour potatoes into a serving bowl for serving.Make-Ahead Tip: Prepare mashed potatoes and pour into a casserole dish. Cover tightly with aluminum foil or a lid and refrigerate until about 20 minutes before ready to serve. Then, place in a preheated oven at 350 F for 20 minutes.When you remove from the oven, top with remaining 2 tablespoons of butter and a sprinkle of salt and pepper, if desired.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 15332, u'instructions': u'Place potatoes into large saucepan and add enough water to cover, plus about 1 inch. Cook over medium-low heat until fork tender, about 15-20 minutes.In a medium saucepan, melt butter, add half and half and roasted garlic. Heat until simmering.Drain potatoes and pour potatoes back into saucepan used to cook them. Smash potatoes over low heat until chunks of potatoes remain, but the majority of the potatoes are smooth. Add the melted butter and half and half mixture to potatoes. Continue to mash the potatoes to incorporate the half and half mixture. Then, mix in garlic, sour cream, bacon crumbles, and cheddar cheese with a spoon until well-combined. Stir in salt and pepper.Pour potatoes into a serving bowl for serving.Make-Ahead Tip: Prepare mashed potatoes and pour into a casserole dish. Cover tightly with aluminum foil or a lid and refrigerate until about 20 minutes before ready to serve. Then, place in a preheated oven at 350 F for 20 minutes.When you remove from the oven, top with remaining 2 tablespoons of butter and a sprinkle of salt and pepper, if desired.Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/loaded-smashed-potatoes-808663', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}