{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/534203-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 534203, u'veryPopular': True, u'lowFodmap': False, u'title': u'No-Bake Samoa Cookies', u'diets': [u'gluten free'], u'pricePerServing': 40.53, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'1 tsp butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tsp'}, {u'originalString': u'1 (3.4 oz) box instant butterscotch pudding', u'aisle': u'Sweet Snacks', u'name': u'butterscotch pudding', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butterscotch-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'liquid', u'id': 19201, u'unit': u'oz'}, {u'originalString': u'1/2 cup chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'2/3 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 1/2 cups quick cooking oats', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 8402, u'unit': u'cups'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 cup sweetened shredded coconut', u'aisle': u'Baking', u'name': u'sweetened shredded coconut', u'metaInformation': [u'shredded', u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12179, u'unit': u'cup'}, {u'originalString': u'1 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.thereciperebel.com/no-bake-samoa-cookies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place coconut in a small, dry pan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Heat over medium heat, stirring occasionally (stir more frequently towards the end), until coconut is light golden brown. Set aside.In a small bowl, melt together chocolate and margarine. I microwaved mine at 50% power for 25 seconds. If it's too thick, add a tiny bit of milk.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Pour chocolate into a Ziploc bag to use for drizzle later.In a large pot, bring sugar, butter and milk to a boil. Boil for 2 minutes.Turn off the heat and add in the pudding mix, oats, coconut and vanilla. Scoop onto wax-paper lined cookie sheets. Snip a tiny piece of the bag's corner and drizzle with melted chocolate. Sprinkle with toasted coconut.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'aggregateLikes': 1368, u'instructions': u"Place coconut in a small, dry pan. Heat over medium heat, stirring occasionally (stir more frequently towards the end), until coconut is light golden brown. Set aside.In a small bowl, melt together chocolate and margarine. I microwaved mine at 50% power for 25 seconds. If it's too thick, add a tiny bit of milk. Pour chocolate into a Ziploc bag to use for drizzle later.In a large pot, bring sugar, butter and milk to a boil. Boil for 2 minutes.Turn off the heat and add in the pudding mix, oats, coconut and vanilla. Scoop onto wax-paper lined cookie sheets. Snip a tiny piece of the bag's corner and drizzle with melted chocolate. Sprinkle with toasted coconut.", u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-samoa-cookies-534203', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}