{u'recipes': [{u'sourceName': u'What Jew Wanna Eat', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/481034-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 481034, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vegan Israeli Pizza', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 35, u'pricePerServing': 195.07, u'creditText': u'What Jew Wanna Eat', u'extendedIngredients': [{u'originalString': u'\xbd large avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'Cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2031, u'unit': u'servings'}, {u'originalString': u'1 small eggplant, cut into \xbc inch slices', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'small', u'cut into \xbc inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'Dough for 1 pizza', u'aisle': u'Refrigerated;Frozen', u'name': u'filo dough', u'metaInformation': [u'for 1 pizza'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18338, u'unit': u'servings'}, {u'originalString': u'1 cup hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'cup'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large white onion, sliced thin', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'large', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://whatjewwannaeat.com/vegan-israeli-pizza/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'First up, pre-heat your oven to 400 degrees F. Slice eggplant into thin slices, drizzle with olive oil and sprinkle with salt and roast for 20 minutes, flipping half way. Once cooked, increase oven to 450 degrees F.While your eggplant is cooking, slice your onion into thin slices and saute in olive oil and a sprinkle of salt on low heat until caramelized. Low and slow- this will take about 30 minutes.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add a bit of agave nectar or honey (not vegan!) to up the sweetness at the end. Don't skip the salt as this helps extract moisture from the onions!Now let's build the pizza! If you made dough, stretch it onto a pizza pan and top with hummus.Then top with caramelized onions and eggplant.To cut your avocado, slice it in half and remove the pit. Then cut long slivers of avocado while this skin is still on.Then scoop the whole half out with a large spoon and separate the slices.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10211282, u'name': u'caramelized onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add them to your pizza!Sprinkle with cayenne pepper and bake for 20 minutes or until crust is golden brown.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}]}, {u'equipment': [], u'step': u'Drizzle finished pizza with olive oil or balsamic if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Hills Vineyard Rosato di Sangiovese with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Our DRY ros\xe9 wine, made with Sangiovese grapes, is dry, yet fruity, and a perfect wine with our Texas foods, like Bar-B-Q and even hamburgers!! Taste raspberry, strawberry & cherry!', u'title': u'Hills Vineyard Rosato di Sangiovese', u'price': u'$14.95', u'id': 430938, u'link': u'https://www.amazon.com/Texas-Hills-Vineyard-Rosato-Sangiovese/dp/B00CHCHU8E', u'imageUrl': u'https://spoonacular.com/productImages/430938-312x231.jpg'}]}, u'aggregateLikes': 1678, u'instructions': u"First up, pre-heat your oven to 400 degrees F. Slice eggplant into thin slices, drizzle with olive oil and sprinkle with salt and roast for 20 minutes, flipping half way. Once cooked, increase oven to 450 degrees F.While your eggplant is cooking, slice your onion into thin slices and saute in olive oil and a sprinkle of salt on low heat until caramelized. Low and slow- this will take about 30 minutes. Add a bit of agave nectar or honey (not vegan!) to up the sweetness at the end. Don't skip the salt as this helps extract moisture from the onions!Now let's build the pizza! If you made dough, stretch it onto a pizza pan and top with hummus.Then top with caramelized onions and eggplant.To cut your avocado, slice it in half and remove the pit. Then cut long slivers of avocado while this skin is still on.Then scoop the whole half out with a large spoon and separate the slices. Add them to your pizza!Sprinkle with cayenne pepper and bake for 20 minutes or until crust is golden brown.Drizzle finished pizza with olive oil or balsamic if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-israeli-pizza-481034', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}