{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537720-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 537720, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Braised Eggplant and Tofu', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 60, u'pricePerServing': 413.09, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'2 Tablespoons chili paste', u'aisle': u'Ethnic Foods', u'name': u'chili paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6973, u'unit': u'Tablespoons'}, {u'originalString': u'1 large eggplant or 2-3 smaller eggplants, salted and pressed', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'salted', u'large', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'1 pound extra firm tofu, pressed and cubed', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'firm', u'cubed', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'pound'}, {u'originalString': u'1 Tablespoon garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'Tablespoon'}, {u'originalString': u'1 Tablespoon ginger, minced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'Tablespoon'}, {u'originalString': u'6 Tablespoons peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 Teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'Teaspoon'}, {u'originalString': u'1 Tablespoon sesame oil (optional)', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'Tablespoon'}, {u'originalString': u'1 Tablespoon toasted sesame seeds (optional)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'Tablespoon'}, {u'originalString': u'1 cup shiitake mushrooms (I actually used baby bellas)', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [u'(I actually used baby bellas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11238, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tablespoons'}, {u'originalString': u'2/3 cup stock or water', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.macheesmo.com/2009/08/spicy-braised-eggplant-and-tofu/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Let this sit for about 30 minutes, stir the eggplant, re-apply the weight, and let it sit for 30 more minutes.4) After you salt the eggplant, rinse it off and dry it.5) Meanwhile, press out some of the liquid in the tofu. Slice the large block of tofu down the middle, horizontally. Then lay the halves between two layers of paper towels. Use 4 or 5 paper towels on top and bottom of the tofu. Then set a cutting board on top of the tofu and set something heavy on the cutting board, like a bottle of oil.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Let this press for at least 30 minutes, but an hour wouldnt hurt. Change the paper towels at least once.6) Chop the mushrooms, scallions, garlic, and ginger. Get all the spices ready.7) Start out by heating half of the oil in a large saut pan (or a wok). Get the oil very hot over high heat.8)', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the mushrooms first with a pinch of salt. Cook them for about 5 minutes until the turn slightly crispy.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Remove them from the oil with a slotted spoon.9)', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rest of the oil along with the garlic and ginger. Stir together for just a few seconds.10)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the eggplant, chili sauce, red pepper flakes, and water or stock. Stir everything together and let it simmer for about 5-10 minutes.11)', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add in the tofu (cubed) along with the soy sauce. Cook this for about 5 or 10 minutes.12) Cook the noodles according to directions on the package. Once they are cooked, rinse them with cold water to stop the cooking.13)', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add noodles right into the pan with eggplant and tofu and stir everything together.14) Piled it high in a bowl and top it with chopped scallions!', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 28, u'instructions': u'Directions1) Prep the eggplant. If you use Japanese eggplant, which are much smaller than the large version, you can just cube them up. But if you want to use the larger version, youll want to salt and press them to remove some of the bitter liquid. Cube the eggplant into about 2 inch cubes (skin on is fine). Then coat all the cubes liberally in salt. I probably used about 4 Tablespoons of kosher salt.2) Set all the eggplant in a colander over a bowl and weigh it down with an extra bowl filled with water. 3) Let this sit for about 30 minutes, stir the eggplant, re-apply the weight, and let it sit for 30 more minutes.4) After you salt the eggplant, rinse it off and dry it.5) Meanwhile, press out some of the liquid in the tofu. Slice the large block of tofu down the middle, horizontally. Then lay the halves between two layers of paper towels. Use 4 or 5 paper towels on top and bottom of the tofu. Then set a cutting board on top of the tofu and set something heavy on the cutting board, like a bottle of oil. Let this press for at least 30 minutes, but an hour wouldnt hurt. Change the paper towels at least once.6) Chop the mushrooms, scallions, garlic, and ginger. Get all the spices ready.7) Start out by heating half of the oil in a large saut pan (or a wok). Get the oil very hot over high heat.8) Add the mushrooms first with a pinch of salt. Cook them for about 5 minutes until the turn slightly crispy. Remove them from the oil with a slotted spoon.9) Add the rest of the oil along with the garlic and ginger. Stir together for just a few seconds.10) Add the eggplant, chili sauce, red pepper flakes, and water or stock. Stir everything together and let it simmer for about 5-10 minutes.11) Add in the tofu (cubed) along with the soy sauce. Cook this for about 5 or 10 minutes.12) Cook the noodles according to directions on the package. Once they are cooked, rinse them with cold water to stop the cooking.13) Add noodles right into the pan with eggplant and tofu and stir everything together.14) Piled it high in a bowl and top it with chopped scallions!', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-braised-eggplant-and-tofu-537720', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}