{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/543624-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 543624, u'veryPopular': False, u'lowFodmap': False, u'title': u'Light Fettuccine Alfredo', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 123.47, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'freshly ground white or black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'white', u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 1/2 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 Tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'chopped fresh parsley for garnish, optional', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1/8 - 1/4 tsp garlic powder, to taste', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'1 1/4 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 oz Neufchatel cheese (aka 1/3 less fat cream cheese), diced into cubes', u'aisle': u'Cheese', u'name': u'neufchatel cheese', u'metaInformation': [u'diced', u'(aka 1/3 less fat cream cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/neufchatel.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1031, u'unit': u'oz'}, {u'originalString': u'8 oz. fettuccine pasta, uncooked', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'oz'}, {u'originalString': u'finely shredded Romano cheese for serving, optional (not added to calorie count)', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [u'shredded', u'for serving, optional (not added to calorie count)', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1038, u'unit': u'servings'}, {u'originalString': u'1/2 tsp salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 1/2 oz. freshly, finely shredded Parmesan cheese (1/4 cup + 2 Tbsp slightly packed)', u'aisle': u'?', u'name': u'freshly', u'metaInformation': [u'shredded', u'packed', u'finely', u'(1/4 cup + 2 Tbsp slightly )'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'unit': u'oz'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.cookingclassy.com/2012/12/light-fettuccine-alfredo/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Drain cooked pasta well (DO NOT rinse pasta with water or the pasta sauce wont stick) then pour drained pasta into sauce and toss to evenly coat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately garnished with ground pepper, optional parsley and Romano cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'romano cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 228, u'instructions': u'Directions:Cook pasta according to directions listed on package. Meanwhile, in a medium saucepan melt butter over medium heat. Once fully melted mix in flour and cook, whisking constantly for 2 minutes. Gradually add in a little milk at time, whisking vigorously until smooth after each addition. Stir in cream, lemon juice, salt and garlic powder. While stirring constantly to prevent lumps from forming, cook sauce until mixture thickens and begins to gently bubble.Reduce heat to low, add in Parmesan cheese and Neufchatel cheese and stir until cheese has melted. Stir in a few tbsp pasta water to thin sauce if desired. Drain cooked pasta well (DO NOT rinse pasta with water or the pasta sauce wont stick) then pour drained pasta into sauce and toss to evenly coat. Serve immediately garnished with ground pepper, optional parsley and Romano cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/light-fettuccine-alfredo-543624', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}