{u'recipes': [{u'sourceName': u'Premeditated Left Over', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/531256-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 531256, u'veryPopular': False, u'lowFodmap': False, u'title': u'Garlic and Rosemary Red Potatoes', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 44.43, u'creditText': u'Premeditated Left Over', u'extendedIngredients': [{u'originalString': u'1 teaspoon basil', u'aisle': u'Produce', u'name': u'basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'teaspoon'}, {u'originalString': u'8 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'6 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon parsley', u'aisle': u'Produce', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'\xbc teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2\xbd - 3 pounds red potatoes, washed and quartered', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'washed and quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 10011355, u'unit': u'pounds'}, {u'originalString': u'1\xbd teaspoon rosemary, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://premeditatedleftovers.com/recipes-cooking-tips/garlic-and-rosemary-red-potatoes/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Place quartered potatoes in a pot of water. Cook over a medium-high flame until it comes to a boil.Lower the flame slightly so it doesn't boil over and keep at a low rolling boil until the potatoes are fork tender, approximately 12 - 15 minutes.", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drain the potatoes.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add oil, onion, and garlic to pot.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Saute over a medium flame for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add potatoes and spices. Toss until thoroughly coated and cook over a medium-high flame for another 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u"Place quartered potatoes in a pot of water. Cook over a medium-high flame until it comes to a boil.Lower the flame slightly so it doesn't boil over and keep at a low rolling boil until the potatoes are fork tender, approximately 12 - 15 minutes.Drain the potatoes.Add oil, onion, and garlic to pot. Saute over a medium flame for 2 minutes.Add potatoes and spices. Toss until thoroughly coated and cook over a medium-high flame for another 3 minutes.", u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-and-rosemary-red-potatoes-531256', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}