{u'recipes': [{u'sourceName': u'Skinny Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/472526-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 472526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brown Sugar Ice Cream', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 184.99, u'creditText': u'Skinny Chef', u'extendedIngredients': [{u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup cooked short grain brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked short grain brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020041, u'unit': u'cup'}, {u'originalString': u'2 tablespoons golden flax meal', u'aisle': u'Health Foods;Baking', u'name': u'flax meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 cup reduced fat plain yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain reduced fat yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1117, u'unit': u'cup'}, {u'originalString': u'1 cup non-fat, skim milk', u'aisle': u'Meat', u'name': u'duck fat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lard.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4574, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 33.0, u'sourceUrl': u'http://skinnychef.com/recipes/brown-sugar-ice-cream', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend all ingredients in a blender or food processor until the rice begins to break apart.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into an air-tight, freezable container.  Freeze for 3 to 4 hours or until firm.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 155, u'instructions': u'Blend all ingredients in a blender or food processor until the rice begins to break apart.  Pour into an air-tight, freezable container.  Freeze for 3 to 4 hours or until firm.', u'spoonacularSourceUrl': u'https://spoonacular.com/brown-sugar-ice-cream-472526', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}