{u'recipes': [{u'sourceName': u'The Law Students Wife', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/487979-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 487979, u'veryPopular': True, u'lowFodmap': False, u'title': u'Healthy Corn Chowder', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 242.71, u'creditText': u'The Law Students Wife', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon dried rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'32 ounces frozen corn, thawed', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 11913, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup plain Greek yogurt (non-fat, 2% or whole, depending upon your preference)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'plain', u'whole', u'2%', u'(non-fat, or , depending upon your preference)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon ground cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 red bell pepper, cored and chopped (about 1 1/2 cups)', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cored', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cups'}, {u'originalString': u'1 boneless, skinless chicken breast, cooked and shredded (approximately 8 ounces)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'shredded', u'boneless', u'skinless', u'cooked', u'(approximately 8 ounces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'3 cups low-sodium chicken or vegetable stock, divided.', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'low-sodium', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 cup chopped yellow onion (about 1/2 large onion)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'chopped', u'( 1/2 onion)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.thelawstudentswife.com/2013/12/healthy-corn-chowder/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the chicken breast on a baking sheet lined with parchment paper, rub with olive oil, sprinkle with salt and pepper, then roast in a 350 degree oven for 18-20 minutes until the internal temperature reaches 165 degrees.) When cool enough to handle, shred and set aside.In a large pot or Dutch oven, heat olive oil over medium. Saut\xe9 onion until beginning to soften, about 5 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, salt, and pepper and cook 1 minute more.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add corn and cook 3 minutes, until lightly saut\xe9ed.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add 2 cups chicken stock, stir to incorporate, then transfer half of the mixture to a blender or food processor. Puree, leaving the chowder fairly chunky. Repeat with second half.Stir in the remaining 1 cup chicken stock, bell pepper, rosemary, cayenne, Greek yogurt, and chicken.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}]}, {u'equipment': [], u'step': u'Heat through.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm with additional Greek yogurt, as desired.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}]}], u'name': u'Cook and shred chicken breast, if not already complete. (My preferred method is oven roasting'}], u'aggregateLikes': 2004, u'instructions': u'Cook and shred chicken breast, if not already complete. (My preferred method is oven roasting: Place the chicken breast on a baking sheet lined with parchment paper, rub with olive oil, sprinkle with salt and pepper, then roast in a 350 degree oven for 18-20 minutes until the internal temperature reaches 165 degrees.) When cool enough to handle, shred and set aside.In a large pot or Dutch oven, heat olive oil over medium. Saut\xe9 onion until beginning to soften, about 5 minutes. Add garlic, salt, and pepper and cook 1 minute more. Add corn and cook 3 minutes, until lightly saut\xe9ed. Add 2 cups chicken stock, stir to incorporate, then transfer half of the mixture to a blender or food processor. Puree, leaving the chowder fairly chunky. Repeat with second half.Stir in the remaining 1 cup chicken stock, bell pepper, rosemary, cayenne, Greek yogurt, and chicken. Heat through. Serve warm with additional Greek yogurt, as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-corn-chowder-487979', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}