{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/774794-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 774794, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Radicchio, Bell Pepper + Olive Panzanella', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 35, u'pricePerServing': 489.5, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'1 large orange bell pepper', u'aisle': u'Produce', u'name': u'orange bell pepper', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'1 pinch black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 pound campari tomatoes, quartered', u'aisle': u'Alcoholic Beverages', u'name': u'campari', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93788, u'unit': u'pound'}, {u'originalString': u'1 (20 ounce) loaf of ciabatta bread, torn into bite-size chunks', u'aisle': u'Bakery/Bread', u'name': u'ciabatta bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 93655, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons STAR Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'STAR Extra Light Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'1 handful fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'handful'}, {u'originalString': u'\xbd clove of garlic, grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 (5.3 ounce) jar (or about 1 cup) STAR Ready-To-Eat pitted ripe black olives, halved', u'aisle': u'Canned and Jarred', u'name': u'olives', u'metaInformation': [u'black', u'pitted', u'ripe', u'halved', u'(or 1 cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.3, u'consistency': u'solid', u'id': 9195, u'unit': u'ounce'}, {u'originalString': u'\xbd cup pine nuts, pan toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'2 heads of radicchio, quartered keeping the stem in tact', u'aisle': u'Produce', u'name': u'radicchio', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'unitLong': u'heads', u'unitShort': u'heads', u'amount': 2.0, u'consistency': u'solid', u'id': 11952, u'unit': u'heads'}, {u'originalString': u'1 pinch sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinch'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.simplyscratch.com/2016/06/grilled-radicchio-bell-pepper-olive-panzanella.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place tomatoes into a fine mesh strainer set into a medium bowl. Toss with 1 teaspoon kosher salt and set off to the side. The salt will draw out the juice from the tomatoes and collect in the bowl below.Lightly brush the bell pepper and all sides of the radicchio with extra light olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'light olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place radicchio onto grill that is preheated on medium heat. Grill for 2 to 3 minutes per side or until grill marks appear.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer grilled radicchio to a cutting board. Once cool cut off the root and chop into bite-size pieces', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Increase the heat of your grill to medium-high.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place bell pepper onto grates, close the lid and grill, turning so the entire outer skin is charred.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer the charred pepper to a small bowl, cover with plastic wrap and set off to the side for 10 minutes. Then remove the skin and seeds from the pepper and chop into bite-size pieces.Meanwhile preheat your oven to 400 degrees.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the torn pieces of bread onto 2 large, rimmed baking sheets.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with extra light olive oil.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'light olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake for 8 -10 minutes or until toasted and lightly golden brown. Set off to the side to cool.Once there is  cup of tomato juice collected in the bowl, transfer the tomatoes to a large bowl. To the tomato juice add in 1 teaspoon Dijon, 2 tablespoons red wine vinegar and the grated garlic.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk while slowly pouring in the 2 tablespoons of extra virgin olive oil. Season with a pinch of sugar, kosher salt and black pepper. Set off to the side. Dressing should make  cup.To the bowl with the tomatoes, add the black olives, bell pepper, chopped radicchio and ciabatta. Toss to combine. Tear the fresh basil leaves by hand and sprinkle over salad.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'id': 1059195, u'name': u'black olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'id': 93655, u'name': u'ciabatta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in the toasted pine nuts and drizzle in all of the dressing. Toss to combine and serve immediately.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Ricasoli Castello di Brolio Chianti Classico. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 46 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage.', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Place tomatoes into a fine mesh strainer set into a medium bowl. Toss with 1 teaspoon kosher salt and set off to the side. The salt will draw out the juice from the tomatoes and collect in the bowl below.Lightly brush the bell pepper and all sides of the radicchio with extra light olive oil. Place radicchio onto grill that is preheated on medium heat. Grill for 2 to 3 minutes per side or until grill marks appear. Transfer grilled radicchio to a cutting board. Once cool cut off the root and chop into bite-size piecesIncrease the heat of your grill to medium-high. Place bell pepper onto grates, close the lid and grill, turning so the entire outer skin is charred. Transfer the charred pepper to a small bowl, cover with plastic wrap and set off to the side for 10 minutes. Then remove the skin and seeds from the pepper and chop into bite-size pieces.Meanwhile preheat your oven to 400 degrees. Place the torn pieces of bread onto 2 large, rimmed baking sheets. Drizzle with extra light olive oil. Bake for 8 -10 minutes or until toasted and lightly golden brown. Set off to the side to cool.Once there is  cup of tomato juice collected in the bowl, transfer the tomatoes to a large bowl. To the tomato juice add in 1 teaspoon Dijon, 2 tablespoons red wine vinegar and the grated garlic. Whisk while slowly pouring in the 2 tablespoons of extra virgin olive oil. Season with a pinch of sugar, kosher salt and black pepper. Set off to the side. Dressing should make  cup.To the bowl with the tomatoes, add the black olives, bell pepper, chopped radicchio and ciabatta. Toss to combine. Tear the fresh basil leaves by hand and sprinkle over salad. Add in the toasted pine nuts and drizzle in all of the dressing. Toss to combine and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-radicchio-bell-pepper-+-olive-panzanella-774794', u'dishTypes': [], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}