{u'recipes': [{u'sourceName': u'Diethood', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/566215-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 566215, u'veryPopular': False, u'lowFodmap': False, u'title': u'No Bake Chocolate Cookies with Candied Fruit Slices', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 32.92, u'creditText': u'Diethood', u'extendedIngredients': [{u'originalString': u'2 sticks butter, melted (you might need a bit more or less butter - start with one melted stick and see if it needs more)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'with one melted stick and see if it needs more)', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'sticks'}, {u'originalString': u'1 bag (9.5 ounces) Candied Fruit Slices, chopped', u'aisle': u'Produce;Baking', u'name': u'candied fruit', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-fruit-cake-mix.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.5, u'consistency': u'solid', u'id': 98925, u'unit': u'ounces'}, {u'originalString': u'5 (1-oz.) unsweetened chocolate squares, melted', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'unsweetened', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 19081, u'unit': u'oz'}, {u'originalString': u'3 cups finely ground graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 18617, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://diethood.com/2012/12/20/chocolate-cookies-candied-fruit-slices/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine all ingredients, following the order above, in a large mixing bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Mix with a rubber spatula until thoroughly combined; you're looking for a homogenous mixture that holds together.Line your work area with aluminum foil and spread half of the chocolate mixture on top of the foil to about a 1/4-inch thickness.Holding onto the ends of the foil begin to roll the cookie dough into a log. Cover with foil.Do the same with the other half of the cookie dough.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [], u'step': u'Place the logs in the freezer over night.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let sit at room temperature for 20 to 30 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into 1/4-inch cookies and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 79, u'instructions': u"Combine all ingredients, following the order above, in a large mixing bowl. Mix with a rubber spatula until thoroughly combined; you're looking for a homogenous mixture that holds together.Line your work area with aluminum foil and spread half of the chocolate mixture on top of the foil to about a 1/4-inch thickness.Holding onto the ends of the foil begin to roll the cookie dough into a log. Cover with foil.Do the same with the other half of the cookie dough.Place the logs in the freezer over night. Let sit at room temperature for 20 to 30 minutes.Cut into 1/4-inch cookies and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-chocolate-cookies-with-candied-fruit-slices-566215', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 40, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}