{u'recipes': [{u'sourceName': u'Healthy Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587158-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 587158, u'veryPopular': True, u'lowFodmap': False, u'title': u'Smoked Tomato and Bacon Vinaigrette', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 18.97, u'creditText': u'Healthy Delicious', u'extendedIngredients': [{u'originalString': u'3 slices bacon, preferably Jones Dairy Farm Applewood Smoked Bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 tablespoons balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoons'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'6 plum tomatoes', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'4 tablespoons red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.healthy-delicious.com/2014/06/smoked-tomato-bacon-vinaigrette-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the bacon to a pan set over medium high heat. Cook, turning frequently, until crisp.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Let drain on a plate lined with a paper towel, then crumble.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shallot and garlic to the hot bacon grease and cook until crisp – 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the pan and let drain on paper towels.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Cut the tomatoes in half; remove the core and seeds. Grill over medium-high heat (about 500\xbaF) for 5 minutes, or until lightly charred.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the tomatoes, vinegars, water and paprika (if using) to a blender container. Blend on high until smooth – about 1 minute. With the motor running, drizzle in the olive oil.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Pour into a pint-sided jar or other storage container. Stir in the bacon, shallots, and onions.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1482, u'instructions': u'Add the bacon to a pan set over medium high heat. Cook, turning frequently, until crisp. Let drain on a plate lined with a paper towel, then crumble. Add the shallot and garlic to the hot bacon grease and cook until crisp – 1-2 minutes. Remove from the pan and let drain on paper towels.Cut the tomatoes in half; remove the core and seeds. Grill over medium-high heat (about 500\xbaF) for 5 minutes, or until lightly charred.Add the tomatoes, vinegars, water and paprika (if using) to a blender container. Blend on high until smooth – about 1 minute. With the motor running, drizzle in the olive oil. Pour into a pint-sided jar or other storage container. Stir in the bacon, shallots, and onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-tomato-and-bacon-vinaigrette-587158', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}