{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/763159-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 763159, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Hazelnut Smoothie with Bananas', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 4, u'pricePerServing': 104.85, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'1 frozen banana (\xbd cup)', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9040, u'unit': u'cup'}, {u'originalString': u'\xbd cup roasted unsalted hazelnuts', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12120, u'unit': u'cup'}, {u'originalString': u'1 cup ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cup'}, {u'originalString': u'4 teaspoons honey or maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'teaspoons'}, {u'originalString': u'1 cup milk (dairy, almond, cashew, soy, coconut)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(dairy, almond, cashew, soy, coconut)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon hazelnut extract', u'aisle': u'Baking', u'name': u'hazelnut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 12120, u'unit': u'teaspoon'}, {u'originalString': u'2 to 3 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.jessicagavin.com/chocolate-hazelnut-smoothie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add all ingredients into a blender. Blend until smooth, about 1 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add more liquid or ice to thin out or thicken the smoothie if needed. Enjoy!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 209, u'instructions': u'Add all ingredients into a blender. Blend until smooth, about 1 minutes. Add more liquid or ice to thin out or thicken the smoothie if needed. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-hazelnut-smoothie-with-bananas-763159', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}