{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/387950-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 387950, u'veryPopular': False, u'lowFodmap': False, u'title': u'Makeover Cheesecake Bars', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 46.45, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup cold butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'4 ounces fat-free cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1/4 cup egg substitute', u'aisle': u'Health Foods;Baking;Milk, Eggs, Other Dairy', u'name': u'egg substitute', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1226, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces reduced-fat cream cheese', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons brown sugar blend', u'aisle': u'Baking', u'name': u'splenda brown sugar blend', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 98842, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup ground walnuts', u'aisle': u'?', u'name': u'ground walnuts', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/makeover-cheesecake-bars', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine the flour, walnuts and brown sugar blend; cut in butter until crumbly. Set aside 2/3 cup for topping; press remaining crumb mixture into an 8-in. square baking dish coated with cooking spray.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 9-11 minutes or until lightly browned.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Meanwhile, in a small bowl, beat the cream cheeses, sugar and flour until light and fluffy. Beat in the egg substitute, milk, lemon juice and vanilla just until blended.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'id': 1226, u'name': u'egg substitute'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour over crust; sprinkle with reserved crumb mixture.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake for 12-15 minutes or until filling is set. Cool on a wire rack for 1 hour. Refrigerate for at least 2 hours.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into bars. Refrigerate leftovers.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u"Directions                                                                                In a small bowl, combine the flour, walnuts and brown sugar blend; cut in butter until crumbly. Set aside 2/3 cup for topping; press remaining crumb mixture into an 8-in. square baking dish coated with cooking spray. Bake at 350\xb0 for 9-11 minutes or until lightly browned.                                                                                           Meanwhile, in a small bowl, beat the cream cheeses, sugar and flour until light and fluffy. Beat in the egg substitute, milk, lemon juice and vanilla just until blended. Pour over crust; sprinkle with reserved crumb mixture.                                                                                           Bake for 12-15 minutes or until filling is set. Cool on a wire rack for 1 hour. Refrigerate for at least 2 hours. Cut into bars. Refrigerate leftovers.                                        Yield: 9 servings.                                                                                                     Editor's Note: This recipe was tested with Splenda brown sugar blend.                                                                                                Originally published as Makeover Cheesecake Bars in  Light & TastyFebruary/March 2008, p10                                                                                                                                                                                                        Nutritional Facts                                                                             1 bar equals 219 calories, 11 g fat (5 g saturated fat), 24 mg cholesterol, 191 mg sodium, 25 g carbohydrate, 1 g fiber, 6 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/makeover-cheesecake-bars-387950', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}