{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/758199-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758199, u'veryPopular': True, u'lowFodmap': False, u'title': u'Farmers’ Market Pizza', u'diets': [u'dairy free'], u'pricePerServing': 158.83, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 \xbd cups large broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10011090, u'unit': u'cups'}, {u'originalString': u'1 Tbs. capers, drained (optional)', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 2054, u'unit': u'Tbs'}, {u'originalString': u'2 cloves garlic, minced (2 tsp.)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'\xbc cup canola or grapeseed oil for tossing with vegetables', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [u'with vegetables', u'for tossing '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4517, u'unit': u'cup'}, {u'originalString': u'1 Tbs. canola or grapeseed oil, plus more for brushing grill grate', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [u'plus more for brushing grill grate'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'Tbs'}, {u'originalString': u'\xbc tsp. ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 small yellow or orange bell pepper, sliced into 3 wedges', u'aisle': u'Produce', u'name': u'orange bell pepper', u'metaInformation': [u'yellow', u'small', u'sliced into 3 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'2 Tbs. fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'Tbs'}, {u'originalString': u'1 Par-Baked Pizza Crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'3 plum tomatoes (\xbe lb.)', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 10411529, u'unit': u'lb'}, {u'originalString': u'1 small red bell pepper, sliced into 3 wedges', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'small', u'sliced into 3 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'\xbd red onion, sliced into thick rings', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thick', u'sliced into  rings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'\xbd tsp. red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'1 Tbs. red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'Tbs'}, {u'originalString': u'\xbd tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/farmers-market-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush tomatoes with 1 Tbs. canola oil. Grill 5 minutes, or until tender and slightly charred. Pur\xe9e tomatoes, oregano, vinegar, olive oil, garlic, salt, and red pepper flakes in blender or food processor.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to bowl.3. To make Pizza: Toss broccoli, bell peppers, and onion with canola oil in bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place in grill basket or thread onto wooden skewers, and grill 5 to 7 minutes, or until tender. Cool until easy to handle, then thinly slice bell peppers.4.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [], u'step': u'Spread Tomato Sauce on Par-', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Baked Pizza Crust. Top with vegetables, capers (if using), and black pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93770, u'name': u'prepared pizza crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place Pizza on grill, close lid, and cook 5 minutes, or until sauce is warmed and bottom of crust is crispy.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u'Brush grill grate well with canola oil, and preheat grill to medium.2. To make Tomato Sauce'}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Fonterutoli Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 1582, u'instructions': u'1. Brush grill grate well with canola oil, and preheat grill to medium.2. To make Tomato Sauce: Brush tomatoes with 1 Tbs. canola oil. Grill 5 minutes, or until tender and slightly charred. Pur\xe9e tomatoes, oregano, vinegar, olive oil, garlic, salt, and red pepper flakes in blender or food processor. Transfer to bowl.3. To make Pizza: Toss broccoli, bell peppers, and onion with canola oil in bowl. Place in grill basket or thread onto wooden skewers, and grill 5 to 7 minutes, or until tender. Cool until easy to handle, then thinly slice bell peppers.4. Spread Tomato Sauce on Par-Baked Pizza Crust. Top with vegetables, capers (if using), and black pepper. Place Pizza on grill, close lid, and cook 5 minutes, or until sauce is warmed and bottom of crust is crispy.', u'spoonacularSourceUrl': u'https://spoonacular.com/farmers-market-pizza-758199', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}