{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/212621-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 212621, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey burgers', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 54.64, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 large carrot, grated', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'grated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'rolls and cucumber slices, to serve', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u'slices'}, {u'originalString': u'100g dried apricots, finely chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9032, u'unit': u'g'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'85g porridge oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 large onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'450g 1lb minced turkey', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 450.0, u'consistency': u'solid', u'id': 5165, u'unit': u'g'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1581/turkey-burgers-', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tbsp oil in a pan and gently fry the onion for 5 mins until soft.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for 1 min.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the oats and fry for 2 mins more. Tip into a bowl and set aside to cool.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [], u'step': u'Add the rest of the ingredients to the cooled mixture and mix well with your hands. Season to taste and shape into 8 patties.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining olive oil in a large, non-stick frying pan and sear the burgers on each side until well coloured (3-4 mins).', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to a baking sheet and cook in the oven for 10-15 mins.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve in rolls with Tangy tomato chutney and cucumber slices.For the chutney heat 1 tbsp of olive oil in a pan and add 1 finely chopped onion. Cook for 5 mins until softened. Stir in 1 crushed garlic clove and cook for a further min.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add 1 tbsp sundried tomato paste, a 400g can good-quality chopped tomatoes and a pinch of sugar. Gently cook for 20-25 mins until rich and thick. Season to taste, then leave to cool before serving.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Turkey Burgers works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Terrazas de los Andes Reserva Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Bright red color with purple shades. Intense floral and fruity notes. Presence of violets, ripe black cherry and plum aromas. ReIts sweet and juicy mouthfeel delivers finesse, delicate tannins and an elegant finish of black fruits. veals a toasty and spicy character of black pepper and chocolate.Pair with Tuna Carpaccio and Red Fruits Vinaigrette, Tenderloin served with MediterraneanRatatouille and Moist Semisweet Chocolate Cake over Mascarpone and Red Fruits Ice Cream.', u'title': u'Terrazas de los Andes Reserva Malbec', u'price': u'$21.99', u'id': 438817, u'link': u'https://www.wine.com/product/terrazas-de-los-andes-reserva-malbec-2014/162923', u'imageUrl': u'https://spoonacular.com/productImages/438817-312x231.jpg'}]}, u'aggregateLikes': 39, u'instructions': u'Heat 1 tbsp oil in a pan and gently fry the onion for 5 mins until soft. Add the garlic and cook for 1 min. Add the oats and fry for 2 mins more. Tip into a bowl and set aside to cool.Add the rest of the ingredients to the cooled mixture and mix well with your hands. Season to taste and shape into 8 patties.Heat oven to 200C/fan 180C/gas 6. Heat the remaining olive oil in a large, non-stick frying pan and sear the burgers on each side until well coloured (3-4 mins). Transfer to a baking sheet and cook in the oven for 10-15 mins. Serve in rolls with Tangy tomato chutney and cucumber slices.For the chutney heat 1 tbsp of olive oil in a pan and add 1 finely chopped onion. Cook for 5 mins until softened. Stir in 1 crushed garlic clove and cook for a further min. Add 1 tbsp sundried tomato paste, a 400g can good-quality chopped tomatoes and a pinch of sugar. Gently cook for 20-25 mins until rich and thick. Season to taste, then leave to cool before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-burgers-212621', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}