{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/221570-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 221570, u'veryPopular': False, u'lowFodmap': False, u'title': u'Douze-pointe pies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 99.91, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tsp'}, {u'originalString': u'\xbd x 400g can cherry tomatoes or chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011693, u'unit': u''}, {u'originalString': u'3 25g mature cheddar, grated', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 1009, u'unit': u'g'}, {u'originalString': u'1 egg, beaten Egg egg The ultimate convenience food, eggs are powerhouses of nutrition, packed with protein and a…', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with protein and a…', u'packed', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 egg yolk, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'50g feta cheese, crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'2 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3 spring onion, chopped Spring onion sp-ring un-yun Also known as scallions or green onions, spring onions are in fact very young onions, harvested…', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u"1 tsp paprika Paprika pa-preek-ah A spice that's central to Hungarian cuisine, paprika is made by drying a particular type of…", u'aisle': u'Spices and Seasonings', u'name': u'hungarian paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'tsp'}, {u'originalString': u'zest 1 lemon, plus a tablespoon of juice Lemon le-mon Oval in shape, with a pronouced bulge on one end, lemons are one of the most versatile fruits…', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'with a pronouced bulge on one end, lemons are one of the most versatile fruits…', u'plus a tablespoon of juice lemon le-mon oval in shape, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u"1 tbsp olive oil Olive oil ol-iv oyl Probably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil cooking spray', u'metaInformation': [u'fresh', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cooking-spray.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1004679, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp finely chopped parsley Parsley par-slee One of the most ubiquitous herbs in British cookery, parsley is also popular in European and…', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u"85g potato, cut into chunks Potato po-tate-oh The world's favourite root vegetable, the potato comes in innumerable varieties. A member of…", u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u"cut into chunks potato po-tate-oh the world's favourite root vegetable, the potato comes in innumerable varieties. a member of…"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'1 small red pepper, deseeded and diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'small', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'75g ricotta Ricotta ree-cot-a Ricotta is an Italian curd cheese. Made from whey, it is traditionally a by-product of making…', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'g'}, {u'originalString': u'500g pack all-butter shortcrust pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'shortcrust pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dough.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10018338, u'unit': u'g'}, {u'originalString': u'75g spring green, roughly chopped Spring greens sp-ring gr-eens Spring greens are the first cabbages of the year. They have fresh, loose heads without the hard…', u'aisle': u'Produce', u'name': u'spring mix', u'metaInformation': [u'fresh', u'green', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 10021052, u'unit': u'g'}, {u'originalString': u'1 tbsp butter Butter butt-err Butter is made when lactic-acid producing bacteria are added to cream and churned to make an…', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sweet cream butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1 tsp vinegar (Sherry, red wine or malt)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [u'red', u'(Sherry, wine or malt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tsp'}, {u'originalString': u'a little oil, for greasing', u'aisle': u'?', u'name': u'a little oil', u'metaInformation': [u'for greasing'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'unit': u'servings'}, {u'originalString': u'85g white or green cabbage, finely shredded, then roughly chopped Cabbage ka-badge The cabbage, or brassica, family is huge, and includes everything from the familiar red, white…', u'aisle': u'?', u'name': u'brassica', u'metaInformation': [u'shredded', u'white', u'green', u'red', u'roughly chopped', u'finely'], u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3094678/douzepointe-pies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Grease the holes of a 12-hole muffin tin, then line each row with a long, thin strip of baking parchment (to help you remove the cooked pies).', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out two-thirds of the pastry on a lightly floured surface and stamp out 12 x 11-12cm circles (you may need to re-roll the trimmings). Press a circle into each hole. Wrap the remaining pastry and any scraps in cling film.To make the Polish filling, boil the potatoes in salted water until tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain well, tip back into the pan to steam-dry for 1 min, then mash.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the butter to a frying pan and gently fry the cabbage until soft. Stir intothe mash with the spring onions, cheese, egg and seasoning. Set aside.For the Spanish pies, put the pepper, onion, garlic, paprika and oil in a pan and fry until softened.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the tomatoes, sugar, vinegar and parsley, and simmer for 10 mins until thickened. Set aside to cool.To make the Greek pies, put the feta, ricotta, yolk, lemon zest and juice, and garlic in a food processor. Whizz until smooth. Tip in the greens, pulse for a few secs to chop in, then season well.Fill 4 cases with the Polish filling, 4 with the Spanish and 4 with the Greek.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [], u'step': u'Roll out the remaining pastry and stamp out 12 x 6-7cm circles.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add a top to each pie, pressing the edges together to seal. Re-roll the trimmings and stamp out the numbers 1 and 2 with mini number cutters. Stick a 1 and 2 onto each pie with a little of the beaten egg, then brush the whole lids with more egg. Cover with cling film and chill for up to a day.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Bake the pies for 25-30 mins until golden. Cool in the tin  these are best served just warm. Carefully lift the pies out of the tin using the parchment strips, transfer to a platter and serve.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Snake River Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'honey , minerality , lime', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Grease the holes of a 12-hole muffin tin, then line each row with a long, thin strip of baking parchment (to help you remove the cooked pies). Roll out two-thirds of the pastry on a lightly floured surface and stamp out 12 x 11-12cm circles (you may need to re-roll the trimmings). Press a circle into each hole. Wrap the remaining pastry and any scraps in cling film.To make the Polish filling, boil the potatoes in salted water until tender. Drain well, tip back into the pan to steam-dry for 1 min, then mash. Add the butter to a frying pan and gently fry the cabbage until soft. Stir intothe mash with the spring onions, cheese, egg and seasoning. Set aside.For the Spanish pies, put the pepper, onion, garlic, paprika and oil in a pan and fry until softened. Add the tomatoes, sugar, vinegar and parsley, and simmer for 10 mins until thickened. Set aside to cool.To make the Greek pies, put the feta, ricotta, yolk, lemon zest and juice, and garlic in a food processor. Whizz until smooth. Tip in the greens, pulse for a few secs to chop in, then season well.Fill 4 cases with the Polish filling, 4 with the Spanish and 4 with the Greek. Roll out the remaining pastry and stamp out 12 x 6-7cm circles. Add a top to each pie, pressing the edges together to seal. Re-roll the trimmings and stamp out the numbers 1 and 2 with mini number cutters. Stick a 1 and 2 onto each pie with a little of the beaten egg, then brush the whole lids with more egg. Cover with cling film and chill for up to a day.Heat oven to 200C/180C fan/gas 6. Bake the pies for 25-30 mins until golden. Cool in the tin  these are best served just warm. Carefully lift the pies out of the tin using the parchment strips, transfer to a platter and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/douze-pointe-pies-221570', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}