{u'recipes': [{u'sourceName': u'I Breathe Im Hungry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/939767-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 939767, u'veryPopular': True, u'lowFodmap': False, u'title': u'Low Carb Snickerdoodles – Keto & Gluten Free', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 59.63, u'creditText': u'I Breathe Im Hungry', u'extendedIngredients': [{u'originalString': u'2 cups superfine almond flour*', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93740, u'unit': u'cups'}, {u'originalString': u'1/2 cup salted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001001, u'unit': u'cup'}, {u'originalString': u'pinch of kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'3/4 cup erythritol granulated sweetener*', u'aisle': u'Health Foods;Baking', u'name': u'erythritol', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sanding-sugar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 98887, u'unit': u'cup'}, {u'originalString': u'1/2 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp erythritol granulated sweetener*', u'aisle': u'Health Foods;Baking', u'name': u'erythritol', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sanding-sugar.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 98887, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'https://www.ibreatheimhungry.com/2016/12/low-carb-snickerdoodles-keto-gluten-free.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees (F)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix all of the cookie ingredients in a medium sized bowl until a stiff dough forms.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the dough into 16 balls of equal size. (approx. 1.5 inches in diameter)', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the cinnamon and sweetener in a small dish.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Roll the balls in the mixture until well coated.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on a parchment-lined cookie sheet and flatten slightly with the bottom of a glass.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350 degrees (F) for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and cool slightly before serving.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 3466, u'instructions': u'Preheat oven to 350 degrees (F)Mix all of the cookie ingredients in a medium sized bowl until a stiff dough forms.Roll the dough into 16 balls of equal size. (approx. 1.5 inches in diameter)Combine the cinnamon and sweetener in a small dish.Roll the balls in the mixture until well coated.Place on a parchment-lined cookie sheet and flatten slightly with the bottom of a glass.Bake at 350 degrees (F) for 15 minutes.Remove and cool slightly before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/low-carb-snickerdoodles-keto-gluten-free-939767', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}