{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/211115-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 211115, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian rice with chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 303.32, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'400g can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'g'}, {u'originalString': u'300ml chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'100g long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'g'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 orange peppers, halved, deseeded and sliced thickly', u'aisle': u'Produce', u'name': u'orange peppers', u'metaInformation': [u'halved', u'deseeded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u"4 tbsp ready-made pesto (you'll find long-life jars on the shelves with pasta sauces or more expensive fresh pots in the chiller cabinet)", u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'fresh', u'with pasta sauces expensive  pots in the chiller cabinet)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tbsp'}, {u'originalString': u'1 red onion, cut into 8 wedges', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'cut into 8 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 skinless boneless chicken breast fillets or 4 boneless thighs, cut into strips', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'fillet'}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2342/italian-rice-with-chicken', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oilin a large, shallow ovenproof pan, add the chickenand cook for 3-4 mins until golden all over.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Removefrom pan and set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the onion and peppers, and cook for 3 minsor until lightly golden. Tip in the garlic and fry fora min. Stir in the rice, then the tomatoes, stockand reserved chicken. Turn up the heat and bringto the boil before transferring to the oven to cook,uncovered, for 20 mins. Season to taste and drizzleover the pesto before serving.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 286, u'instructions': u'Heat oven to 200C/fan 180C/gas 6. Heat the oilin a large, shallow ovenproof pan, add the chickenand cook for 3-4 mins until golden all over. Removefrom pan and set aside.Add the onion and peppers, and cook for 3 minsor until lightly golden. Tip in the garlic and fry fora min. Stir in the rice, then the tomatoes, stockand reserved chicken. Turn up the heat and bringto the boil before transferring to the oven to cook,uncovered, for 20 mins. Season to taste and drizzleover the pesto before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-rice-with-chicken-211115', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}