{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/553570-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553570, u'veryPopular': True, u'lowFodmap': False, u'title': u'No bake strawberry cheesecake', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 249.02, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'13 graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 13.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 full dropper liquid stevia', u'aisle': u'Baking', u'name': u'liquid stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia-drops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10811111, u'unit': u''}, {u'originalString': u'2 8oz 1/3 less fat cream cheese', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 43274, u'unit': u'oz'}, {u'originalString': u'4 Tbs maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 4.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'Tbs'}, {u'originalString': u'12 oz organic strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9316, u'unit': u'oz'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.eatgood4life.com/no-bake-strawberry-cheesecake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u"In your food processor add the graham crackers and pulse until pulverized. Divide the graham cracker between 6 parfait classes or any other glasses of your choice (I didn't add any butter or coconut oil to the graham crackers but you could if you like, I like my graham crackers without it though)", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the cream cheese, yogurt, 2 tablespoons of maple syrup, 8 oz of the strawberries and stevia to the food processor and pulse until combine. Divide this mixture between the 6 glasses.In a medium bowl, with a hand stand mixer, whipped the heavy cream with the 2 tablespoons of maple syrup. Divide the heavy cream between the 6 glasses and decorate with the strawberries. You may sprinkle a little bit of reserved graham crackers over the strawberries if you like.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [], u'step': u'Place the cheesecakes in the refrigerator and let them cool for at least 2 hours before serving.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 764, u'instructions': u"<p>In your food processor add the graham crackers and pulse until pulverized. Divide the graham cracker between 6 parfait classes or any other glasses of your choice (I didn't add any butter or coconut oil to the graham crackers but you could if you like, I like my graham crackers without it though)Add the cream cheese, yogurt, 2 tablespoons of maple syrup, 8 oz of the strawberries and stevia to the food processor and pulse until combine. Divide this mixture between the 6 glasses.In a medium bowl, with a hand stand mixer, whipped the heavy cream with the 2 tablespoons of maple syrup. Divide the heavy cream between the 6 glasses and decorate with the strawberries. You may sprinkle a little bit of reserved graham crackers over the strawberries if you like.Place the cheesecakes in the refrigerator and let them cool for at least 2 hours before serving.</p>", u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-strawberry-cheesecake-553570', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}