{u'recipes': [{u'sourceName': u'Hummusapien', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/691282-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 691282, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Mushroom Tofu Chili + Giveaway', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 124.85, u'creditText': u'Hummusapien', u'extendedIngredients': [{u'originalString': u'2 bell peppers, chopped', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'2 tsp cacao powder', u'aisle': u'Baking', u'name': u'cacao powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tsp'}, {u'originalString': u'2\xbd tbsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2009, u'unit': u'tbsp'}, {u'originalString': u'1 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 lb. extra firm tofu, drained and pressed', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'firm', u'pressed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'lb'}, {u'originalString': u'1 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'2-15oz cans diced fire-roasted tomatoes', u'aisle': u'Canned and Jarred', u'name': u'fire-roasted tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 98849, u'unit': u'oz'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'8oz mushrooms, chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'1 medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tsp oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'2-15oz cans beans (I used red and white kidney beans), drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'white', u'red', u'drained and rinsed', u'canned', u'(I used and kidney beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 16033, u'unit': u'oz'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.hummusapien.com/vegan-mushroom-tofu-chili/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Drain and press tofu (I used my EZ Tofu Press) for at least thirty minutes or overnight,', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat olive oil in a medium pot/Dutch oven over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion and garlic and saute for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add mushrooms and peppers and saute for another 5 minutes.Crumble tofu and add to pot with spices.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Saute for another 7-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add beans and tomatoes, stirring to combine. Bring mixture to a boil and then reduce heat to low and simmer (covered) for about an hour, or until flavors have melded together.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili on the menu? Try pairing with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Segura Viudas Brut Reserva Heredad Cava. It has 4.1 out of 5 stars and a bottle costs about 22 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Like a rich Chardonnay with bubbles, this limited production Cava rests on an authentic pewter base and comes in a handsome hand-blown bottle emblazoned with a metal crest of the Segura Viudas family. Perfect with pasta drizzled in truffle oil, slow braised meats, cured meat and cheese plates, oysters. View More', u'title': u'Segura Viudas Brut Reserva Heredad Cava', u'price': u'$21.99', u'id': 448175, u'link': u'https://www.wine.com/product/segura-viudas-brut-reserva-heredad-cava/4103', u'imageUrl': u'https://spoonacular.com/productImages/448175-312x231.jpg'}]}, u'aggregateLikes': 60, u'instructions': u'Drain and press tofu (I used my EZ Tofu Press) for at least thirty minutes or overnight,Heat olive oil in a medium pot/Dutch oven over medium heat. Add onion and garlic and saute for 5 minutes. Add mushrooms and peppers and saute for another 5 minutes.Crumble tofu and add to pot with spices. Saute for another 7-10 minutes.Add beans and tomatoes, stirring to combine. Bring mixture to a boil and then reduce heat to low and simmer (covered) for about an hour, or until flavors have melded together.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-mushroom-tofu-chili-+-giveaway-691282', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}