{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/472278-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 472278, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Skirt Steak Skewers', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 60, u'pricePerServing': 297.51, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon red chili pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1-inch piece of ginger, sliced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/3 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 Tbsp red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 to 2 pounds skirt steak, trimmed of membranes and silver skin', u'aisle': u'Meat', u'name': u'skirt steak', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 23167, u'unit': u'pounds'}, {u'originalString': u'1/3 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'25-30 bamboo or wooden skewers for grilling', u'aisle': u'?', u'name': u'wooden skewers', u'metaInformation': [u'for grilling'], u'unitLong': u'', u'unitShort': u'', u'amount': 25.0, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/grilled_skirt_steak_skewers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}], u'step': u'Place bamboo or wooden skewers in a dish, cover with water to soak.2\xa0', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place all marinade ingredients in a small bowl, stir to combine. Set aside.   3\xa0Lay the skirt steak horizontally out on a cutting board. Notice the grain of the steak that goes up and down.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23167, u'name': u'skirt steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut the steak into segments\xa0(along the grain of the meat), about 6 to 8-inches long. Then, with each segment, turn the segment so the grain of the meat runs in a line from left to right, and\xa0cut thin strips (1/4 to 1/3-inch thick, 1 1/2-inch wide, 6 to 8-inches long), angling the knife, cutting\xa0across the grain.4', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the steak slices in a\xa0non-reactive bowl or casserole dish. Toss with the marinade to coat. Chill and marinate for at least 30 minutes, up to 2 hours. 5 Preheat your grill, whether charcoal or gas, for high-direct heat. While the grill is preheating, thread the marinated skirt steak strips onto your pre-soaked skewers.6 When ready to grill, brush the grill grates with olive oil (helps to fold a paper towel, soak the towel in olive oil, and use long handled tongs to hold the soaked paper towel and spread oil on the grates). You know your grill is hot enough when you can only stand to hold your hand 1 inch above the grill grates for one second. Working in batches if necessary, lay the skirt steak skewers on the hot grill grates, perpendicular to the grates. Grill for 3 to 4 minutes per side, until cooked through.', u'length': {u'number': 33, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23167, u'name': u'skirt steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from grill and let sit for a few minutes before serving.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Skirt Steak can be paired with Merlot, Cabernet Sauvignon, and Pinot Noir. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. One wine you could try is Franciscan Estate Merlot. It has 4.3 out of 5 stars and a bottle costs about 25 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Our Oakville estate produces distinctive, supple Merlot characterized by flavors of cherries and plums.  This wine shows rich, lush and velvety fruit flavors of cherries, plums and blackberries that merge with light toasted oak.  Blended with a samll percentage of Cabernet Sauvignon and Cabernet Franc this wine is well balanced and structured with a lingering finish.Alcohol: 13.5% View More', u'title': u'Franciscan Estate Merlot', u'price': u'$25.49', u'id': 443286, u'link': u'https://www.wine.com/product/franciscan-estate-merlot-1998/7308', u'imageUrl': u'https://spoonacular.com/productImages/443286-312x231.jpg'}]}, u'aggregateLikes': 57, u'instructions': u'1 Place bamboo or wooden skewers in a dish, cover with water to soak.2\xa0Place all marinade ingredients in a small bowl, stir to combine. Set aside.   3\xa0Lay the skirt steak horizontally out on a cutting board. Notice the grain of the steak that goes up and down. Cut the steak into segments\xa0(along the grain of the meat), about 6 to 8-inches long. Then, with each segment, turn the segment so the grain of the meat runs in a line from left to right, and\xa0cut thin strips (1/4 to 1/3-inch thick, 1 1/2-inch wide, 6 to 8-inches long), angling the knife, cutting\xa0across the grain.4 Place the steak slices in a\xa0non-reactive bowl or casserole dish. Toss with the marinade to coat. Chill and marinate for at least 30 minutes, up to 2 hours. 5 Preheat your grill, whether charcoal or gas, for high-direct heat. While the grill is preheating, thread the marinated skirt steak strips onto your pre-soaked skewers.6 When ready to grill, brush the grill grates with olive oil (helps to fold a paper towel, soak the towel in olive oil, and use long handled tongs to hold the soaked paper towel and spread oil on the grates). You know your grill is hot enough when you can only stand to hold your hand 1 inch above the grill grates for one second. Working in batches if necessary, lay the skirt steak skewers on the hot grill grates, perpendicular to the grates. Grill for 3 to 4 minutes per side, until cooked through. Remove from grill and let sit for a few minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-skirt-steak-skewers-472278', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}