{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/613119-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 613119, u'veryPopular': False, u'lowFodmap': False, u'title': u'One-Pot Mediterranean Pasta', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 346.7, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'14 oz. Reese quartered artichoke hearts, drained', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'drained', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 93828, u'unit': u'oz'}, {u'originalString': u"14.5 oz. Swanson's Natural Goodness chicken broth", u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'oz'}, {u'originalString': u'12.5 oz. BumbleBee white meat chicken, drained', u'aisle': u'Meat', u'name': u'chicken meat', u'metaInformation': [u'white', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.5, u'consistency': u'liquid', u'id': 1015006, u'unit': u'oz'}, {u'originalString': u'\xbd c. feta', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'c'}, {u'originalString': u'\xbc c. hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16158, u'unit': u'c'}, {u'originalString': u'1 tsp. Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'tsp'}, {u'originalString': u'6 oz. Lindsay ripe green olives, drained', u'aisle': u'Canned and Jarred', u'name': u'olives', u'metaInformation': [u'green', u'ripe', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 9195, u'unit': u'oz'}, {u'originalString': u'12 oz. uncooked pasta (I used gluten-free corn pasta)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'gluten-free', u'uncooked', u'(I used corn pasta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20420, u'unit': u'oz'}, {u'originalString': u'14 oz. Del Monte petite diced tomatoes with garlic and olive oil, undrained', u'aisle': u'Produce', u'name': u'petite tomatoes', u'metaInformation': [u'diced', u'with garlic and olive oil, undrained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10311693, u'unit': u'oz'}, {u'originalString': u'1 c. shredded mozzarella', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'c'}, {u'originalString': u'2 c. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'c'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://wearychef.com/one-pot-mediterranean-pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken broth, water, and Italian seasoning to a dutch oven or large, deep skillet. Bring to a low boil over medium-high heat. Stir in chicken, olives, artichoke hearts, tomatoes. Return to a boil.Stir in pasta, and continue cooking at a low boil, stirring occasionally, for the recommended cooking time on the pasta package.Stir in hummus and mozzarella, and reduce heat to medium. Cook, stirring often, until cheese is melted. Sprinkle crumbled feta over the entire dish or on individual servings to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 68, u'instructions': u'Add chicken broth, water, and Italian seasoning to a dutch oven or large, deep skillet. Bring to a low boil over medium-high heat. Stir in chicken, olives, artichoke hearts, tomatoes. Return to a boil.Stir in pasta, and continue cooking at a low boil, stirring occasionally, for the recommended cooking time on the pasta package.Stir in hummus and mozzarella, and reduce heat to medium. Cook, stirring often, until cheese is melted. Sprinkle crumbled feta over the entire dish or on individual servings to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-pot-mediterranean-pasta-613119', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}