{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/519944-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 26, u'id': 519944, u'veryPopular': True, u'lowFodmap': False, u'title': u'Smores Brownie Pie', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 66.83, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1/4 cup unsweetened natural cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u"2 ounces dark chocolate, coarsely chopped (I used Trader Joe's 72% Pound Plus Bar)", u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'72%', u'coarsely chopped', u"(I used Trader Joe's Pound Plus Bar)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'about 2 tablespoons graham cracker crumbs (half of 1 graham cracker, crushed in your fist)', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [u'crushed', u'(half of 1 graham cracker, in your fist)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'tablespoons'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon instant espresso granules, optional but recommended', u'aisle': u'Tea and Coffee', u'name': u'instant espresso', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10014214, u'unit': u'teaspoon'}, {u'originalString': u'about 8 ounces large marshmallows, enough to cover pan completely', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'large', u'to cover pan completely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 19116, u'unit': u'ounces'}, {u'originalString': u'3/4 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 cup unsalted butter (1 stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.averiecooks.com/2014/03/smores-brownie-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F. Spray a 9-inch pie dish with cooking spray; set aside. In a medium, microwave-safe bowl combine the butter, chopped chocolate, cocoa powder, and heat to melt, about 45 seconds on high power. Stop to check and stir.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat in 10-second bursts as necessary until mixture can be stirred smooth; set aside. In a \xa0large mixing bowl, lightly whisk together the eggs and sugar.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the vanilla.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add the chocolate mixture to the egg-sugar mixture and whisk to combine. Optionally whisk in the espresso granules. It doesn't make the brownies taste like coffee and intensifies the chocolate flavor; omit if you're concerned. Stir in the flour until just combined; don't overmix. Turn batter out into prepared pan, smoothing the top lightly with a spatula.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake for about 26 minutes, or until a toothpick inserted in the center comes out mostly clean, or with a few moist crumbs, but no batter. Turn broiler to high power. Keep the oven rack in the middle of the oven, not up high where you'd normally broil things because it's safer in the middle; the marshmallows are less likely to char. Evenly sprinkle the chocolate chips over brownie. Evenly sprinkle the marshmallows. Broil for about 1 minute, or until marshmallows are golden and puffed.\xa0Keep an incredibly close eye on them so they don't burn because broilers are extremely unforgiving. I broil on the middle rack, with the oven door open, and\xa0stare into the oven the entire time and jostle the pie dish around to aim the broiler on specific patches I want more or less toasted.", u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and evenly sprinkle with graham cracker crumbs before serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}, {u'equipment': [], u'step': u"Serve as soon as it's comfortably cooled, or allow to cool completely before serving. Pie will keep airtight at room temperature for up to 5 days.", u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'apricot , apple , honey', u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 13425, u'instructions': u"Preheat oven to 350F. Spray a 9-inch pie dish with cooking spray; set aside. In a medium, microwave-safe bowl combine the butter, chopped chocolate, cocoa powder, and heat to melt, about 45 seconds on high power. Stop to check and stir. Heat in 10-second bursts as necessary until mixture can be stirred smooth; set aside. In a \xa0large mixing bowl, lightly whisk together the eggs and sugar. Whisk in the vanilla. Add the chocolate mixture to the egg-sugar mixture and whisk to combine. Optionally whisk in the espresso granules. It doesn't make the brownies taste like coffee and intensifies the chocolate flavor; omit if you're concerned. Stir in the flour until just combined; don't overmix. Turn batter out into prepared pan, smoothing the top lightly with a spatula. Bake for about 26 minutes, or until a toothpick inserted in the center comes out mostly clean, or with a few moist crumbs, but no batter. Turn broiler to high power. Keep the oven rack in the middle of the oven, not up high where you'd normally broil things because it's safer in the middle; the marshmallows are less likely to char. Evenly sprinkle the chocolate chips over brownie. Evenly sprinkle the marshmallows. Broil for about 1 minute, or until marshmallows are golden and puffed.\xa0Keep an incredibly close eye on them so they don't burn because broilers are extremely unforgiving. I broil on the middle rack, with the oven door open, and\xa0stare into the oven the entire time and jostle the pie dish around to aim the broiler on specific patches I want more or less toasted. Remove from oven and evenly sprinkle with graham cracker crumbs before serving. Serve as soon as it's comfortably cooled, or allow to cool completely before serving. Pie will keep airtight at room temperature for up to 5 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/smores-brownie-pie-519944', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}