{u'recipes': [{u'sourceName': u'Alidas Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/547614-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 547614, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sweet Potato Black Bean Chili #SundaySupper', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 126.48, u'creditText': u'Alidas Kitchen', u'extendedIngredients': [{u'originalString': u'2 cans (15 ounces each) black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounces'}, {u'originalString': u'2 cans (14.5 ounces each) diced tomatoes with chiles, undrained', u'aisle': u'Canned and Jarred', u'name': u'canned diced tomatoes', u'metaInformation': [u'diced', u'with chiles, undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 11531, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon cayenne, adjust to taste', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 green bell pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 pound sweet potatoes, peeled and diced', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u'pound'}, {u'originalString': u'2 to 3 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 55.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://alidaskitchen.com/2013/10/06/sweet-potato-black-bean-chili/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a large Dutch oven, heat oil over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add sweet potato, onion and bell pepper and saute until onion softens, about 5 to 7 minutes. Stir in garlic, chili powder, cumin, oregano and cayenne, and saute for 1 minute, or until garlic is fragrant.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add diced tomatoes, black beans, and broth and stir until combined.  Bring to a boil and then simmer for 30 minutes, or until sweet potatoes are tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Poema Brut Cava with a 4.2 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Vibrant aromas of ripe peaches, pears and toasted bread with a hint of spice fill the nose. The palate is dry with a rich, creamy texture. Layers of flavor include orange rind and spice that persists through an elegant finish. View More', u'title': u'Poema Brut Cava', u'price': u'$10.99', u'id': 449764, u'link': u'https://www.wine.com/product/poema-brut-cava/104054', u'imageUrl': u'https://spoonacular.com/productImages/449764-312x231.jpg'}]}, u'aggregateLikes': 8692, u'instructions': u'In a large Dutch oven, heat oil over medium-high heat.  Add sweet potato, onion and bell pepper and saute until onion softens, about 5 to 7 minutes. Stir in garlic, chili powder, cumin, oregano and cayenne, and saute for 1 minute, or until garlic is fragrant.Add diced tomatoes, black beans, and broth and stir until combined.  Bring to a boil and then simmer for 30 minutes, or until sweet potatoes are tender.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-black-bean-chili-sundaysupper-547614', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}