{u'recipes': [{u'sourceName': u'Sprinkle Bakes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/66012-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 66012, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Pavolvas with Chocolate Mascarpone Mousse', u'diets': [], u'pricePerServing': 154.63, u'creditText': u'Sprinkle Bakes', u'extendedIngredients': [{u'originalString': u'Remove the mixture from the heat and strain it through a fine mesh sieve into a bowl. Cover and refrigerate until the mixture is thoroughly chilled, about 2 hours or overnight.', u'aisle': u'Bread', u'name': u'bread bowl', u'metaInformation': [u'chilled', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 99169, u'unit': u''}, {u'originalString': u'Chocolate Pavlovas', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19081, u'unit': u'servings'}, {u'originalString': u'Chocolate Mascarpone Mousse', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19081, u'unit': u'servings'}, {u'originalString': u'Chocolate Pavlovas with Chocolate Mascarpone Mousse', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'with chocolate mascarpone mousse'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19081, u'unit': u'servings'}, {u'originalString': u'Chocolate Pavolvas with Chocolate Mascarpone Mousse', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'with chocolate mascarpone mousse'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19081, u'unit': u'servings'}, {u'originalString': u'Chocolate Pavolvas with Chocolate Mascarpone Mousse Recipe', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'with chocolate mascarpone mousse recipe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19081, u'unit': u'servings'}, {u'originalString': u'9 ounces (255 grams) 72% chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'72%', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 255.0, u'consistency': u'solid', u'id': 19081, u'unit': u'grams'}, {u'originalString': u'1/3 cup (30 grams) cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 19165, u'unit': u'grams'}, {u'originalString': u'Creme Anglaise', u'aisle': u'Beverages', u'name': u'creme soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 14130, u'unit': u'servings'}, {u'originalString': u'3 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'6 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 tbsp (30 mls) Grand Marnier (or orange juice)', u'aisle': u'Alcoholic Beverages', u'name': u'grand marnier', u'metaInformation': [u'(or orange juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'unitLong': u'mls', u'unitShort': u'mls', u'amount': 30.0, u'consistency': u'liquid', u'id': 10314534, u'unit': u'mls'}, {u'originalString': u'\xbd cup plus 1 tbsp (110 grams) white granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white', u'(110 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup (235 mls) heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'mls', u'unitShort': u'mls', u'amount': 235.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'mls'}, {u'originalString': u'1 \xbd cups (355 mls) heavy cream (cream with a milk fat content of between 36 40 percent)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'with a milk fat content of between 36 40 percent)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'mls', u'unitShort': u'mls', u'amount': 355.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'mls'}, {u'originalString': u'Place a rack in the center of the oven and preheat to 200\xba F (95\xba C) degrees. Line two baking sheets with silpat or parchment and set aside.', u'aisle': u'Meat', u'name': u'lamb rack', u'metaInformation': [u'with silpat or parchment and set aside.', u'(95\xba C)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/racks-of-lamb.jpg', u'unitLong': u'sheet', u'unitShort': u'sheets', u'amount': 1.0, u'consistency': u'liquid', u'id': 17029, u'unit': u'sheets'}, {u'originalString': u'grated zest of 1 average sized lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 2/3 cups (390 mls) mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'mls', u'unitShort': u'mls', u'amount': 390.0, u'consistency': u'solid', u'id': 93820, u'unit': u'mls'}, {u'originalString': u'pinch of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'Fill a pastry bag with the meringue. Pipe the meringue into whatever shapes you desire. Alternatively, you could just free form your shapes and level them a bit with the back of a spoon.', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'with the meringue. pipe the meringue into whatever shapes you desire. alternatively, you could just free form your shapes and level them a bit with the back of a spoon.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'bag'}, {u'originalString': u"\xbc cup (30 grams) confectioner's (icing) sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(icing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'6 tbsp (75 grams) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'1 vanilla bean, split or 1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'split', u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u''}, {u'originalString': u'1 cup (235 mls) whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'mls', u'unitShort': u'mls', u'amount': 235.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'mls'}, {u'originalString': u"As for the Pavlovas, I made rounds, diamonds, and star clusters. They were very tasty, but the main attraction is the mascarpone mousse. It's pretty easy to make and sooo good with coffee.", u'aisle': u'?', u'name': u'as', u'metaInformation': [u'with coffee.', u'good', u"for the pavlovas, i made rounds, diamonds, and star clusters. they were very tasty, but the main attraction is the mascarpone mousse. it's pretty easy to make and sooo  "], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Assembly', u'aisle': u'?', u'name': u'assembly', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Bake for 2-3 hours until the meringues become dry and crisp. Cool and store in an airtight container for up to 3 days.', u'aisle': u'?', u'name': u'bake', u'metaInformation': [u'dry', u'for 2-3 hours until the meringues become  and crisp. cool and store in an airtight container for up to 3 days.'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'By', u'aisle': u'?', u'name': u'by', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Heather Baird', u'aisle': u'?', u'name': u'heather baird', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'link', u'aisle': u'?', u'name': u'link', u'metaInformation': [], u'unitLong': u'link', u'unitShort': u'link', u'amount': 1.0, u'unit': u'link'}, {u'originalString': u"Pipe the mousse onto the pavlovas and drizzle with the mascarpone cream over the top. Dust with confectioner's sugar and fresh fruit if desired.", u'aisle': u'?', u'name': u'pipe the mousse onto the pavlovas and drizzle', u'metaInformation': [u'fresh', u"with the mascarpone cream over the top. dust with confectioner's sugar and  fruit if desired."], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Sunday, June 27, 2010', u'aisle': u'?', u'name': u'sunday', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 2010.0, u'unit': u''}, {u'originalString': u'[click for printable version]', u'aisle': u'?', u'name': u'[click', u'metaInformation': [u'for printable version]'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.sprinklebakes.com/2010/06/chocolate-pavolvas-with-chocolate.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"As I type this there are chaffing dishes to fill, beverages to ice, and appetizers to be plated. I'm so happy that my family is coming over for a big Sunday dinner. There's no better feeling than feeding the ones I love, so forgive me if this post seems rushed. Lots to do!The June 2010 Daring", u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Bakers challenge was hosted by Dawn of Doable and Delicious. Dawn challenged the Daring', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u"Bakers to make Chocolate Pavlovas and Chocolate Mascarpone Mousse. The challenge recipe is based on a recipe from the book Chocolate Epiphany by Francois Payard.Inspiration came from the profusion of blackberries growing wild over our local landscape. At this time of year you can usually find them growing wild by the roadside, and it's perfectly acceptable to pull over and pick a few for yourself. But take caution, as blackberry brambles are usually in sunny places where snakes like to warm themselves.I veered slightly from the DB recipe by making a blackberry coulis and mixing a portion of it with the creme anglaise. It was so delicious, I could have eaten the creamy berry mixture like soup! (Or maybe I did...)As for the Pavlovas, I made rounds, diamonds, and star clusters. They were very tasty, but the main attraction is the mascarpone mousse. It's pretty easy to make and sooo good with coffee.Chocolate Pavlovas with Chocolate Mascarpone Mousse[click for printable version]Chocolate Pavlovas3 large egg whites cup plus 1 tbsp (110 grams) white granulated sugar cup (30 grams) confectioners (icing) sugar1/3 cup (30 grams) cocoa powder", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place a rack in the center of the oven and preheat to 200 F (95 C) degrees. Line two baking sheets with silpat or parchment and set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the egg whites in a bowl and whip until soft peaks form. Increase speed to high and gradually add granulated sugar about 1 tbsp at a time until stiff peaks form. (The whites should be firm but moist.)Sift the confectioners sugar and cocoa powder over the egg whites and fold the dry ingredients into the white. (This looks like it will not happen. Fold gently and it will eventually come together.)Fill a pastry bag with the meringue. Pipe the meringue into whatever shapes you desire. Alternatively, you could just free form your shapes and level them a bit with the back of a spoon.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake for 2-3 hours until the meringues become dry and crisp. Cool and store in an airtight container for up to 3 days.Chocolate Mascarpone Mousse1  cups (355 mls) heavy cream (cream with a milk fat content of between 36 and 40 percent)grated zest of 1 average sized lemon9 ounces (255 grams) 72% chocolate, chopped1 2/3 cups (390 mls) mascarponepinch of nutmeg2 tbsp (30 mls) Grand Marnier (or orange juice)Put  cup (120 mls) of the heavy cream and the lemon zest in a saucepan over medium high heat. Once warm, add the chocolate and whisk until melted and smooth.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'id': 10314534, u'name': u'grand marnier'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the mixture to a bowl and let sit at room temperature until cool.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the mascarpone, the remaining cup of cream and nutmeg in a bowl. Whip on low for a minute until the mascarpone is loose.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the Grand Marnier and whip on medium speed until it holds soft peaks. (DO NOT OVERBEAT AS THE MASCARPONE WILL BREAK.)', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'id': 10314534, u'name': u'grand marnier'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Mix about  of the mascarpone mixture into the chocolate to lighten. Fold in the remaining mascarpone until well incorporated. Fill a pastry bag with the mousse. Again, you could just free form mousse on top of the pavlova.Creme Anglaise1 cup (235 mls) whole milk1 cup (235 mls) heavy cream1 vanilla bean, split or 1 tsp pure vanilla extract6 large egg yolks6 tbsp (75 grams) sugar', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'pure vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, whisk together the egg yolks and sugar until the mixture turns pale yellow.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the milk, cream and vanilla in a saucepan over medium high heat, bringing the mixture to a boil. Take off the heat.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour about  cup of the hot liquid into the yolk mixture, whisking constantly to keep from making scrambled eggs.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the yolk mixture into the pan with the remaining cream mixture and put the heat back on medium. Stir constantly with a wooden spoon until the mixture thickens enough to lightly coat the back of a wooden spoon. DO NOT OVERCOOK.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the mixture from the heat and strain it through a fine mesh sieve into a bowl. Cover and refrigerate until the mixture is thoroughly chilled, about 2 hours or overnight.Assembly', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Pipe the mousse onto the pavlovas and drizzle with the mascarpone cream over the top. Dust with confectioners sugar and fresh fruit if desired.link', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Chocolate Pavolvas with Chocolate Mascarpone Mousse', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [], u'step': u'By', u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'Heather Baird', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Published:Sunday, June 27, 2010Sunday, June 27, 2010Chocolate Pavolvas with Chocolate Mascarpone Mousse Recipe', u'number': 20, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'aggregateLikes': 8, u'instructions': u"As I type this there are chaffing dishes to fill, beverages to ice, and appetizers to be plated. I'm so happy that my family is coming over for a big Sunday dinner. There's no better feeling than feeding the ones I love, so forgive me if this post seems rushed. Lots to do!The June 2010 Daring Bakers challenge was hosted by Dawn of Doable and Delicious. Dawn challenged the Daring Bakers to make Chocolate Pavlovas and Chocolate Mascarpone Mousse. The challenge recipe is based on a recipe from the book Chocolate Epiphany by Francois Payard.Inspiration came from the profusion of blackberries growing wild over our local landscape. At this time of year you can usually find them growing wild by the roadside, and it's perfectly acceptable to pull over and pick a few for yourself. But take caution, as blackberry brambles are usually in sunny places where snakes like to warm themselves.I veered slightly from the DB recipe by making a blackberry coulis and mixing a portion of it with the creme anglaise. It was so delicious, I could have eaten the creamy berry mixture like soup! (Or maybe I did...)As for the Pavlovas, I made rounds, diamonds, and star clusters. They were very tasty, but the main attraction is the mascarpone mousse. It's pretty easy to make and sooo good with coffee.Chocolate Pavlovas with Chocolate Mascarpone Mousse[click for printable version]Chocolate Pavlovas3 large egg whites cup plus 1 tbsp (110 grams) white granulated sugar cup (30 grams) confectioners (icing) sugar1/3 cup (30 grams) cocoa powderPlace a rack in the center of the oven and preheat to 200 F (95 C) degrees. Line two baking sheets with silpat or parchment and set aside.Put the egg whites in a bowl and whip until soft peaks form. Increase speed to high and gradually add granulated sugar about 1 tbsp at a time until stiff peaks form. (The whites should be firm but moist.)Sift the confectioners sugar and cocoa powder over the egg whites and fold the dry ingredients into the white. (This looks like it will not happen. Fold gently and it will eventually come together.)Fill a pastry bag with the meringue. Pipe the meringue into whatever shapes you desire. Alternatively, you could just free form your shapes and level them a bit with the back of a spoon.Bake for 2-3 hours until the meringues become dry and crisp. Cool and store in an airtight container for up to 3 days.Chocolate Mascarpone Mousse1  cups (355 mls) heavy cream (cream with a milk fat content of between 36 and 40 percent)grated zest of 1 average sized lemon9 ounces (255 grams) 72% chocolate, chopped1 2/3 cups (390 mls) mascarponepinch of nutmeg2 tbsp (30 mls) Grand Marnier (or orange juice)Put  cup (120 mls) of the heavy cream and the lemon zest in a saucepan over medium high heat. Once warm, add the chocolate and whisk until melted and smooth. Transfer the mixture to a bowl and let sit at room temperature until cool.Place the mascarpone, the remaining cup of cream and nutmeg in a bowl. Whip on low for a minute until the mascarpone is loose. Add the Grand Marnier and whip on medium speed until it holds soft peaks. (DO NOT OVERBEAT AS THE MASCARPONE WILL BREAK.)Mix about  of the mascarpone mixture into the chocolate to lighten. Fold in the remaining mascarpone until well incorporated. Fill a pastry bag with the mousse. Again, you could just free form mousse on top of the pavlova.Creme Anglaise1 cup (235 mls) whole milk1 cup (235 mls) heavy cream1 vanilla bean, split or 1 tsp pure vanilla extract6 large egg yolks6 tbsp (75 grams) sugarIn a bowl, whisk together the egg yolks and sugar until the mixture turns pale yellow.Combine the milk, cream and vanilla in a saucepan over medium high heat, bringing the mixture to a boil. Take off the heat.Pour about  cup of the hot liquid into the yolk mixture, whisking constantly to keep from making scrambled eggs. Pour the yolk mixture into the pan with the remaining cream mixture and put the heat back on medium. Stir constantly with a wooden spoon until the mixture thickens enough to lightly coat the back of a wooden spoon. DO NOT OVERCOOK.Remove the mixture from the heat and strain it through a fine mesh sieve into a bowl. Cover and refrigerate until the mixture is thoroughly chilled, about 2 hours or overnight.AssemblyPipe the mousse onto the pavlovas and drizzle with the mascarpone cream over the top. Dust with confectioners sugar and fresh fruit if desired.linkChocolate Pavolvas with Chocolate Mascarpone MousseByHeather BairdPublished:Sunday, June 27, 2010Sunday, June 27, 2010Chocolate Pavolvas with Chocolate Mascarpone Mousse Recipe", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-pavolvas-with-chocolate-mascarpone-mousse-66012', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}