{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520074-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 520074, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Thin Mints (no-bake, vegan)', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 11.55, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'18 Ritz Crackers ( Ritz are accidentally vegan)', u'aisle': u'Savory Snacks', u'name': u'ritz crackers', u'metaInformation': [u'( Ritz are accidentally vegan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 18621, u'unit': u''}, {u'originalString': u'3/4 teaspoon peppermint extract* (see notes below)', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [u'(see notes below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 1022050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup semi-sweet chocolate chips, melted', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vegetable shortening, optional but recommended', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.averiecooks.com/2012/07/homemade-thin-mints.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Prepare a baking sheet by lining it with parchment paper or wax paper; set aside. Clear out a spot in your refrigerator or freezer to accommodate baking sheet. In a shallow microwave-safe bowl, combine chocolate chips and shortening (the shortening helps the chocolate stay smooth when using it for dipping; it prevents that thick and gloppy,\xa0chocolate getting hard before you want it to\xa0phenomenon) and heat for 1 minute on high power to melt. Stir and heat in 10 to 15 second bursts until chocolate can be stirred very smooth. To the melted chocolate add 1/2 teaspoon peppermint extract* and stir. If you prefer it mintier, add another 1/4 teaspoon. I used 3/4 teaspoon in total, but because all brands and taste preferences differ, taste your chocolate and add peppermint to taste.\xa0*Note: Mint extract is much, much more potent than vanilla extract; 1 teaspoon of mint extract has an extreme amount of potency compared with 1 teaspoon vanilla extract. You cannot un-do mint once added so be very, very careful to not over-do it and end up with a bottle of Listerine-tasting food. There are different kinds of mint extracts available and are labeled as “mint, “peppermint”, “spearmint” and more. For this recipe I used store-brand (Kroger/Ralph’s) “peppermint extract” sold in a small 1 ounce bottle. Select the version of “mint” you think sounds best as not all types are available in all areas. \xa0', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1022050, u'name': u'peppermint extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Add 1 cracker to the chocolate, coat it, and remove it by lightly scooping it up from the underside with a fork, allowing excess chocolate to drain off through fork tines.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place cracker on parchment and repeat with all remaining crackers. If necessary, re-heat the chocolate in 10 to 15 second bursts if it starts getting too firm for smooth dipping. After all crackers have been dipped, place baking sheet in refrigerator. Although these will solidify at room temperature, the shortening in the chocolate lengthens the amount of time that will take; the fridge or freezer helps speed it up. Store extra Thin Mints in an airtight container in the refrigerator for many weeks. In the freezer, I estimate that these could be kept for 3 to 6 months successfully.  Recipe inspiration from\xa0Kraft', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 52464, u'instructions': u'Prepare a baking sheet by lining it with parchment paper or wax paper; set aside. Clear out a spot in your refrigerator or freezer to accommodate baking sheet. In a shallow microwave-safe bowl, combine chocolate chips and shortening (the shortening helps the chocolate stay smooth when using it for dipping; it prevents that thick and gloppy,\xa0chocolate getting hard before you want it to\xa0phenomenon) and heat for 1 minute on high power to melt. Stir and heat in 10 to 15 second bursts until chocolate can be stirred very smooth. To the melted chocolate add 1/2 teaspoon peppermint extract* and stir. If you prefer it mintier, add another 1/4 teaspoon. I used 3/4 teaspoon in total, but because all brands and taste preferences differ, taste your chocolate and add peppermint to taste.\xa0*Note: Mint extract is much, much more potent than vanilla extract; 1 teaspoon of mint extract has an extreme amount of potency compared with 1 teaspoon vanilla extract. You cannot un-do mint once added so be very, very careful to not over-do it and end up with a bottle of Listerine-tasting food. There are different kinds of mint extracts available and are labeled as “mint, “peppermint”, “spearmint” and more. For this recipe I used store-brand (Kroger/Ralph’s) “peppermint extract” sold in a small 1 ounce bottle. Select the version of “mint” you think sounds best as not all types are available in all areas. \xa0Add 1 cracker to the chocolate, coat it, and remove it by lightly scooping it up from the underside with a fork, allowing excess chocolate to drain off through fork tines. Place cracker on parchment and repeat with all remaining crackers. If necessary, re-heat the chocolate in 10 to 15 second bursts if it starts getting too firm for smooth dipping. After all crackers have been dipped, place baking sheet in refrigerator. Although these will solidify at room temperature, the shortening in the chocolate lengthens the amount of time that will take; the fridge or freezer helps speed it up. Store extra Thin Mints in an airtight container in the refrigerator for many weeks. In the freezer, I estimate that these could be kept for 3 to 6 months successfully.  Recipe inspiration from\xa0Kraft', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-thin-mints-no-bake-vegan-520074', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}