{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/693625-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 693625, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Cranberry Vanilla Scones', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 89.23, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup melted coconut oil (can sub unmelted buttery spread or palm shortening)', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted', u'(can sub unmelted buttery spread or palm shortening)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'\xbc cup sugar or coconut sugar**', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'4 to 6 teaspoons dairy-free milk beverage (I used Silk Unsweetened Coconutmilk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [u'unsweetened', u'(I used Silk Coconutmilk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1 cup vanilla dairy-free yogurt (I used exactly 2 5-ounce Silk Vanilla Dairy-Free Yogurt Alternatives)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free vanilla yogurt', u'metaInformation': [u'(I used exactly 2 5-ounce Silk Vanilla Dairy-Free Yogurt Alternatives)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 43261, u'unit': u'cup'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'Pinch fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 inch vanilla bean or 1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u'inch'}, {u'originalString': u'2 cups flour (all-purpose, whole wheat pastry, or a combination of the two)*', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat', u'all-purpose', u'(, pastry, or a combination of the two)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20080, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/vegan-cranberry-vanilla-scones', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 400F and line a baking sheet with parchment paper or a silicone baking mat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the flour, sugar, baking powder, baking soda, and salt together in a large bowl with a whisk or fork.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the coconut oil and whisk until a coarse meal forms. Gently stir in the cranberries followed by the dairy-free yogurt, folding just until combined. The dough will be a bit sticky.Turn the dough out onto a floured surface and divide into two pieces. Shape and flatten each into rounds that are about 1 inches high. I use damp hands to shape the dough. If it is still too sticky, you can add a touch more flour to make it manageable.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the dough rounds on your prepared baking sheet and either score into quarters (leaving them attached), or cut into quarters and separate the wedges (for crustier sides).', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake the scones for 20 minutes or until lightly golden on top.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool for 10 minutes on the baking sheet before removing and/or breaking the scones apart (if scored).While the scones cool, place the powdered sugar in a medium bowl and thoroughly whisk in the milk beverage, starting with 4 teaspoons, the seeds from the vanilla bean or the vanilla extract, and the salt.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add more milk beverage as needed to get the consistency you desire (thicker for piping or thick lines, thinner for coating as I did above).Once the cranberry vanilla scones have cooled, top with the icing as desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Scone. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 226, u'instructions': u'Preheat your oven to 400F and line a baking sheet with parchment paper or a silicone baking mat.Whisk the flour, sugar, baking powder, baking soda, and salt together in a large bowl with a whisk or fork. Add the coconut oil and whisk until a coarse meal forms. Gently stir in the cranberries followed by the dairy-free yogurt, folding just until combined. The dough will be a bit sticky.Turn the dough out onto a floured surface and divide into two pieces. Shape and flatten each into rounds that are about 1 inches high. I use damp hands to shape the dough. If it is still too sticky, you can add a touch more flour to make it manageable. Place the dough rounds on your prepared baking sheet and either score into quarters (leaving them attached), or cut into quarters and separate the wedges (for crustier sides).Bake the scones for 20 minutes or until lightly golden on top. Let cool for 10 minutes on the baking sheet before removing and/or breaking the scones apart (if scored).While the scones cool, place the powdered sugar in a medium bowl and thoroughly whisk in the milk beverage, starting with 4 teaspoons, the seeds from the vanilla bean or the vanilla extract, and the salt. Add more milk beverage as needed to get the consistency you desire (thicker for piping or thick lines, thinner for coating as I did above).Once the cranberry vanilla scones have cooled, top with the icing as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-cranberry-vanilla-scones-693625', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}